Перем РССохраненныеНастройкиИмяОбъекта;
Перем МобиС;
Перем КаталогЛогФайлов;
Перем РазделительСтрок;

Процедура ПриОткрытии()
	
	ЭтотОбъект.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	ЭтотОбъект.КомпоновщикНастроек.Восстановить();
	
	ЗначПараметра=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Задание");
	Параметр=ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СвойствоЗадание"));
	Параметр.Значение=ЗначПараметра;
	Параметр.Использование=Истина;
	
	ЗначПараметра=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Уник.код документа");
	Параметр=ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СвойствоУникКод"));
	Параметр.Значение=ЗначПараметра;
	Параметр.Использование=Истина;
	
	ЗначПараметра=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Время затраченное на создание документа в КПК(мин)");
	Параметр=ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СвойствоВремяОформления"));
	Параметр.Значение=ЗначПараметра;
	Параметр.Использование=Истина;
КонецПроцедуры

// Читает Значение из регистра "СохраненныеНастройки" 
// Параметры
// Агент - тип Справочник.Пользователи, торговый агент для которого читается настройка
// НаименованиеНастройки - Строка.имя под которым сохранено значение
// Возвращаемое значение
// Значение  сохраненное в регистре
// Если значение НЕ найдено, то возвращается  Неопределено
Функция ПрочитатьИзРегистраСохраненныеНастройки(Агент,НаименованиеНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СохраненныеНастройки.СохраненнаяНастройка
	|ИЗ
	|	РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
	|ГДЕ
	|	СохраненныеНастройки.Пользователь = &Агент
	|	И СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
	|	И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки";
	
	Запрос.УстановитьПараметр("Агент"                , Агент);
	Запрос.УстановитьПараметр("ИмяОбъекта"           , РССохраненныеНастройкиИмяОбъекта);
	Запрос.УстановитьПараметр("НаименованиеНастройки", НаименованиеНастройки);
	Результат = Запрос.Выполнить();
	
	СохраненнаяНастройка = Неопределено;	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Попытка 
			СохраненнаяНастройка = Выборка.СохраненнаяНастройка.Получить();
		Исключение
		КонецПопытки;
	КонецЕсли;
	возврат  СохраненнаяНастройка;
	
КонецФункции // ПрочитатьИзРегистраСохраненныеНастройки()

// Читает Значение из регистра "СохраненныеНастройки" с проверкой типа возвращаемого значения
// Параметры
// Агент - тип Справочник.Пользователи, торговый агент для которого читается настройка
// НаименованиеНастройки - Строка.имя под которым сохранено значение
// ЗначениеПоУмолчанию - значение которое будет возвращено, если в регистре ничего НЕ найдено
// ЗначениеПоУмолчанию2 - второй допустимый тип значения настройки
// Возвращаемое значение
// Значение сохраненное в регистре
// Если значение НЕ найдено или тип найденного значения не соответствует нужному, 
// то возвращается параметр ЗначениеПоУмолчанию
Функция ПолучитьНастройку(Агент,НаименованиеНастройки,ЗначениеПоУмолчанию,ЗначениеПоУмолчанию2=Ложь) Экспорт
	Значение = ПрочитатьИзРегистраСохраненныеНастройки(Агент,НаименованиеНастройки);
	Если ТипЗнч(Значение) <> Тип("Цвет") Тогда // Для обхода Мутабельности ЗначениеЗаполнено(ТипЗнч("Цвет"))
		Если Значение = Неопределено Тогда  //нет такого параметра
			Значение = ЗначениеПоУмолчанию;
		ИначеЕсли (ТипЗнч(Значение)<> ТипЗнч(ЗначениеПоУмолчанию)) И 
			(ТипЗнч(Значение)<> ТипЗнч(ЗначениеПоУмолчанию2))Тогда  //тип значения НЕ соответствует значению по умолчанию
			Значение = ЗначениеПоУмолчанию;
		ИначеЕсли (НЕ ЗначениеЗаполнено(Значение)) И (ТипЗнч(Значение)<> Тип("Число")) И (ТипЗнч(Значение)<> Тип("Дата")) Тогда  //ПустоеЗначение
			Значение = ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	Возврат Значение;
КонецФункции // ПолучитьНастройку()

Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент.Очистить();
	Компоновщик=Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет=Компоновщик.Выполнить(СхемаКомпоновкиДанных,ЭтотОбъект.КомпоновщикНастроек.Настройки);//,ЭтотОбъект.ПолучитьМакет("КонтрольПосещенияТТ_Макет"));
	
	Если Не ЗначениеЗаполнено(Макет.ЗначенияПараметров.НачалоПериода.Значение) Тогда
		Предупреждение("Не выбрано начало периода");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Макет.ЗначенияПараметров.КонецПериода.Значение) Тогда
		Предупреждение("Не выбрано окончание периода");
		Возврат;
	КонецЕсли;
	
	ПроцессорКомпоновки=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
    ПроцессорВывода.НачатьВывод(); 

    ТаблицаЗафиксирована = Ложь;
    Пока Истина Цикл
        ЭлементРезультата = ПроцессорКомпоновки.Следующий();
         Если ЭлементРезультата= Неопределено Тогда
            Прервать;     
         Иначе     
            Если Не ТаблицаЗафиксирована И ЭлементРезультата.ЗначенияПараметров.Количество() >  0 Тогда
                ТаблицаЗафиксирована = Истина;
                ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.ВысотаТаблицы;
            КонецЕсли;
            ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
         КонецЕсли;
    КонецЦикла;
    ПроцессорВывода.ЗакончитьВывод();
КонецПроцедуры
	
РССохраненныеНастройкиИмяОбъекта = "Mobi-C";
//Определим Основного пользователя Моби-с (в нем храним все основные параметры)
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	Пользователи.Ссылка
|ИЗ
|	Справочник.Пользователи КАК Пользователи
|ГДЕ
|	Пользователи.Код = """ + РССохраненныеНастройкиИмяОбъекта + """";

Результат = Запрос.Выполнить();
Если Результат.Пустой() Тогда
	МобиС = Справочники.Пользователи.ПустаяСсылка();
Иначе
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	МобиС = Выборка.Ссылка;
КонецЕсли; 

Shell=Новый COMОбъект("WScript.Shell");
КаталогЛогФайлов  = ПолучитьНастройку(МобиС, "КаталогЛогФайлов", Shell.SpecialFolders.Item("MyDocuments")+"\MobiS");

РазделительСтрок = Символы.ВК + Символы.ПС;
