///ВНИМАНИЮ РАЗРАБОТЧИКОВ
//Протокол обмена с КПК подробно описан на сайте 
//Все поля являются ОБЯЗАТЕЛЬНЫМИ 
//Если какое-либо поле Вам НЕ нужно, то следует передавать пустое значение соответствующего типа
//Передавать значения другого типа НЕЛЬЗЯ

Перем ПараметрыАгента;				// Структура с параметрами агента, для которого обрабатывается запрос
Перем ДниНедели;					// Массив с сокращенными названиями дней недели
Перем ТаблТекущиеКоординаты;		// ТЗ. Таблица с координатами агентов для мониторинга
Перем ФайлБлокировки;				// Файл для блокирования возможности запуска еще одной копии Моби-С с тем-же рабочим портом
Перем РежимРабочееМесто;			// Булево. Переменная определяющая режим работы - сервер или автономный режим работы
Перем ТаблРабочихДней;
Перем ДатаРасчетаРабочихДней;
Перем ТребуетсяПерезапускСервера;	// Признак что необходимо перезапустить сервер после восстановления связи с Интернет
Перем врФайлПинг4;
Перем врФайлПинг8;
Перем ОшибкаВыгрузкаСАктивнойТранзакцией;

//////////////////////////////////////
//ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Убирает последний символ с кодом 13 из строки
Функция ПолучитьСтрокуБез13(Строки, Номер)
	Возврат Сокрп(СтрПолучитьСтроку(Строки,Номер));
КонецФункции

// Преобразует строку в число если это возможно, иначе возвращает 0
Функция ПолучитьЧислоИзСтроки(ПарамСтр)
	Попытка
		ПарамЧисло=Число(ПарамСтр);
	Исключение
		ПарамЧисло=0;
	КонецПопытки;
	Возврат ПарамЧисло;
КонецФункции // ПолучитьЧислоИзСтроки()

// Формирует строку для идентификации документа и проверки на то, что документ уже загружался ранее
// Параметры:
// 		Название документа - Строка, название документа на КПК.
// 		СтрШапки - строка Таблицы значений, содержит все реквизиты шапки документа в соответствии с протоколом обмена.
// Возвращаемое значение:
// 		Строка, идентифицирующая документ в формате: 
//		<Название документа на КПК> № <Код агента>_<Номер документа на КПК> 
//		от <Дата документа на КПК> <Время последнего сохранения на КПК>
Функция СформироватьУникальныйКодДокумента(НазваниеДокумента, СтрШапки) 
	ИдДок = НазваниеДокумента
		+ " № "+СокрЛП(ПараметрыАгента.Агент.Физлицо.Код)+"_"+Строка(СтрШапки.ИдДок)
		+ " от "+Формат(стрШапки.Дата,"ДФ=dd.MM.yyyy") +" "+СтрШапки.Время;
	возврат ИдДок;
КонецФункции 	

// Проверяет существование документа с заданным идентификатором
// Параметры:
// 		ИдДок - Строка, идентификатор документа, сформированный функцией СформироватьУникальныйКодДокумента
// Возвращаемое значение:
// 		Истина - документ существует
// 		Ложь - документ не существует
Функция ЕстьДокумент(ИдДок)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Объект,
	|	Значение КАК Категория
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	Свойство = &Свойство
	|	И Значение = &Значение";
	
	Запрос.УстановитьПараметр("Значение",ИдДок);
	Запрос.УстановитьПараметр("Свойство",ПВХУникКодДокумента);
	Результат = Запрос.Выполнить();
	
	ТаблицаРезультатов = Новый ТаблицаЗначений;
	ТаблицаРезультатов = Результат.Выгрузить();
	Если ТаблицаРезультатов.Количество()>0  Тогда
		
		возврат ТаблицаРезультатов[0][0];
	Иначе
		возврат Неопределено;
	КонецЕсли;	
	возврат НЕ Результат.Пустой();
КонецФункции 

// Записывает код документа, сформированный функцией СформироватьУникальныйКодДокумента в
// соответствующее свойство документа
// Параметры:
// 		Док - ссылка на документ
// 		ИдДок - Строка, код документа, сформированный функцией СформироватьУникальныйКодДокумента
Процедура ЗаписатьУникКодДокумента(Док, ИдДок)
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект    = Док.ссылка;
	МенеджерЗаписи.Свойство  = ПВХУникКодДокумента;
	МенеджерЗаписи.Значение  = ИдДок;
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры
 
// функция проверяет наличие в базе данных полей ВерсияДанных, в БД для 1С 8.1 и 1С 8.2 в режиме совместимости с 8.1
//ВерсияДанных - недоступна.
//в версии данных могут встречаться символы "A..Z", "a..z", "0..9", "\", "=", " "
//перечень символов возможно неполный, остальные символы покачто не встречались в значениях ВерсияДанных
//в данном перечне недопустимыми для использования в имени файля являются "\", символ заменяется на ")"
Функция ЕстьВерсияДанных()
	Попытка
		СисИнфо=Новый  СистемнаяИнформация;
		Версия1С=СисИнфо.ВерсияПриложения;
		ЕстьВерсияДанных=?(Лев(Версия1С,3)="8.1",Ложь,Истина);
		Если ЕстьВерсияДанных Тогда
			Попытка 
				режимСовместимости = Строка(Метаданные.РежимСовместимости);
				ЕстьВерсияДанных = Найти(режимСовместимости, "8_1") = 0;
			Исключение
				ЕстьВерсияДанных = Ложь;
			КонецПопытки;
		КонецЕсли;
		Возврат ЕстьВерсияДанных;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

// Определяет учитывать НДС в документах Заказ, Реализация, Поступление, ВозвратОтПокупателя
Функция ОпределитьУчитыватьНДС(Организация, Дата)
	УП = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Ложь, Организация, "Бух");
	Возврат ?(ЗначениеЗаполнено(УП), ?(УП.Свойство("ОрганизацияЯвляетсяПлательщикомНДС"), УП.ОрганизацияЯвляетсяПлательщикомНДС, Истина), Истина);
КонецФункции

Функция ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор, Валюта)
	Структура = Неопределено;
	Модуль = ?(Конфигурация = "БухКазахстан", "УправлениеВзаиморасчетами", "БухгалтерскийУчетРасчетовСКонтрагентами");
	Выполнить("Структура = " + Модуль + ".ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор, Валюта)");
	Возврат Структура;
КонецФункции

// Для Казахстана
Функция ОрганизацияПлательщикКПН(Организация)
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ТекущаяДата(), Ложь, Организация, "Нал");
	ОрганизацияЯвляетсяПлательщикомКПН	= Истина;
	Если УчетнаяПолитикаНУ.Свойство("ОрганизацияЯвляетсяПлательщикомКПН") Тогда
		ОрганизацияЯвляетсяПлательщикомКПН = УчетнаяПолитикаНУ.ОрганизацияЯвляетсяПлательщикомКПН;
	КонецЕсли;		
    Возврат ОрганизацияЯвляетсяПлательщикомКПН;
КонецФункции
	
///////////////////////////////////////////////////////
//НАСТРОЙКИ ПОЛЬЗОВАТЕЛЕЙ

// Выполняет поиск и, при необходимости, создание пользователя, у которого хранятся
// настройки обработки
// Возвращаемое значение:
// 		Истина - всегда.
Функция ЗагрузитьАгентов()
	ГруппаМобиС = Справочники.ГруппыПользователей.НайтиПоНаименованию("Mobi-C:Агенты");
	Если ГруппаМобиС.Пустая() Тогда
		НовЭлем=Справочники.ГруппыПользователей.СоздатьЭлемент();
		НовЭлем.Наименование="Mobi-C:Агенты";
		Попытка
			НовЭлем.Записать();
		Исключение
			запросМаксимальныйКод = новый Запрос;
			запросМаксимальныйКод.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ГруппыПользователей.Код КАК Код
			|ИЗ
			|	Справочник.ГруппыПользователей КАК ГруппыПользователей
			|
			|УПОРЯДОЧИТЬ ПО
			|	ГруппыПользователей.Ссылка";
			Выборка = запросМаксимальныйКод.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НовЭлем.Код = Формат(Число(СокрЛП(Выборка.Код)) + 1, "ЧН=0; ЧГ=0");
				НовЭлем.Записать();
			КонецЕсли;			
		КонецПопытки;
		ГруппаМобиС=НовЭлем.Ссылка;
	КонецЕсли;
	
	//Определим Основного пользователя Моби-с (в нем храним все основные параметры)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.Пользователи ГДЕ Код = """ + РССохраненныеНастройкиИмяОбъекта + """");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		спр = Справочники.Пользователи.СоздатьЭлемент();
		спр.Наименование = РССохраненныеНастройкиИмяОбъекта + ":(служебный)";
		спр.Код = РССохраненныеНастройкиИмяОбъекта;
		спр.Записать();
		МобиС=спр.Ссылка;
		Сообщить("Создан элемент справочника ""Пользователи"" с наименованием " + спр.Наименование);

		//имя должно быть с пробелами справа
		ИмяПользователя = Лев(спр.Код + "                                               ",50);
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = ИмяПользователя;
		ПользовательИБ.ПолноеИмя = спр.Наименование;
		ПользовательИБ.АутентификацияСтандартная 	= Истина;
		ПользовательИБ.ПоказыватьВСпискеВыбора 		= Ложь;
		Попытка
			ПользовательИБ.Записать();
		Исключение
			Сообщить("Ошибка при добавлении пользователя в список пользователей ИБ """ + ИмяПользователя + """");
			возврат Истина;
		КонецПопытки;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		МобиС = Выборка.Ссылка;
	КонецЕсли; 
	возврат Истина;
Конецфункции

//////////////////////////////////////////////////////
//ОБМЕН С КПК                       

// Передать строку в КПК 
// Параметры 
//    Адрес - идентификатор сессии обмена
//    ТекстСообщения - Строка с сообщением
//    ПризнакОкончанияДанных - Число  =1
// Возвращаемое значение - Булево , Истина когда передача прошла успешно, Ложь - передача НЕ удалась
Функция СерверПослатьОтвет(Адрес, ТекстСообщения, ПризнакОкончанияДанных)
	Если РежимОтладки Тогда
		ответ = ""+ТекущаяДата()+":"+Адрес+">"+Символы.ПС+ТекстСообщения;
		ДобавитьСообщение(ответ);
	КонецЕсли; 
		
	Если АвтономныйРежим Тогда
		возврат Истина;
	Иначе	
		Статус = Сервер.ПослатьОтвет(Адрес,ТекстСообщения,ПризнакОкончанияДанных);
		Если Статус=1 Тогда
			возврат Истина;
		Иначе
			возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
КонецФункции // СерверПослатьОтвет()

// Закончить отправку ответа на КПК 
// Параметры
// Агент - Справочник.Пользователи, агент для которого был передан ответ
// НазвЗапроса - строка , название запроса
// Статус
Процедура ЗапросОбработан(Агент, НазвЗапроса, Статус)
	Если Статус Тогда
		ДобавитьВЛогФайл("Запрос '"+НазвЗапроса+"' успешно обработан",Агент);
	Иначе
		ДобавитьВЛогФайл("Запрос '"+НазвЗапроса+"' НЕ обработан",Агент,0,СтатусСообщения.Важное);
	КонецЕсли;
	Если НЕ АвтономныйРежим Тогда
		Сервер.ЗапросОбработан();
	КонецЕсли;
	
Конецпроцедуры

// Добавляет Информационное сообщение в Лог-файл
// Параметры
//    ТекстСообщения - Строка с сообщением
Процедура ДобавитьСообщение(ТекстСообщения)
	Попытка
		ДобавитьВЛогФайл(ТекстСообщения, ПараметрыАгента.Агент, 0 ,СтатусСообщения.Обычное)   
	Исключение
		ДобавитьВЛогФайл(ТекстСообщения, , 0 ,СтатусСообщения.Обычное)   
	КонецПопытки; 	
КонецПроцедуры

// Добавляет сообщение об Ошибке в Лог-файл
// Параметры
//    ТекстСообщения - Строка с сообщением
Процедура ДобавитьОшибку(ТекстСообщения)
	ДобавитьВЛогФайл(ТекстСообщения, ПараметрыАгента.Агент, 0 ,СтатусСообщения.Важное)
КонецПроцедуры

// Выгрузка в КПК порции обмена
// Параметры
// 		Адрес - идентификатор сессии обмена
// 		Ответ - строка, сообщение для передачи в КПК
// 		ТекстСообщенияУдача - Строка, сообщение помещаемое в лог файл в случае удачной выгрузки
// 		ТекстСообщенияОшибка - Строка, сообщение помещаемое в лог файл в случае ошибки
//		ФлагЗавершенияОбмена - число, 1 - признак что выгружаемые данные являются последними, иначе - 0
// Возвращаемое значение:
//   	Булево - Истина - если выгружено удачно; ЛОЖЬ - если была ошибка
Функция ПорцияОбмена(Адрес, Ответ, ТекстСообщенияУдача, ТекстСообщенияОшибка = "", ФлагЗавершенияОбмена = 0)
	
	ОтветОтКПК = СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,ФлагЗавершенияОбмена);
	
	Если ОтветОтКПК Тогда
		ДобавитьСообщение(ТекстСообщенияУдача);
	Иначе	
		Если ТекстСообщенияОшибка="" Тогда
			ТекстСообщенияОшибка = "Ошибка:"+ТекстСообщенияУдача;
		КонецЕсли; 
		ДобавитьОшибку(ТекстСообщенияОшибка);
	КонецЕсли;
	Возврат ОтветОтКПК;   
КонецФункции //ПорцияОбмена()

//Выполняет перезапуск сервера при возникновении ошибок обмена
Процедура ПерезапускСервера()
	ДобавитьВЛогФайл("Перезапуск сервера...");
	
	Если НЕ АвтономныйРежим Тогда
		Если Сервер<>Неопределено Тогда
			Сервер.Завершить();
		КонецЕсли;
		Сервер="";
		Сервер=Новый(ИмяСервера);
		Сервер.Инициализация(Порт);
		
		ОбновитьИнформациюПоКлючамДляСервера();
		
		ИспользоватьСерверМобиС=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ИспользоватьСерверМобиС");
		Если ИспользоватьСерверМобиС=Истина Тогда
			ЭлементыФормы.ПанельОблако.Видимость=Истина;
			ЭтаФорма.ПодключитьОбработчикОжидания("ОбновитьСтатусУчетнойСистемы",60*60,Ложь);
			//ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСвязьССервером",60,Ложь);
			Если ПерезапускСервераМинут > 0 Тогда
				ПодключитьОбработчикОжидания("ПерезапускСервера",ПерезапускСервераМинут * 60, Истина);
			КонецЕсли;
			ОбновитьСтатусУчетнойСистемы();
			КодУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "КодУчетнойСистемы");
			ПарольУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ПарольУчетнойСистемы");
			Сервер.СоединениеСОблаком(КодУчетнойСистемы, ПарольУчетнойСистемы, ИмяКомпьютера()+"-"+ИмяПользователя(), "WebSocket");
		Иначе
			ВывестиСтатусОблачногоСервера("Облачный сервер не подключен");
		КонецЕсли;
		
		ТаблАгентов=ПолучитьТаблицуАгентов();
		Для Каждого Стр Из ТаблАгентов Цикл
			ЗадатьПапкиНаСервере(Стр.Код);
		КонецЦикла;
	КонецЕсли; 
	
	ДобавитьВЛогФайл("Сервер запущен");
КонецПроцедуры

// Отправляет на КПК сообщение об ошибке
// Параметры:
// 		Адрес - Строка, адрес КПК.
// 		КодОшибки - Строка, код ошибки.
Процедура ОтправитьОшибку(Адрес, КодОшибки)
	СерверПослатьОтвет(Адрес,КодОшибки+РазделительСтрок,1)
КонецПроцедуры

// Формирует таблицу с Номенклатурой для агента, с которым идет сеанс связи
// Возвращает ТаблицуЗначений
Процедура ПолучитьСписокНоменклатуры(ТаблТоваров, ТаблОстатков = Неопределено)
	СформироватьПостроительОтчетаНоменклатура(
					ПараметрыАгента.Агент,
					ПараметрыАгента.ВыгружатьВсюНоменклатуру,
					ПараметрыАгента.ВыбКатИзмЦен,
					ПараметрыАгента.ВыделятьОранжевымЦветом,
					ПараметрыАгента.Склады,
					ПараметрыАгента.ОграничиватьОстатокПоСкладу,
					ПараметрыАгента.МаксимальныйОстатокПоСкладу,
					ТаблТоваров,
					ТаблОстатков);
КонецПроцедуры

// Выгружает на КПК номенклатуру Goods 
// Параметры
//    Адрес - идентификатор сессии обмена
//    ТаблТов - Таблица с номенклатурой
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьНоменклатуру(Адрес, ТаблНоменклатура)
	Если НЕ ПорцияОбмена(Адрес, "Goods", "Выгружается номенклатура...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыАгента.ДобавлятьАртикул < 0 Тогда
		ТаблНоменклатура.Сортировать("Артикул Возр, Номенклатура Возр");
	КонецЕсли;;
	
	Счетчик = 0; 
	Ответ = ""; 
	Порядок = 0;
	ЕстьВерсияДанных = ЕстьВерсияДанных();
	
	Если Конфигурация = "БухКазахстан" Тогда
		ЗапросФото = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ Объект КАК Номенклатура, Ссылка КАК ХранилищеФото";
		Если ЕстьВерсияДанных Тогда
			ТекстЗапроса = ТекстЗапроса + ", ВерсияДанных КАК ВерсияФото";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " ИЗ Справочник.ХранилищеДополнительнойИнформации
		|ГДЕ ПометкаУдаления = Ложь И ВидДанных = &Изображение И Объект В (&МассивНоменклатуры)
		|УПОРЯДОЧИТЬ ПО Объект";
		ЗапросФото.Текст = ТекстЗапроса;
		ЗапросФото.Параметры.Вставить("МассивНоменклатуры", ТаблНоменклатура.ВыгрузитьКолонку("Номенклатура"));
		ЗапросФото.Параметры.Вставить("Изображение", Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение);
		ТаблФото = ЗапросФото.Выполнить().Выгрузить();
		ТаблФото.Индексы.Добавить("Номенклатура");
	КонецЕсли;
	
	Для Каждого стрТабл Из ТаблНоменклатура Цикл
		Наименование = стрТабл.НоменклатураНаим;
		НаименованиеПолное = стрТабл.НаименованиеПолное;
		УнКод = УникИдентификатор(стрТабл.Номенклатура);
		
		Если НЕ ПустаяСтрока(стрТабл.Артикул) Тогда		
			Если ПараметрыАгента.ДобавлятьАртикул > 0 Тогда
				Наименование = Наименование + " (" + стрТабл.Артикул + ")";
				НаименованиеПолное = НаименованиеПолное + " (" + стрТабл.Артикул + ")";
			ИначеЕсли ПараметрыАгента.ДобавлятьАртикул < 0 Тогда
				Наименование = "(" + стрТабл.Артикул + ") " + Наименование;
				НаименованиеПолное = "(" + стрТабл.Артикул + ") " + НаименованиеПолное;
			КонецЕсли;
		КонецЕсли;
		
		Если Конфигурация = "БухБеларусь" И стрТабл.Партия <> "" Тогда
			УнКод = УнКод + "#" + УникИдентификатор(стрТабл.Партия);
			Наименование = "" + Наименование + " (парт. " +  стрТабл.Партия + ")";
			НаименованиеПолное = "" + НаименованиеПолное+ " (парт. " +  стрТабл.Партия + ")";
		КонецЕсли;
		АнкетаНаименование = ""; // не используется
		Изображение = "";
		
		Если Конфигурация = "БухКазахстан" Тогда
			СтрокиФото = ТаблФото.НайтиСтроки(Новый Структура("Номенклатура", стрТабл.Номенклатура));
			Для Каждого СтрФото Из СтрокиФото Цикл
				ИмяФайла = "Номенклатура";
				УникИд = Строка(СтрФото.ХранилищеФото.УникальныйИдентификатор());
				Если ЕстьВерсияДанных Тогда 
					УникИд = УникИд + ЗаменитьНедопустимыеСимволыВВерсииДанных(СтрФото.ВерсияФото); 
				КонецЕсли;
				ИмяФайла = ИмяФайла+"-"+УникИд+"_"+Строка(стрТабл.Номенклатура.УникальныйИдентификатор())+"_4";
				Картинка = СтрФото.ХранилищеФото.Хранилище.Получить();
				Если ТипЗнч(картинка) = Тип("Картинка") Тогда
					Попытка
						расширение = картинка.Формат();
					Исключение
						расширение = ФорматКартинки.НеизвестныйФормат;
						Сообщить("Удалите картинку у номенклатуры " + стрТабл.Номенклатура
						+ " - код " + стрТабл.Номенклатура.Код, СтатусСообщения.ОченьВажное);
					КонецПопытки;
					Если расширение = ФорматКартинки.НеизвестныйФормат Тогда 
					Иначе	
						ИмяФайла = ИмяФайла+"."+НРег(Строка(расширение));
						Если Изображение <> "" Тогда 
							Изображение = Изображение+Символ(31); 
						КонецЕсли;
						Изображение = Изображение + ИмяФайла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Ответ = Ответ
			+УнКод+Таб                            //уникальный код товара
			+ЦелоеВСтроку(Порядок)+Таб
			+Наименование+Таб
			+НаименованиеПолное+Таб
			+стрТабл.Весовой+Таб
			+стрТабл.МенятьЦены+Таб
			+стрТабл.СтавкаНДС+Таб
			+Изображение+Таб
			+стрТабл.Цвет+Таб
			+УбратьСпецСимволы(стрТабл.Страна)+Таб
			+УбратьСпецСимволы(стрТабл.ГТД)+ Таб
			+АнкетаНаименование+Таб
			+УбратьСпецСимволы(НРег(стрТабл.Код+" "+стрТабл.Артикул+" "+Наименование))+Таб
			+УбратьСпецСимволы(СтрЗаменить(стрТабл.ДополнительноеОписаниеНоменклатуры,Символы.ПС,Символ(15)),Символ(15))+Таб
			+стрТабл.КодСтраны+РазделительСтрок;
		
		Порядок=Порядок+1;
		
		Счетчик=Счетчик+1;
		Если Счетчик%50=0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка при выгрузке номенклатуры");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Номенклатура выгружена "+Счетчик+" записей", "Ошибка при выгрузке номенклатуры");
КонецФункции

// Выгружает на КПК остатки товаров 
// Параметры
//    Адрес - идентификатор сессии обмена
//    ТаблНоменклатура - Таблица с номенклатурой
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьОстаткиНоменклатуры(Адрес, ТаблОстатки)
	Если НЕ ПорцияОбмена(Адрес,"GoodRests","Выгружаются остатки товаров...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик = 0; 
	Ответ = ""; 
	СкладОсновной = УникИдентификатор(ПараметрыАгента.Склады[0].Склад);
	
	Для Каждого стрТабл Из ТаблОстатки Цикл
		Если стрТабл.Остаток = 0 Тогда Продолжить; КонецЕсли;
		
		УнКодТовара = УникИдентификатор(стрТабл.Номенклатура);
		Если   Конфигурация = "БухБеларусь" И стрТабл.Партия <> "" Тогда
			УнКодТовара = УнКодТовара + "#" + УникИдентификатор(стрТабл.Партия);
		КонецЕсли;
		УнКодСклада = ?(НомерСубконтоСклад > 0, УникИдентификатор(стрТабл.Склад), СкладОсновной);
		
		Ответ = Ответ
			+УнКодТовара+Таб                            //уникальный код товара
			+УнКодСклада+Таб
			+?(ПараметрыАгента.ПоказыватьОстаткиТовараВМобильномПриложении,
			+КоличествоВСтроку(Окр(стрТабл.Остаток ,3,1)), "")
			+РазделительСтрок;
		
		Счетчик=Счетчик+1;
		Если Счетчик%50=0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка при выгрузке остатков товаров");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Остатки товаров выгружены "+Счетчик+" записей", "Ошибка при выгрузке остатков товаров");
КонецФункции

// Выгружает на КПК группы Номенклатуры
// Параметры
//    Адрес - идентификатор сессии обмена
//    ТаблНоменклатуры - Таблица с Номенклатурой
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьГруппыНоменклатуры(Адрес, ТаблНоменклатуры)
	Если НЕ ПорцияОбмена(Адрес, "GoodGroups", "Выгружаются группы номенклатуры...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МВТ = новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ ТаблНоменклатуры.Номенклатура
	|ПОМЕСТИТЬ Номенклатуры
	|ИЗ &ТаблНоменклатуры КАК ТаблНоменклатуры;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ Номенклатуры.Номенклатура, ИСТИНА КАК ЭтоЭлемент
	|ИЗ Номенклатуры	
	|УПОРЯДОЧИТЬ ПО Номенклатура
	|ИТОГИ ПО Номенклатура ТОЛЬКО ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";	
		
	Запрос.Параметры.Вставить("ТаблНоменклатуры", ТаблНоменклатуры);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Счетчик = 0;
	Ответ = "";
	Пока Выборка.Следующий() Цикл
		Если Выборка.Номенклатура.Пустая() Тогда Продолжить; КонецЕсли;
		Если Выборка.ЭтоЭлемент = Истина Тогда Продолжить; КонецЕсли;
		Попытка
			Если Выборка.Уровень() <> Выборка.Номенклатура.Уровень() Тогда Продолжить; КонецЕсли;
		Исключение
			Продолжить; // Битая ссылка
		КонецПопытки;
		
		НазваниеГруппы = СокрЛП(УбратьСпецСимволы(Строка(Выборка.Номенклатура)));
		Ответ = Ответ
			+ УникИдентификатор(Выборка.Номенклатура)+Таб
			+ ЦелоеВСтроку(Счетчик)+Таб
			+ НазваниеГруппы+Таб
			+ ?(ЗначениеЗаполнено(Выборка.Номенклатура.Родитель),
				УникИдентификатор(Выборка.Номенклатура.Родитель),
				"")+РазделительСтрок;
				
		Счетчик=Счетчик+1;
		Если Счетчик%50=0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки групп номенклатуры");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	//выгружаем иерархию согласно номенклатурных групп
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ Номенклатуры.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа, ИСТИНА КАК ЭтоЭлемент
	|ИЗ Номенклатуры КАК Номенклатуры
	|ГДЕ Номенклатуры.Номенклатура.НоменклатурнаяГруппа <> &НоменклатурнаяГруппаПустая
	|	И НЕ Номенклатуры.Номенклатура.НоменклатурнаяГруппа ЕСТЬ NULL 
	|ИТОГИ ПО НоменклатурнаяГруппа ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Параметры.Вставить("НоменклатурнаяГруппаПустая", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	Выборка=Запрос.Выполнить().Выбрать();
	
	ВывестиШапку = Истина;
	
	Пока Выборка.Следующий() Цикл		
		Если Выборка.НоменклатурнаяГруппа.Пустая() Тогда Продолжить; КонецЕсли;
		Если Выборка.ЭтоЭлемент = Истина Тогда Продолжить; КонецЕсли;
		Попытка
			Если Выборка.Уровень() <> Выборка.НоменклатурнаяГруппа.Уровень() Тогда Продолжить; КонецЕсли;
		Исключение
			Продолжить; // Битая ссылка
		КонецПопытки;
		
		Если ВывестиШапку Тогда
			ВывестиШапку = Ложь;
			Ответ = Ответ
				+ "нг_НоменклатурныеГруппы" + Таб
				+ ЦелоеВСтроку(Счетчик) + Таб
				+ "Номенклатурные группы" + Таб
				+ "" + РазделительСтрок;
			Счетчик=Счетчик+1;		
		КонецЕсли;
		
		НазваниеГруппы = СокрЛП(УбратьСпецСимволы(Строка(Выборка.НоменклатурнаяГруппа)));
		Ответ=Ответ
			+ "нг_" + УникИдентификатор(Выборка.НоменклатурнаяГруппа)+Таб
			+ ЦелоеВСтроку(Счетчик)+Таб
			+ НазваниеГруппы+Таб
			+ ?(ЗначениеЗаполнено(Выборка.НоменклатурнаяГруппа.Родитель),
				"нг_"+УникИдентификатор(Выборка.НоменклатурнаяГруппа.Родитель),
				"нг_НоменклатурныеГруппы")+РазделительСтрок;
				
				Счетчик=Счетчик+1;
		Если Счетчик%50=0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки групп номенклатуры");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Группы номенклатуры выгружены "+Счетчик+" записей","Ошибка выгрузки групп номенклатуры");
	
КонецФункции

// Выгружает на КПК группы Номенклатуры
// Параметры
//    Адрес - идентификатор сессии обмена
//    ТаблНоменклатуры - Таблица с Номенклатурой
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСоставГруппНоменклатуры(Адрес, ТаблНоменклатуры)
	Если НЕ ПорцияОбмена(Адрес, "GoodGroupAssign", "Выгружается состав групп номенклатуры...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Группа = Неопределено;
	номГруппа = Неопределено;
	УнКодГруппа = "";
	УнКодНомГруппа = "";
	Ответ = "";
	Счетчик = 0;
	Для Каждого стрТабл Из ТаблНоменклатуры Цикл
		УнКод = УникИдентификатор(стрТабл.Номенклатура);

		Если Группа = стрТабл.Группа Тогда
		//если группа не изменилась, то заново вычислять УнКодГруппа нет необходимости
		Иначе
			УнКодГруппа = УникИдентификатор(стрТабл.Группа);
			Группа = стрТабл.Группа;
		КонецЕсли;
		Ответ=Ответ
			+УнКод+Таб                            //уникальный код товара
			+УнКодГруппа+РазделительСтрок;           //уникальный код группы
		
		Счетчик=Счетчик+1;
				
		Если номГруппа = стрТабл.НоменклатурнаяГруппа Тогда
		//если группа не изменилась, то заново вычислять УнКодГруппа нет необходимости
		Иначе
			УнКодНомГруппа = "нг_"+УникИдентификатор(стрТабл.НоменклатурнаяГруппа);
			номГруппа = стрТабл.НоменклатурнаяГруппа;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(номГруппа) Тогда
			Ответ=Ответ
				+УнКод+Таб                            //уникальный код товара
				+УнКодНомГруппа+РазделительСтрок;           //уникальный код группы
			
			Счетчик=Счетчик+1;
		КонецЕсли;
			
		Если Счетчик%50 > 47 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка при выгрузке состава групп номенклатуры");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(
		Адрес,Ответ,"Состав групп номенклатуры выгружен "+Счетчик+" записей","Ошибка выгрузки состава групп номенклатуры");
	
КонецФункции

// Выгружает на КПК склады
// Параметры
//    Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСклады(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"Storages","Выгружаются склады...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик=0;
	Ответ="";

	Если НомерСубконтоСклад > 0 Тогда
		Для Каждого Стр Из ПараметрыАгента.Склады Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Склад) Тогда 
				Продолжить; 
			КонецЕсли;
			Счетчик = Счетчик + 1;
			Ответ = Ответ
				+ УникИдентификатор(Стр.Склад)+Таб
				+ ЦелоеВСтроку(Счетчик)+Таб
				+ УбратьСпецСимволы(Стр.Склад.Наименование)+РазделительСтрок;
			
			Если Счетчик%50=0 Тогда
				Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
					ДобавитьОшибку("Ошибка выгрузки складов");
					Возврат Ложь;
				КонецЕсли;
				Ответ = "";
			КонецЕсли;
		КонецЦикла;
	Иначе
		Счетчик = 1;
		Склад = ПараметрыАгента.Склады[0].Склад;
		Ответ = УникИдентификатор(Склад) + Таб + "1" + Таб + УбратьСпецСимволы(Склад.Наименование) + РазделительСтрок;
	КонецЕсли;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Склады выгружены "+Счетчик+" записей","Ошибка выгрузки складов");
КонецФункции

// Выгружает единицы измерения номенклатуры, имеющихся в таблице ТаблНоменклатуры
// Параметры
//    Адрес - идентификатор сессии обмена
//    ТаблНоменклатуры - Таблица с номенклатурой
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьЕдиницы(Адрес,ТаблНоменклатуры)
	Если НЕ ПорцияОбмена(Адрес,"Units","Выгружаются единицы измерения номенклатуры...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик = 0;
	Ответ = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Табл",ТаблНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ТаблНом
	|ИЗ
	|	&Табл КАК ТАБЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблНом.Номенклатура КАК Номенклатура,
	|	ТаблНом.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК Наименование,
	|	ТаблНом.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыПоКлассификатору
	|ИЗ
	|	ТаблНом КАК ТаблНом
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Если Конфигурация = "БухБеларусь" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		               |	ТАБЛ.Партия КАК Партия
		               |ПОМЕСТИТЬ ТаблНом
		               |ИЗ
		               |	&Табл КАК ТАБЛ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблНом.Номенклатура КАК Номенклатура,
		               |	ТаблНом.Партия КАК Партия,
		               |	ТаблНом.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК Наименование,
		               |	ТаблНом.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыПоКлассификатору
		               |ИЗ
		               |	ТаблНом КАК ТаблНом
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номенклатура";
		КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КодНоменклатуры = УникИдентификатор(Выборка.Номенклатура);
		Если Конфигурация = "БухБеларусь" И Выборка.Партия <> "" Тогда
			КодНоменклатуры = КодНоменклатуры + "#" + УникИдентификатор(Выборка.Партия);
		КонецЕсли;
		Ответ=Ответ+
		СокрЛП(Выборка.КодЕдиницыПоКлассификатору)+Таб+  // КодЕдиницы
		КодНоменклатуры + Таб+
		УбратьСпецСимволы(Выборка.Наименование)+Таб+
		"3"+Таб+ // Тип
		"1"+Таб+ // Коэффициент
		""+Таб+  // Штрихкод
		"1"+Таб+ // Вес
		СокрЛП(Выборка.КодЕдиницыПоКлассификатору)+РазделительСтрок;
		
		Счетчик=Счетчик+1; 
		Если Счетчик%50=0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки единиц измерения");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Единицы измерения выгружены "+Счетчик+" записей","Ошибка выгрузки единиц измерения");
	
КонецФункции

// Добавляет строку с параметрами контрагента в выгрузку
Функция ДобавитьВыгрузкуКонтрагента(
		КодКонтрагента,НаименованиеКонтрагента,КодЮрЛица,стрТабл,СтрПлат,Порядок,ПочтАдрес,ЮрАдрес,
		Телефон,ТекстДоговора,ТипЦенКод,Коммент,Цвет,Метка,СкидкаДляКонтрагента,АнкетаНаименование,
		Широта,Долгота,ЭтоГруппа,Описание,Изображение)
	наимПолное = УбратьСпецСимволы(стрТабл.НаименованиеПолное);
	стрОтвета=""
	    + СокрЛП(КодКонтрагента)+Таб                                   //код Контрагента
		+ ЦелоеВСтроку(Порядок)+Таб                            //номер п/п
		+ УбратьСпецСимволы(НаименованиеКонтрагента)+Таб       //название
		+ КодЮрЛица+Таб                                        //Код группы (название юр лица)
		+ УбратьСпецСимволы(ПочтАдрес)+Таб                     //почтовый адрес
		+ ТекстДоговора+Таб              					  //долг
		+ ТипЦенКод+Таб                                        //Тип цен для Контрагента
		+ Коммент+Таб										  //Строка про кредит	
		+ наимПолное+Таб    //полное наименование
		+ наимПолное+Таб    //грузополучатель
		+ УбратьСпецСимволы(СтрПлат)+Таб                       //Банковские реквизиты
		+ УбратьСпецСимволы(ЮрАдрес)+Таб                       //юр. адрес
		+ стрТабл.ИНН+Таб                                      //ИНН
		+ стрТабл.КПП+Таб                                      //КПП
		+ ЦелоеВСтроку(Цвет)+Таб                          //цвет (Красный для Должников)
		+ Метка+Таб                                            //?Метка="0"
		+ СкидкаДляКонтрагента+Таб                             //Код скидки  для Контрагента
		+ УбратьСпецСимволы(стрТабл.ОсновнаяОрганизация)+Таб   //Организация для Контрагента
		+ стрТабл.ЗапретитьИзменятьТипЦен+Таб                  //Запрет изменять тип цен
		+ 1+Таб	              								//Запрет изменять Скидку
		+ УбратьСпецСимволы(Телефон)+Таб                       //телефоны   
		+ стрТабл.КодПоОКПО+Таб                                 //ОКПО
		+ АнкетаНаименование+Таб	        	                  //Анкета
		+ Широта+Таб
		+ Долгота+Таб
		+ ЭтоГруппа+Таб
		+ УбратьСпецСимволы(НРег(НаименованиеКонтрагента+" "+ПочтАдрес))+Таб
		+ УбратьСпецСимволы(СтрЗаменить(Описание,Символы.ПС,Символ(15)),Символ(15))+Таб
		+ Изображение+РазделительСтрок;

	возврат стрОтвета

КонецФункции // ДобавитьВыгрузкуКонтрагента()
 
// Формирует строку с параметрами привязки контрагентов к сегментам контрагентов
// 		в соответствии с протоколом обмена
// Параметры:
// 		КодКлиента - Строка, уникальный код контрагента, входящего в сегмент
// 		КодСегмента - Строка, уникальный код сегмента, в который входит контрагент
// Возвращаемое значение:
// 		Строка, строка параметров привязки контрагента к сегменту в соответствии с протоколом обмена
Функция ДобавитьВыгрузкуНазначенияСегментаКонтрагента(КодКлиента, КодСегмента)
    возврат ""
	    + КодКлиента+Таб
		+ КодСегмента+РазделительСтрок;

КонецФункции

// Выгружает контрагентов Clients
// Параметры
// Адрес - идентификатор сессии обмена
// тзКонтрагенты - Таблица Контрагентов
// спКонтрагентов - список контрагентов
// тзЮрЛица - в эту ТЗ передаются все группы(Юридические лица) для организации торговых точек (ТТ)
// ТТ организуются по вхождению в холдинг и/или по типам адресов заданным в настройках 
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьКонтрагентов(Адрес, тзКонтрагенты, тзАдресаДляТТ, тзЮрЛица)
	Если НЕ ПорцияОбмена(Адрес, "Clients", "Выгружаются контрагенты...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоэффПересчета = 1;
	Если ПараметрыАгента.ВалютаКПК <> мВалютаРегламентированногоУчета Тогда
		Структура = ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ТекущаяДата());
		СтруктураВалютаКПК = ПолучитьКурсВалюты(ПараметрыАгента.ВалютаКПК, ТекущаяДата());
		
		КоэффПересчета = Структура.Курс * СтруктураВалютаКПК.Кратность
			/ (?(СтруктураВалютаКПК.Курс = 0, 1, СтруктураВалютаКПК.Курс) * ?(Структура.Кратность = 0, 1, Структура.Кратность));
	КонецЕсли;
	
	ЕстьТТпоАдресам = (тзАдресаДляТТ<>Неопределено);  //точки НЕ нужны
	ЕстьВерсияДанных = ЕстьВерсияДанных();
	
	Счетчик = 0; 
	Ответ = ""; 
	Порядок = 0;
	НазваниеВалюты = ПараметрыАгента.ВалютаКПК.Наименование; 
    //тзКонтрагенты.Сортировать("Сортировка1,Сортировка2");
	Группа = "";
	ТаблКоординаты = ПолучитьКоординатыКонтрагентов();
	ДолгПросрочен = Ложь;
	найденныеСтроки = Новый массив();
	
	Если Конфигурация = "БухКазахстан" Тогда
		ЗапросФото = Новый Запрос;
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Объект КАК Контрагент,
		|	Ссылка КАК ХранилищеФото";
		Если ЕстьВерсияДанных Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	,ВерсияДанных КАК ВерсияФото";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ПометкаУдаления = Ложь
		|	И ВидДанных = &Изображение
		|	И Объект В (&МассивКлиентов)
		|УПОРЯДОЧИТЬ ПО Объект";
		
		ЗапросФото.Текст = ТекстЗапроса;
		ЗапросФото.Параметры.Вставить("МассивКлиентов", тзКонтрагенты.ВыгрузитьКолонку("Контрагент"));
		ЗапросФото.Параметры.Вставить("Изображение", Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение);
		ТаблФото = ЗапросФото.Выполнить().Выгрузить();
		ТаблФото.Индексы.Добавить("Контрагент");
	КонецЕсли;
	
	// Телефоны
	Текст =	"ВЫБРАТЬ Объект КАК Контрагент, Вид, Представление КАК Телефон ИЗ РегистрСведений.КонтактнаяИнформация
			|ГДЕ Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон) И Объект В (&МассивКонтрагентов)";
	Запрос = Новый Запрос(Текст);
	Запрос.Параметры.Вставить("МассивКонтрагентов", тзКонтрагенты.ВыгрузитьКолонку("Контрагент"));
	ТаблТелефонов = Запрос.Выполнить().Выгрузить();
	ТаблТелефонов.Индексы.Добавить("Контрагент");
	//
    Для Каждого стрТабл Из тзКонтрагенты Цикл
		Коммент = ""; 
		Цвет = стрТабл.Цвет;
		ДолгПросрочен = Ложь;
		Если стрТабл.ДолгПросрочен > 0 Тогда
			ДолгПросрочен = стрТабл.ДолгПросрочен > 0; //Ложь;
			Коммент=?(ПустаяСтрока(Коммент), "", Коммент + "; ") + "Превышен срок оплаты кредита";
			Цвет= 255*256*256; //Красный;
			ДолгПросрочен = Истина;
		КонецЕсли;
		
		Долг = Окр(стрТабл.Долг * КоэффПересчета, 2);
		Просрочено = Окр(стрТабл.ДолгПросрочен * КоэффПересчета, 2);
		Аванс = Окр(стрТабл.Аванс * КоэффПересчета, 2);
			
		//Коммент="Превышена сумма кредита по договору "+стрТабл.ОсновнойДоговорКонтрагента.Наименование;
		//Цвет= 255*256*256; //Красный;
		//ДолгПросрочен = Истина;

		//Если стрТабл.ДнейПросрочки > 0 Тогда
		//	Коммент=?(ПустаяСтрока(Коммент), "", Коммент + "; ") + "Превышен срок оплаты кредита";
		//	Цвет= 255*256*256; //Красный;
		//	ДолгПросрочен = Истина;
		//КонецЕсли;
		
		ТипЦен = стрТабл.ТипЦен;
		Если ТипЦен = Неопределено Тогда 
			ТипЦен = ПараметрыАгента.ТипЦенПоУмолчанию; 
		КонецЕсли;
		Если ТипЦен = NULL Тогда 
			ТипЦен = ПараметрыАгента.ТипЦенПоУмолчанию; 
		КонецЕсли;
		Если ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда 
			ТипЦен = ПараметрыАгента.ТипЦенПоУмолчанию; 
		КонецЕсли;
		
		ТипЦенКод = УникИдентификатор(ТипЦен);
		СтрПлат = "";
		
		Если ЗначениеЗаполнено(стрТабл.РасчетныйСчет) Тогда
			СтрПлат=СтрПлат
				+"р/с " + стрТабл.РасчетныйСчет_НомерСчета+","+Символ(160)
				+"в " +СокрП(стрТабл.РасчетныйСчет_Банк_Наименование)
					+" в "+СокрП(стрТабл.РасчетныйСчет_Банк_Город)+","+Символ(160)
				+ "БИК " + стрТабл.РасчетныйСчет_Банк_Код+","+Символ(160)
				+ "корр.сч. " + стрТабл.РасчетныйСчет_Банк_КоррСчет;
			Если ЗначениеЗаполнено(стрТабл.РасчетныйСчет_БанкДляРасчетов) Тогда
				СтрПлат=СтрПлат 
					+ Символ(160)
					+ "через " + СокрП(стрТабл.РасчетныйСчет_БанкДляРасчетов_Наименование) + " в " 
						+ СокрП(стрТабл.РасчетныйСчет_БанкДляРасчетов_Город)+","+Символ(160)
					+ "БИК " + стрТабл.РасчетныйСчет_БанкДляРасчетов_Код+","+Символ(160)
					+ "корр.сч. " + стрТабл.РасчетныйСчет_БанкДляРасчетов_КоррСчет;
			КонецЕсли;
		КонецЕсли;
		
		Метка = "0";                      //пока НЕ реализовано
		СкидкаДляКонтрагента = "";        //скидки
		АнкетаНаименование = "";
		//
		//ТекстДоговора = 
		//	"Общий долг: " + СуммаВСтроку(Долг) + " просрочено: " + СуммаВСтроку(Просрочено) +" аванс: " + СуммаВСтроку(Аванс) + " " + НазваниеВалюты 
		//	//+ ?(стрТабл.ДнейПросрочки > 0, " Превышен срок оплаты кредита", "");
		//	+ "";
		
				//
		ТекстДоговора = "Satışın əvvəlinə borc: " + СуммаВСтроку(Долг);

		
		//Если ДолгПросрочен=Истина Тогда
		//	ТекстДоговора = "<font color=""red"">" + ТекстДоговора + "</font>";
		//КонецЕсли;		
		
		СоздаватьТТпоАдресам = Ложь;
		Если ЕстьТТпоАдресам Тогда      //ведём ТТ по Адресам
			Отбор = Новый Структура();
			Отбор.Вставить("Контрагент", СтрТабл.Контрагент);
			НайденныеСтроки = тзАдресаДляТТ.НайтиСтроки(Отбор);
			СоздаватьТТпоАдресам = (НайденныеСтроки.Количество() > 1); //Несколько ТТ
		КонецЕсли; 
				
		Изображение = "";
		Если Конфигурация = "БухКазахстан" Тогда
			СтрокиФото = ТаблФото.НайтиСтроки(Новый Структура("Контрагент", стрТабл.Контрагент));
			Для Каждого СтрФото Из СтрокиФото Цикл
				ИмяФайла = "Контрагенты";
				УникИд=Строка(СтрФото.ХранилищеФото.УникальныйИдентификатор());
				Если ЕстьВерсияДанных Тогда 
					УникИд = УникИд + ЗаменитьНедопустимыеСимволыВВерсииДанных(СтрФото.ВерсияФото); 
				КонецЕсли;
				ИмяФайла=ИмяФайла+"-"+УникИд+"_"+Строка(стрТабл.Контрагент.УникальныйИдентификатор())+"_1";
				Картинка = СтрФото.ХранилищеФото.Хранилище.Получить();
				
				Если ТипЗнч(картинка) = Тип("Картинка") Тогда
					Попытка
						расширение = картинка.Формат();
					Исключение
						расширение = ФорматКартинки.НеизвестныйФормат;
					КонецПопытки;
					Если расширение = ФорматКартинки.НеизвестныйФормат Тогда 
					Иначе	
						ИмяФайла=ИмяФайла+"."+НРег(Строка(расширение));
						
						Если Изображение <> "" Тогда 
							Изображение=Изображение+Символ(31); 
						КонецЕсли;
						
						Изображение=Изображение+ИмяФайла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Широта =  "0";
		Долгота = "0";
		НаименованиеКонтрагента = стрТабл.Наименование;
		
		стрКоординаты = ТаблКоординаты.Найти(стрТабл.Контрагент,"Контрагент");
		Если стрКоординаты <> Неопределено Тогда
			Широта = КоординатаВСтроку(стрКоординаты.Широта);
			Долгота = КоординатаВСтроку(стрКоординаты.Долгота);
		КонецЕсли;
		
		Телефоны = "";
		СтрТелефоны = ТаблТелефонов.НайтиСтроки(Новый Структура("Контрагент", стрТабл.Контрагент));
		Первый = Истина;
		Для Каждого СтрТелефон Из СтрТелефоны Цикл
			Если Не ПустаяСтрока(СтрТелефон.Телефон) Тогда 
				Если Первый Тогда
					Первый = Ложь;
				Иначе
					Телефоны = Телефоны + ",";
				КонецЕсли;
			КонецЕсли;
			Телефоны = Телефоны + Строка(СтрТелефон.Вид) + ": " + СтрТелефон.Телефон;
		КонецЦикла;
		
		Если СоздаватьТТпоАдресам Тогда //нужны ТТ поАдресам
		//если много адресов - создаем группу "Контрагент" и добавляем ему адреса как подчиненные
			//добавить группу
			КодКонтрагента = стрТабл.Код;
		
			ЮрЛицоКод = СокрЛП(стрТабл.ЮрЛицоКод);
			Порядок = Порядок + 1;
			
			Ответ = Ответ + ДобавитьВыгрузкуКонтрагента(
				КодКонтрагента,
				НаименованиеКонтрагента,
				"",
				стрТабл,
				СтрПлат,
				Порядок,
				СтрТабл.ФактАдрес,
				СтрТабл.ЮрАдрес,
				Телефоны,
				ТекстДоговора,
				ТипЦенКод,
				Коммент,
				Цвет,
				Метка,
				СкидкаДляКонтрагента,
				АнкетаНаименование,
				Широта,
				Долгота,
				"1",
				стрТабл.Комментарий,
				Изображение);
			Для каждого строка Из НайденныеСтроки Цикл
					
				Если ПустаяСтрока(строка.Адрес) Тогда
					Продолжить;
				КонецЕсли;
				
				КодКонтрагента = УпаковатьКодКонтрагентаИКодАдреса(стрТабл.Код,строка.АдресКод); //код составим из кода контрагента и кода адреса
				НаименованиеКонтрагента = строка.Адрес;
				ЮрЛицоКод = СокрЛП(стрТабл.Код);
				Порядок = Порядок+1;
				Ответ = Ответ
					+ДобавитьВыгрузкуКонтрагента(
						КодКонтрагента,
						НаименованиеКонтрагента,
						ЮрЛицоКод,
						стрТабл,
						СтрПлат,
						Порядок,
						строка.Адрес,
						СтрТабл.ЮрАдрес,
						Телефоны,
						ТекстДоговора,
						ТипЦенКод,
						Коммент,
						Цвет,
						Метка,
						СкидкаДляКонтрагента,
						АнкетаНаименование,
						"",
						"",
						"0",
						стрТабл.Комментарий,
						Изображение);
			КонецЦикла;
		Иначе
			Если ЕстьТТпоАдресам И НайденныеСтроки.Количество() > 0 Тогда
			//если торговые точки ведутся по адресам, тогда необходимо:
			//есть только одна точка с адресом - создаем контрагента "Контрагент" с кодом контрагент+адрес 
			//и фактическим адресом - адрес доставки
				строка = НайденныеСтроки[0];
				
				КодКонтрагента= УпаковатьКодКонтрагентаИКодАдреса(стрТабл.Код,строка.АдресКод); //код составим из кода контрагента и кода адреса
				ЮрЛицоКод = СокрЛП(стрТабл.Код);
				Порядок = Порядок+1;
				Ответ=Ответ
					+ДобавитьВыгрузкуКонтрагента(
						КодКонтрагента,
						НаименованиеКонтрагента,
						ЮрЛицоКод,
						стрТабл,
						СтрПлат,
						Порядок,
						строка.Адрес,
						СтрТабл.ЮрАдрес,
						Телефоны,
						ТекстДоговора,
						ТипЦенКод,
						Коммент,
						Цвет,
						Метка,
						СкидкаДляКонтрагента,
						АнкетаНаименование,
						Широта,
						Долгота,
						"0",
						стрТабл.Комментарий,
						Изображение);
			Иначе //ТТ по адресам НЕ ведутся Добавим просто контрагента
				КодКонтрагента= СокрЛП(стрТабл.Код);
				ЮрЛицоКод = "";
				Если стрТабл.ЮрЛицо<>СтрТабл.Контрагент  И СпособОрганизацииТТ <> 1 Тогда
					ЮрЛицоКод=СокрЛП(стрТабл.ЮрЛицоКод);
				КонецЕсли;
				Порядок = Порядок+1;
				Ответ=Ответ
					+ДобавитьВыгрузкуКонтрагента(
						КодКонтрагента,
						НаименованиеКонтрагента,
						ЮрЛицоКод,
						стрТабл,
						СтрПлат,
						Порядок,
						СтрТабл.ФактАдрес,
						СтрТабл.ЮрАдрес,
						Телефоны,
						ТекстДоговора,
						ТипЦенКод,
						Коммент,
						Цвет,
						Метка,
						СкидкаДляКонтрагента,
						АнкетаНаименование,
						Широта,
						Долгота,
						?(стрТабл.ЭтоХолдинг,"1",0),
						стрТабл.Комментарий,
						Изображение);
			КонецЕсли; 		
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		Если (Счетчик%50=0)Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки контрагентов");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес, Ответ, "Контрагенты выгружены " + Счетчик + " записей","Ошибка выгрузки контрагентов");
КонецФункции

// Выгружает сегменты контрагентов ClientSegments и ClientSegmentAssign
// Параметры
// Адрес - идентификатор сессии обмена
// тзКонтрагенты - Таблица Контрагентов
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСегментыКонтрагентов(Адрес, тзКонтрагенты)
	Если НЕ ПорцияОбмена(Адрес,"ClientSegments","Выгружаются сегменты контрагентов...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВремТабл.Контрагент КАК Справочник.Контрагенты) КАК Контрагент
	|ПОМЕСТИТЬ ТаблКонтрагентов
	|ИЗ
	|	&Табл КАК ВремТабл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблКонтрагентов.Контрагент КАК Контрагент,
	|	ИСТИНА КАК ЭтоЭлемент,
	|	ТаблКонтрагентов.Контрагент.Код КАК КонтрагентКод,
	|	ТаблКонтрагентов.Контрагент.Родитель.Код КАК КонтрагентРодительКод,
	|	ТаблКонтрагентов.Контрагент.Наименование КАК КонтрагентНаименование
	|ИЗ
	|	ТаблКонтрагентов КАК ТаблКонтрагентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблКонтрагентов.Контрагент
	|ИТОГИ ПО
	|	Контрагент ТОЛЬКО ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Табл",тзКонтрагенты);
	Выборка=Запрос.Выполнить().Выбрать();
	Счетчик = 0; 
	Ответ="";
	кодРодителя = "";
	Пока Выборка.Следующий() Цикл
		Если Выборка.Контрагент.Пустая() Тогда Продолжить; КонецЕсли;
		Если Выборка.ЭтоЭлемент = Истина Тогда Продолжить; КонецЕсли;
		Попытка
			Если Выборка.Уровень()<> Выборка.Контрагент.Уровень() Тогда Продолжить; КонецЕсли;
		Исключение
			Продолжить; // Битая ссылка
		КонецПопытки;
		
		кодРодителя = Выборка.КонтрагентРодительКод;
		Если НЕ ЗначениеЗаполнено(кодРодителя) Тогда 
			кодРодителя = "";
		КонецЕсли;
		Счетчик=Счетчик + 1;
		
		Ответ=Ответ
	    	+ СокрЛП(Выборка.КонтрагентКод) + Таб
			+ ЦелоеВСтроку(Счетчик) + Таб
			+ УбратьСпецСимволы(СокрЛП(Выборка.КонтрагентНаименование)) + Таб
			+ СокрЛП(кодРодителя) + РазделительСтрок;
		
		Если (Счетчик%50=0)Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки сегментов контрагентов");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(
		Адрес,Ответ,"Сегменты контрагентов выгружено "+Счетчик+" записей","Ошибка выгрузки сегментов контрагентов");
КонецФункции

// Выгружает сегменты контрагентов ClientSegments и ClientSegmentAssign
// Параметры
// Адрес - идентификатор сессии обмена
// тзКонтрагенты - Таблица Контрагентов
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьНазначениеСегментовКонтрагентов(Адрес, тзКонтрагенты)
	Если НЕ ПорцияОбмена(Адрес, "ClientSegmentAssign", "Выгружаются назначения сегментов контрагентов...") Тогда
		Возврат Ложь;
	КонецЕсли;
	Счетчик = 0; Ответ = "";
	Если СпособОрганизацииТТ = 1 Тогда
		запросВидыАдресовТТ = новый Запрос("ВЫБРАТЬ Код ИЗ Справочник.ВидыКонтактнойИнформации ГДЕ Ссылка В(&ВидыАдресов)");
		запросВидыАдресовТТ.УстановитьПараметр("ВидыАдресов",АдресаДляТТ.ВыгрузитьКолонку("АдресДляТТ"));
		видыАдресаДляТТ = запросВидыАдресовТТ.Выполнить().Выгрузить();
		
		РодительКод = "";
		Для каждого стрКлиент из тзКонтрагенты Цикл
			РодительКод = СокрЛП(стрКлиент.РодительКод);
			Для каждого стрАдрес из видыАдресаДляТТ Цикл
				Ответ = Ответ + ДобавитьВыгрузкуНазначенияСегментаКонтрагента(УпаковатьКодКонтрагентаИКодАдреса(стрКлиент.Код, стрАдрес.Код), РодительКод);
				Счетчик = Счетчик + 1;
				Если (Счетчик % 50 = 0)Тогда
					Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
						ДобавитьОшибку("Ошибка выгрузки сегментов контрагентов");
						Возврат Ложь;
					КонецЕсли;
					Ответ = "";
				КонецЕсли;			
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого стрКлиент из тзКонтрагенты Цикл
		Ответ = Ответ + ДобавитьВыгрузкуНазначенияСегментаКонтрагента(СокрЛП(стрКлиент.Код), СокрЛП(стрКлиент.РодительКод));
		Счетчик = Счетчик + 1;
		Если (Счетчик % 50 = 0)Тогда
			Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
				ДобавитьОшибку("Ошибка выгрузки сегментов контрагентов");
				Возврат Ложь;
			КонецЕсли;
			Ответ = "";
		КонецЕсли;			
	КонецЦикла;	
	
	Возврат ПорцияОбмена(Адрес, Ответ,
		"Назначения сегментов контрагентов выгружено " + Счетчик + " записей",
		"Ошибка выгрузки назначения сегментов контрагентов");
КонецФункции

// Выгружает маршруты агента  
// 	Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьМаршруты(Адрес, Платформа, Выгружать, ИдетПолнаяЗагрузка, знач спКонтрагенты)
	Если спКонтрагенты = Неопределено Тогда
		МВТДолги = Неопределено;
		спКонтрагенты = ПолучитьТаблицуКонтрагентов(
			ПараметрыАгента.Агент,
			ПараметрыАгента.ЗапретитьИзменятьТипЦен,
			ПараметрыАгента.ВыделятьЦветомКонтрагентов, 
			Истина, МВТДолги).ВыгрузитьКолонку("Контрагент"); //получим список контрагентов		
	КонецЕсли;	
		
	ТекДата = НачалоДня(ТекущаяДата());
	
	Если ИдетПолнаяЗагрузка Тогда
		Если НЕ ПорцияОбмена(Адрес,"Route","Выгружаются маршруты...") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Ответ = "";
		Счетчик = 0;
		ТаблМарш = Новый ТаблицаЗначений;
		ТаблМарш.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		Если ПараметрыАгента.ВыгружатьМаршруты Тогда
			Если Выгружать Тогда
				дата = ТекДата;
				Для Д=1 По 7 Цикл //за каждый день
					Если ЗаданияВозможны Тогда
						ТаблМарш = ПолучитьПланПосещенийWM(ПараметрыАгента.Агент, дата, спКонтрагенты);
					КонецЕсли;
					дата = дата + 86400;
					ТаблМарш.Свернуть("Контрагент","");
					Порядок=0;
					Для Каждого Стр Из ТаблМарш Цикл
						Порядок=Порядок+1;
						Счетчик = Счетчик + 1;
						Ответ=Ответ
							+ СокрЛП(Стр.Контрагент.Код)+Таб 		//Код 
							+ Строка(ДеньНедели(дата))+Таб          //День недели: ПН ВТ ... ВС
							+ Порядок+РазделительСтрок;       		//Порядок
					КонецЦикла;
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
			
		Если НЕ ПорцияОбмена(Адрес,Ответ,"Маршруты выгружены "+Счетчик+" записей","Ошибка выгрузки маршрутов") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		Если НЕ ПорцияОбмена(Адрес,?(ИдетПолнаяЗагрузка, "Tasks", "OK"),"Выгружаются задания...") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Ответ = "";
		Счетчик = 0;
		ТаблМаршрута = Новый ТаблицаЗначений;
		ТаблМаршрута.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		Если ПараметрыАгента.ВыгружатьМаршруты Тогда
			ЕстьВерсияДанных=ЕстьВерсияДанных();
			Если Выгружать Тогда
				СписокРазрешенныхЗаданий = новый Массив();
				//наполнение списка разрешенных заданий
				Если Истина Тогда
					СписокРазрешенныхЗаданий.Добавить("Задание с фотоотчётом");
					СписокРазрешенныхЗаданий.Добавить("Задание");
					Если ПараметрыАгента.РазрешитьПродажу Тогда
						СписокРазрешенныхЗаданий.Добавить("Реализация");
					КонецЕсли;
					Если ПараметрыАгента.РазрешитьЗаявку Тогда
						СписокРазрешенныхЗаданий.Добавить("Заказ");
					КонецЕсли;
					Если ПараметрыАгента.РазрешитьПКО Тогда
						СписокРазрешенныхЗаданий.Добавить("ПКО");
					КонецЕсли;
					Если ПараметрыАгента.РазрешитьИнвентаризацию Тогда
						СписокРазрешенныхЗаданий.Добавить("Наличие и цены");
					КонецЕсли;
					Если ПараметрыАгента.РазрешитьПокупку Тогда
						СписокРазрешенныхЗаданий.Добавить("Покупка");
					КонецЕсли;				
				КонецЕсли;
				
				дата = ТекДата;
				
				Для Д = 1 По 7 Цикл //за каждый день 
					Если ЗаданияВозможны Тогда
						ТаблМаршрута = ПолучитьПланПосещений(ПараметрыАгента.Агент, дата, Истина, спКонтрагенты, СписокРазрешенныхЗаданий);
					КонецЕсли;
					Для Каждого Стр Из ТаблМаршрута Цикл
						Счетчик = Счетчик + 1;
						
						Описание=СтрЗаменить(Стр.Описание,Символы.ПС,Символы.ВТаб);
						Описание=СокрЛП(СтрЗаменить(Описание,Символы.Таб,""));
						
						КодЗадания=""; Экстра="";
						Если Стр.Задание="Заказ" Тогда						
							КодЗадания="14";
							Если СтрДлина(Описание)>0 Тогда
								Описание="Принять заказ: "+Описание;
							Иначе
								Описание="Принять заказ";
							КонецЕсли;
						ИначеЕсли Стр.Задание="Реализация" Тогда
							КодЗадания="12";
							Если СтрДлина(Описание)>0 Тогда
								Описание="Продажа: "+Описание;
							Иначе
								Описание="Продажа";
							КонецЕсли;
						ИначеЕсли Стр.Задание="ПКО" Тогда
							КодЗадания="18";
							Если СтрДлина(Описание)>0 Тогда
								Описание="Получить деньги: "+Описание;
							Иначе
								Описание="Получить деньги";
							КонецЕсли;
						ИначеЕсли Стр.Задание="Покупка" Тогда
							КодЗадания="16";
							Если СтрДлина(Описание)>0 Тогда
								Описание="Поступление товаров: "+Описание;
							Иначе
								Описание="Поступление товаров";
							КонецЕсли;
						ИначеЕсли Стр.Задание="Наличие и цены" Тогда
							КодЗадания="37";
							Если СтрДлина(Описание)>0 Тогда
								Описание="Наличие и цены: "+Описание;
							Иначе
								Описание="Наличие и цены";
							КонецЕсли;
						ИначеЕсли Стр.Задание="Задание с фотоотчётом" Тогда
							КодЗадания="35";
							Если СтрДлина(Описание)>0 Тогда
								Описание="Сфотографировать: "+Описание;
							Иначе
								Описание="Сфотографировать";
							КонецЕсли;
							Экстра="Photo";
						ИначеЕсли Стр.Задание="Задание" Тогда
							КодЗадания="35";
						КонецЕсли;
						Если КодЗадания="" Тогда Продолжить; КонецЕсли;

						ВремяЗадания=дата+Час(Стр.НачалоСобытия)*60*60+Минута(Стр.НачалоСобытия)*60+Секунда(Стр.НачалоСобытия);
						Цвет=0;
						Если Стр.Событие.ОкончаниеСобытия-Стр.Событие.НачалоСобытия>24*60*60 Тогда
							Если дата=НачалоДня(Стр.Событие.ОкончаниеСобытия) Тогда
								Цвет=255*256*256;
							КонецЕсли;
						КонецЕсли;
						
						Изображение = "";
						Для Каждого Картинка Из Стр.Событие.ТаблицаИзображений Цикл
							ФС = Новый Файл(Картинка.Путь);
							Если ФС.Существует() Тогда
								Если ФС.Расширение <> ФорматКартинки.НеизвестныйФормат Тогда 
									ИмяФайла = "Сотытие-" + Строка(Стр.Событие.УникальныйИдентификатор()) + "_" + Картинка.НомерСтроки + "_34" + ФС.Расширение;
									Если Изображение <> "" Тогда 
										Изображение = Изображение + Символ(31); 
									КонецЕсли;
									Изображение = Изображение + ИмяФайла;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						Ответ = Ответ
							+ УникИдентификатор(Стр.Событие)+Таб
							+ КодЗадания+Таб
							+ Экстра+Таб
							+ ДатаВремяВСтрокуДляКПК(ВремяЗадания)+Таб
							+ СокрЛП(Стр.Контрагент.Код)+Таб
							+ Описание+Таб
							+ ЦелоеВСтроку(Цвет)+Таб
							+ ДатаВСтрокуДляКПК(Стр.Событие.ОкончаниеСобытия)+Таб
							+ Изображение+РазделительСтрок;
					КонецЦикла;
					
					дата = дата + 24*60*60;
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		
		ПорцияОбмена(Адрес, Ответ, "Задания выгружены " + Счетчик + " записей", "Ошибка выгрузки заданий");
		Если НЕ ИдетПолнаяЗагрузка Тогда
			СерверПослатьОтвет(Адрес, "", 1); //передаем пустую строку
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Формирует строку с параметрами договора в соответствии с протоколом обмена
// Параметры:
// 		КодКонтрагента - Строка, уникальный код контрагента, на которого оформлен договор
// 		Выборка - Выборка результата запроса, содержит колонки:
// 			Код - Строка, код договора
//			Организация_Код - Строка, код организации из соотв. справочника, на которую оформлен договор
// 			Наименование - Строка, наименование договора
// 		ТекстДоговора - Строка, дополнительная информация о договоре для агента
// 		ТипЦенКод - Строка, код типа цены по договору
// 		СкидкаПоДоговору - Строка, код скидки, предоставляемой по договору
// Возвращаемое значение:
// 		Строка, строка параметров договора в соответствии с протоколом обмена
Функция ДобавитьВыгрузкуДоговора(КодКонтрагента, Выборка, ТекстДоговора, ТипЦенКод, СкидкаПоДоговору);
   СтрОтвета=""
        + УникИдентификатор(Выборка.Договор)+Таб
		+ КодКонтрагента+Таб
		+ СокрЛП(Выборка.Организация_Код)+Таб
		+ УбратьСпецСимволы(Выборка.Наименование)+Таб
		+ ТипЦенКод+Таб
		+ УбратьСпецСимволы(ТекстДоговора)+Таб
		+ СкидкаПоДоговору+РазделительСтрок;
   возврат СтрОтвета; 
 КонецФункции // ДобавитьВыгрузкуДоговора()
   
// Функция возвращает число рабочих дней между заданными датами по регламентированному производственному календарю
//
//Параметры:
// ДатаНач      - начальная дата
// ДатаКон      - конечная дата
//
Функция ЧислоРабочихДней(ДатаНач)
	
	ндТекДата = НачалоДня(ТекущаяДата());
	Если (ТаблРабочихДней=Неопределено) ИЛИ (ДатаРасчетаРабочихДней<>ндТекДата) Тогда
		ТекстЗапроса=
		"ВЫБРАТЬ
		|	Календарь.ДатаКалендаря,
		|	СУММА(1) - 1 КАК ЧислоДней
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК Календарь
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК Кал2
		|		ПО (Кал2.ДатаКалендаря МЕЖДУ Календарь.ДатаКалендаря И &ТекДата)
		|			И (Кал2.ВидДня = &РабочийДень ИЛИ Кал2.ВидДня = &ПредпраздничныйДень)
		| СГРУППИРОВАТЬ ПО Календарь.ДатаКалендаря";
		
		Запрос=Новый Запрос();
		Запрос.Текст=ТекстЗапроса;
		Запрос.УстановитьПараметр("ТекДата",             КонецДня(ндТекДата));
		Запрос.УстановитьПараметр("РабочийДень",         Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
		Запрос.УстановитьПараметр("ПредпраздничныйДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
		ТаблРабочихДней=Запрос.Выполнить().Выгрузить();
		ДатаРасчетаРабочихДней=ндТекДата;
		ТаблРабочихДней.Индексы.Добавить("ДатаКалендаря");
	КонецЕсли;
	
	Стр=ТаблРабочихДней.Найти(НачалоДня(ДатаНач),"ДатаКалендаря");
	Если Стр=Неопределено Тогда Возврат 0; КонецЕсли;
	Возврат Стр.ЧислоДней;
КонецФункции

// Выгружает договоры контрагентов Contracts
// Берем только договора с покупателем или поставщиком которые ведутся по договору в целом
// Параметры
// Адрес - идентификатор сессии обмена
// спКонтрагентов - список Контрагентов
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьДоговоры(Адрес, тзДоговоры, тзАдресаДляТТ, Платформа)
	Если НЕ ПорцияОбмена(Адрес, "Contracts", "Выгружаются договоры...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоэффПересчета = 1;
	Если ПараметрыАгента.ВалютаКПК <> мВалютаРегламентированногоУчета Тогда
		Структура = ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ТекущаяДата());
		СтруктураВалютаКПК = ПолучитьКурсВалюты(ПараметрыАгента.ВалютаКПК, ТекущаяДата());
		
		КоэффПересчета = Структура.Курс * СтруктураВалютаКПК.Кратность
			/ (?(СтруктураВалютаКПК.Курс = 0, 1, СтруктураВалютаКПК.Курс) * ?(Структура.Кратность = 0, 1, Структура.Кратность));
	КонецЕсли;
	
	ЕстьТТпоАдресам = (тзАдресаДляТТ <> Неопределено);  //точки НЕ нужны
	ТекДата = ТекущаяДата();
	НазваниеВалюты = мВалютаРегламентированногоУчета.Наименование; 
	Счетчик = 0; 
	Ответ = "";
	НаименованиеВалюты = "";
	СкидкаПоДоговору = "";        //скидки
	найденныеСтроки = Новый Массив();
	Для каждого стрТЗ Из тзДоговоры Цикл
		Долг = Окр(стрТЗ.Долг * КоэффПересчета, 2);
		ДолгПросрочен = Окр(стрТЗ.ДолгПросрочен * КоэффПересчета, 2);
		Аванс = Окр(стрТЗ.Аванс * КоэффПересчета, 2);
		
	  	ТипЦенКод = УникИдентификатор(стрТЗ.ТипЦен);
		//ВыбСкид = Справочники.ВидыСкидок.Выбрать();
		//Пока ВыбСкид.Следующий() Цикл
		//	
		//КонецЦикла;
		//СкидкаПоДоговору =  УникИдентификатор(стрТЗ.ТипЦен.ВидСкидки);
		
		СкидкаПоДоговору = КоличествоВСтроку(стрТЗ.ТипЦен.ВидСкидки.ПроцентСкидки);
		
		ТекстДоговора = "Долг: " + СуммаВСтроку(Долг) +  " просрочено: " + СуммаВСтроку(ДолгПросрочен) + " аванс: " + СуммаВСтроку(Аванс) + " " + НазваниеВалюты; 
		СоздаватьТТпоАдресам = Ложь;
		Если ЕстьТТпоАдресам Тогда      //ведём ТТ по Адресам
			Отбор = Новый Структура();
			Отбор.Вставить("Контрагент", стрТЗ.Контрагент);
			НайденныеСтроки = тзАдресаДляТТ.НайтиСтроки(Отбор);
			СоздаватьТТпоАдресам = (НайденныеСтроки.Количество() > 1); //Несколько ТТ
		КонецЕсли; 
		
		Если СоздаватьТТпоАдресам Тогда //нужны ТТ поАдресам
			//добавить группу
			КонтрагентКод = СокрЛП(стрТЗ.КонтрагентКод);
			Ответ = Ответ + ДобавитьВыгрузкуДоговора(КонтрагентКод, стрТЗ, ТекстДоговора, ТипЦенКод, СкидкаПоДоговору);
			Для каждого строка Из НайденныеСтроки Цикл
				КонтрагентКод = УпаковатьКодКонтрагентаИКодАдреса(стрТЗ.КонтрагентКод, строка.АдресКод); //код составим из кода контрагента и кода адреса
				Ответ = Ответ + ДобавитьВыгрузкуДоговора(КонтрагентКод, стрТЗ, ТекстДоговора, ТипЦенКод, СкидкаПоДоговору);
			КонецЦикла;
		Иначе
			Если ЕстьТТпоАдресам И НайденныеСтроки.Количество() > 0 Тогда
				строка = НайденныеСтроки[0];
				
				КодКонтрагента = УпаковатьКодКонтрагентаИКодАдреса(стрТЗ.КонтрагентКод, строка.АдресКод); //код составим из кода контрагента и кода адреса

				Ответ = Ответ + ДобавитьВыгрузкуДоговора(КодКонтрагента, стрТЗ, ТекстДоговора, ТипЦенКод, СкидкаПоДоговору);				
			Иначе //ТТ по адресам НЕ ведутся Добавим просто контрагента
				Ответ = Ответ + ДобавитьВыгрузкуДоговора(СокрЛП(стрТЗ.КонтрагентКод), стрТЗ, ТекстДоговора, ТипЦенКод, СкидкаПоДоговору);
			КонецЕсли			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		Если (Счетчик % 50 = 0) Тогда
			Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
				ДобавитьОшибку("Ошибка выгрузки договоров");
				Возврат Ложь;
			КонецЕсли;
			Ответ = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Договоры выгружены "+Счетчик+" записей","Ошибка выгрузки договоров");
КонецФункции

//Выгружает текущего агента
//Адрес - идентификатор сессии обмена
Функция ВыгрузитьАгентов(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"Agents","Выгружается агент...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ответ=СокрЛП(ПараметрыАгента.Агент.Физлицо.Код)+Таб
		+ УбратьСпецСимволы(ПараметрыАгента.Агент.Наименование)+РазделительСтрок;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Агент выгружен ","Ошибка выгрузки агентов");
КонецФункции

//Выгружает Организации, с которыми будет работать агент
// Параметры
// Адрес - идентификатор сессии обмена
// тзОрганизации - список организаций
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьОрганизации(Адрес, тзОрганизации)
	Если НЕ ПорцияОбмена(Адрес,"Firms","Выгружаются организации...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик = 0;
	Ответ = "";
	НомСтр = 1;
	текДата = ТекущаяДата();
	Для Каждого стрОрганизация Из тзОрганизации цикл
		
		СтрПлат = "";
		РасчетныйСчет = стрОрганизация.Организация.ОсновнойБанковскийСчет;
		Если НЕ РасчетныйСчет.Пустая() Тогда
			СтрПлат = СтрПлат
					+ "р/с " + РасчетныйСчет.НомерСчета + "," + Символ(160)
					+ "в "  + СокрП(РасчетныйСчет.Банк.Наименование) + " в " + СокрП(РасчетныйСчет.Банк.Город) + "," + Символ(160)
					+ "БИК " + РасчетныйСчет.Банк.Код + "," + Символ(160)
					+ "корр.сч. " + РасчетныйСчет.Банк.КоррСчет;
			Если ЗначениеЗаполнено(РасчетныйСчет.БанкДляРасчетов) Тогда
				СтрПлат = СтрПлат + Символ(160)
					+ "через " + СокрП(РасчетныйСчет.БанкДляРасчетов.Наименование)
						+ " в " + СокрП(РасчетныйСчет.БанкДляРасчетов.Город) + "," + Символ(160)
					+ "БИК " + РасчетныйСчет.БанкДляРасчетов.Код + "," + Символ(160)
					+ "корр.сч. " + РасчетныйСчет.БанкДляРасчетов.КоррСчет
			КонецЕсли;
		КонецЕсли;
		
		ЮрАдрес = "";
		Свидетельство = "";
		ИНН = "";
		КПП = "";
		КодПоОКПО = стрОрганизация.Организация.КодПоОКПО;
		Если Конфигурация = "БухКазахстан" Тогда
			ИНН = стрОрганизация.Организация.ИдентификационныйНомер;
			КПП = стрОрганизация.Организация.РНН;
			Свидетельство = "Серия " + стрОрганизация.Организация.СерияСвидетельстваПоНДС + " №" + стрОрганизация.Организация.НомерСвидетельстваПоНДС 
				+ " от " + Формат(стрОрганизация.Организация.ДатаСвидетельстваПоНДС, "ДФ=dd.MM.yyyy");
		Иначе
			ИНН = стрОрганизация.Организация.ИНН;
			КПП = стрОрганизация.Организация.КПП;
			Свидетельство = стрОрганизация.Организация.СвидетельствоСерияНомер
				+ " от " + Формат(стрОрганизация.Организация.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		Если стрОрганизация.Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ЮрАдрес = ПолучитьАдресИзКонтактнойИнформации(стрОрганизация.Организация.ИндивидуальныйПредприниматель, "Юридический");
		Иначе
			ЮрАдрес = ПолучитьАдресИзКонтактнойИнформации(стрОрганизация.Организация, "Юридический");
		КонецЕсли;

    	Руководители = РуководителиОрганизации(стрОрганизация.Организация, текДата);
		Руководитель = Руководители.Руководитель;
		Бухгалтер    = Руководители.ГлавныйБухгалтер;
		
		Если ЗначениеЗаполнено(стрОрганизация.Грузоотправитель) Тогда
			ГрузНаименованиеПолное = стрОрганизация.Грузоотправитель.НаименованиеПолное;
			ГрузСтрПлат = "";
			РасчетныйСчет = стрОрганизация.Грузоотправитель.ОсновнойБанковскийСчет;
			Если НЕ РасчетныйСчет.Пустая() Тогда
				ГрузСтрПлат = "р/с " + РасчетныйСчет.НомерСчета + "," + Символ(160)
					+ "в "  + СокрП(РасчетныйСчет.Банк.Наименование) + " в " + СокрП(РасчетныйСчет.Банк.Город) + "," + Символ(160)
					+ "БИК " + РасчетныйСчет.Банк.Код + "," + Символ(160)
					+ "корр.сч. " + РасчетныйСчет.Банк.КоррСчет;
				Если НЕ РасчетныйСчет.БанкДляРасчетов.Пустая() Тогда
					ГрузСтрПлат = ГрузСтрПлат + Символ(160)
						+ "через " + СокрП(РасчетныйСчет.БанкДляРасчетов.Наименование)
							+ " в " + СокрП(РасчетныйСчет.БанкДляРасчетов.Город) + "," + Символ(160)
						+ "БИК " + РасчетныйСчет.БанкДляРасчетов.Код + "," + Символ(160)
						+ "корр.сч. " + РасчетныйСчет.БанкДляРасчетов.КоррСчет
				КонецЕсли;
			КонецЕсли;
			ГрузЮрАдрес = ПолучитьАдресИзКонтактнойИнформации(стрОрганизация.Грузоотправитель, "Юридический");
			ГрузИНН = стрОрганизация.Грузоотправитель.ИНН;
			ГрузКПП = стрОрганизация.Грузоотправитель.КПП;
			ГрузКодПоОКПО = стрОрганизация.Грузоотправитель.КодПоОКПО;
		Иначе
			ГрузНаименованиеПолное=стрОрганизация.Организация.НаименованиеПолное;
			ГрузСтрПлат = СтрПлат;
			ГрузЮрАдрес = ЮрАдрес;
			ГрузИНН = ИНН;
			ГрузКПП = КПП;
			ГрузКодПоОКПО = КодПоОКПО;
		КонецЕсли;
		
		ОрганизацияПлательщикНДС = ОпределитьУчитыватьНДС(стрОрганизация.Организация, текДата);		
		Префикс = стрОрганизация.Организация.Префикс;
		
		Ответ=Ответ
			+СокрЛП(стрОрганизация.Организация.Код)+Таб
			+ УбратьСпецСимволы(стрОрганизация.Организация.Наименование)+Таб
			+ Строка(НомСтр)+Таб
			+ ?(ОрганизацияПлательщикНДС, "1", "0") + Таб 
			+ УбратьСпецСимволы(стрОрганизация.Организация.НаименованиеПолное)+Таб
			+ УбратьСпецСимволы(СтрПлат)+Таб
			+ УбратьСпецСимволы(ЮрАдрес)+Таб
			+ УбратьСпецСимволы(ИНН)+Таб
			+ УбратьСпецСимволы(КПП)+Таб
			+ УбратьСпецСимволы(Свидетельство)+Таб
			+ УбратьСпецСимволы(Руководитель)+Таб
			+ УбратьСпецСимволы(Руководитель)+Таб
			+ УбратьСпецСимволы(Бухгалтер)+Таб
			+ УбратьСпецСимволы(КодПоОКПО)+Таб
			+ УбратьСпецСимволы(ГрузНаименованиеПолное)+Таб
			+ УбратьСпецСимволы(ГрузСтрПлат)+Таб
			+ УбратьСпецСимволы(ГрузЮрАдрес)+Таб
			+ УбратьСпецСимволы(ГрузИНН)+Таб
			+ УбратьСпецСимволы(ГрузКПП)+Таб
			+ УбратьСпецСимволы(ГрузКодПоОКПО)+Таб
			+ УбратьСпецСимволы(Префикс)+РазделительСтрок;

		НомСтр=НомСтр+1;
		Счетчик=Счетчик+1;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Организации выгружены "+Счетчик+" записей","Ошибка выгрузки организаций");
КонецФункции

//Выгружает формы анкет, с которыми будет работать агент
// Параметры
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьФормы(Адрес)
	Если НЕ ПорцияОбмена(Адрес, "Forms", "Выгружаются формы анкет...") Тогда
		Возврат Ложь;
	КонецЕсли;
	Счетчик = 0;
	Ответ = "";
	Если ПараметрыАгента.СоздаватьЗадания Тогда
		Агенты = ПолучитьТаблицуАгентовСупервайзера(ПараметрыАгента.Агент);
		агентыСупервайзера = Агенты.ВыгрузитьКолонку("Агент");
		РабочееВремяАгентов = ПолучитьСписокВременНачалаЗаданияАгенту(агентыСупервайзера);
		ДоступныеЗадания = ПолучитьТаблицуЗаданийДоступныхАгенту(агентыСупервайзера);
		ГруппыЗаданий = Новый ТаблицаЗначений;
		ГруппыЗаданий.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));
		Для Каждого Стр Из ДоступныеЗадания Цикл
			НовСтр = ГруппыЗаданий.Добавить();	
			НовСтр.Группа = "" + стр.Задание + "_1";
			НовСтр = ГруппыЗаданий.Добавить();	
			НовСтр.Группа = "" + стр.Задание + "_2";
		КонецЦикла;
		
		текстАнкеты = 
			  "<?xml version=""1.0"" encoding=""utf-8""?>"
			+ "<Anketa>"
			+ "  <Page RowCount=""6"" ColCount=""2"">"
			+ "    <Row Height=""22"">"
			+ "      <Cell Text=""Исполнитель"" Width=""100"" />"
			+ "      <Cell Text=" + """";
			
	//если Агенты содержат тоько одно значение, то данное поле выгружать не нужно
			
		ЭтоПервоеЗначение = Истина;
		Для каждого стрАгент из Агенты Цикл
			текстАнкеты = текстАнкеты
				+ ?(ЭтоПервоеЗначение, "", "&#xD;&#xA;") + СтрЗаменить(стрАгент.Агент, "#", " ") + " #" + стрАгент.Код;
			ЭтоПервоеЗначение = Ложь;
		КонецЦикла;
			 
		текстАнкеты = текстАнкеты
			+ """ Id=""Исполнитель"" ControlType=""ComboBox"" MustBeFilled=""True"" Width=""100"" />" 
			+ "    </Row>" 
			+ "    <Row Height=""22"">"
			+ "      <Cell Text=""Срок исполнения"" />"
			+ "      <Cell Text=""0&#xD;&#xA;1&#xD;&#xA;2&#xD;&#xA;3&#xD;&#xA;4&#xD;&#xA;5&#xD;&#xA;6&#xD;&#xA;7&#xD;&#xA;8&#xD;&#xA;9&#xD;&#xA;10&#xD;&#xA;11&#xD;&#xA;12&#xD;&#xA;13&#xD;&#xA;14&#xD;&#xA;15&#xD;&#xA;16&#xD;&#xA;17&#xD;&#xA;18&#xD;&#xA;19&#xD;&#xA;20&#xD;&#xA;21&#xD;&#xA;22&#xD;&#xA;23&#xD;&#xA;24&#xD;&#xA;25&#xD;&#xA;26&#xD;&#xA;27&#xD;&#xA;28&#xD;&#xA;29&#xD;&#xA;30&#xD;&#xA;31"" Id=""СрокИсполнения"" ControlType=""ComboBox"" MustBeFilled=""True"" />"
			+ "    </Row>"
			+ "    <Row Height=""22"">"
			+ "      <Cell Text=""Время начала"" />"
			+ "      <Cell Text=""";
			
		ЭтоПервоеЗначение = Истина;
		Для Каждого стрВремя из РабочееВремяАгентов Цикл
			текстАнкеты = текстАнкеты
				+ ?(ЭтоПервоеЗначение, "", "&#xD;&#xA;") + стрВремя.Представление;
			ЭтоПервоеЗначение = Ложь;
		КонецЦикла;
		
		текстАнкеты = текстАнкеты			
			+ """ Id=""ВремяНачала"" ControlType=""ComboBox"" MustBeFilled=""True"" />"
			+ "    </Row>"
			+ "    <Row Height=""22"">"
			+ "      <Cell Text=""Тип задания"" />"
			+ "      <Cell Text=""";
			
		ЭтоПервоеЗначение = Истина;
		Для Каждого стрЗадание из ДоступныеЗадания Цикл
			текстАнкеты = текстАнкеты
				+ ?(ЭтоПервоеЗначение, "", "&#xD;&#xA;") + стрЗадание.Задание;
			ЭтоПервоеЗначение = Ложь;
		КонецЦикла;
			
		текстАнкеты = текстАнкеты			
			+ """ Id=""ТипЗадания"" ControlType=""ComboBox"" MustBeFilled=""True"" />"
			+ "    </Row>"
			+ "    <Row Height=""22"">"
			+ "      <Cell Text=""Группа задания"" />"
			+ "      <Cell Text=""";
			
		ЭтоПервоеЗначение = Истина;
		Для Каждого стрГруппа из ГруппыЗаданий Цикл
			текстАнкеты = текстАнкеты
				+ ?(ЭтоПервоеЗначение, "", "&#xD;&#xA;") + СтрЗаменить(стрГруппа.Группа, "#", " ") + " #" + стрГруппа.Группа;
			ЭтоПервоеЗначение = Ложь;
		КонецЦикла;
			
		текстАнкеты = текстАнкеты			
			+ """ Id=""ГруппаЗадания"" ControlType=""ComboBox"" MustBeFilled=""True"" />"
			+ "    </Row>"
			+ "    <Row Height=""22"">"
			+ "      <Cell Text=""Описание"" />"
			+ "      <Cell Text="""" Id=""Описание"" ControlType=""TextBox"" MustBeFilled=""True"" />"
			+ "    </Row>"
			+ "  </Page>"
			+ "</Anketa>";
		
		Ответ = Ответ
			+ УбратьСпецСимволы("Типовое задание 1С") + Таб  //Имя анкеты
			+ УбратьСпецСимволы(текстАнкеты) + РазделительСтрок;     //содержимое анкеты
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
	Возврат ПорцияОбмена(Адрес, Ответ, "Формы анкет выгружены" + Счетчик + "запись", "Ошибка выгрузки Форм анкет");
КонецФункции

// Формирует строку с параметрами значения свойства контрагента в соответствии с протоколом обмена
// Параметры:
// 		КонтрагентКод - Строка, уникальный код контрагента
// 		Выборка - выборка результата запроса, содержит поля:
// 			Свойство - ссылка на элемент Плана видов характеристик СвойстваОбъектов
// 			Значение - значение свойства
// Возвращаемое значение:
// 		Строка, строка с параметрами свойства в соответствии с протоколом обмена
Функция ДобавитьВыгрузкуСвойства(КонтрагентКод, Выборка)

	стр = СтрЗаменить(Выборка.Свойство," ","_")+Таб 
	      + "1"+Таб
	      + КонтрагентКод+Таб
	      + Строка(Выборка.Значение)+РазделительСтрок;
    возврат стр;
КонецФункции // 

// Выгружает подсказки продаж
// Параметры
// Адрес - идентификатор сессии обмена
// спКонтрагентов - список Контрагентов
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьПодсказкиПродаж(Адрес, Знач тзАдресовДоставки, Номенклатура)
	
	КолвоМесяцевНазадДляИстории	= 2;
	КолвоМесяцевНазадДляПлана	= 2;
	
	тзИстория = Новый ТаблицаЗначений;                            
	тзИстория.колонки.Добавить("ИдКонтр", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(32, ДопустимаяДлина.Переменная)));
	тзИстория.колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тзИстория.колонки.Добавить("План", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
	тзИстория.колонки.Добавить("ИсторияПродаж", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1000, ДопустимаяДлина.Переменная)));
	тзИстория.колонки.Добавить("КоличествоПосещений", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Любой)));
	тзИстория.колонки.Добавить("ПроданоЗаТриПоследнихПосещения", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 1, ДопустимыйЗнак.Любой)));
	тзИстория.колонки.Добавить("МинимДатаПродажи", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
	тзПлан = Новый ТаблицаЗначений;
	тзПлан.колонки.Добавить("ИдКонтр", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(32, ДопустимаяДлина.Переменная)));
	тзПлан.колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тзПлан.колонки.Добавить("План", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
	тзПлан.колонки.Добавить("ИсторияПродаж", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1000, ДопустимаяДлина.Переменная)));
	
	тзПодсказки = Новый ТаблицаЗначений;
	
	//найдем историю продаж за 2 последних месяца  ввиде строки "25/35/48 шт"   берем только 3 последних посещения
	МаксКолвоПосещенийПродажа = 3;
	МаксКолвоПосещенийВозврат = 3;	
	МаксКолвоПродажаВозврат = 4;	
	КонПериода = КонецДня(РабочаяДата);
	НачПериода = НачалоДня(ДобавитьМесяц(КонПериода, -КолвоМесяцевНазадДляИстории));   //???2 месяца назад
	
	//Начало для всех запросов истории и планов
	ТекстКлиентыИТовары = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ТАБЛ.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	|	" + ?(СпособОрганизацииТТ = 0, """""", "ВЫРАЗИТЬ(ТАБЛ.АдресДоставки КАК СТРОКА(200))") + " КАК АдресДоставки, 
	|	ВЫРАЗИТЬ(ТАБЛ.ИдКонтр КАК СТРОКА(32)) КАК ИдКонтр
	|ПОМЕСТИТЬ ВремАдреса
	|ИЗ
	|	&Табл КАК ТАБЛ
	|ГДЕ
	|	ТАБЛ.Контрагент ССЫЛКА Справочник.Контрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ТаблТов
	|ИЗ
	|	&ТаблНоменклатуры КАК ТАБЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстКлиентыИТовары + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Документ.Ссылка.Контрагент КАК Контрагент,
	|	" + ?(СпособОрганизацииТТ = 0, """""", "ВЫРАЗИТЬ(Документ.Ссылка.АдресДоставки КАК СТРОКА(200))") + " КАК АдресДоставки,
	|	Документ.Номенклатура КАК Номенклатура,
	|	Документ.Ссылка.Дата КАК ДатаПосещения,
	|	ВЫБОР КОГДА Документ.Коэффициент = 0 ТОГДА Документ.Количество ИНАЧЕ Документ.Количество / ЕСТЬNULL(Документ.Коэффициент, 1) КОНЕЦ КАК Количество,
	|	0 КАК КоличествоВозврат
	|ПОМЕСТИТЬ ВремПродажи
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
	|		ПО Документ.Ссылка.Контрагент = ВремАдреса.Контрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
	|		ПО (ТаблТов.Номенклатура = Документ.Номенклатура)
	|ГДЕ
	|	Документ.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И Документ.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.Ссылка.Контрагент,
	|	"""",
	|	Документ.Номенклатура,
	|	Документ.Ссылка.Дата,
	|	0,
	|	-Документ.Количество
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
	|		ПО Документ.Ссылка.Контрагент = ВремАдреса.Контрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
	|		ПО (ТаблТов.Номенклатура = Документ.Номенклатура)
	|ГДЕ
	|	Документ.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И Документ.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремАдреса.ИдКонтр КАК ИдКонтр,
	|	ВремАдреса.АдресДоставки КАК АдресДоставки,
	|	НАЧАЛОПЕРИОДА(ВремПродажи.ДатаПосещения, ДЕНЬ) КАК ДатаПосещения,
	|	ВремПродажи.Номенклатура КАК Номенклатура,
	|	ВремПродажи.Номенклатура.БазоваяЕдиницаИзмерения КАК НоменклатураЕдиницаИстории,
	|	ВремПродажи.Количество,
	|	ВремПродажи.КоличествоВозврат
	|ИЗ
	|	ВремПродажи КАК ВремПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
	|		ПО ВремПродажи.Контрагент = ВремАдреса.Контрагент
	|" + ?(СпособОрганизацииТТ = 0, "", " И ВремПродажи.АдресДоставки = ВремАдреса.АдресДоставки") + "
	|УПОРЯДОЧИТЬ ПО ДатаПосещения УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(НоменклатураЕдиницаИстории),
	|	СУММА(Количество),
	|	СУММА(КоличествоВозврат)
	|ПО
	|	ИдКонтр,
	|	АдресДоставки,
	|	Номенклатура,
	|	ДатаПосещения";
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	Запрос.УстановитьПараметр("Табл",     	тзАдресовДоставки);
	Запрос.УстановитьПараметр("ТаблНоменклатуры", Номенклатура);
	Запрос.УстановитьПараметр("НЕСоздаватьТТпоАдресам", (СпособОрганизацииТТ=0));
	
	Результат = Запрос.Выполнить();
	ВыборкаКонтрагентов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекДата = НачалоДня(РабочаяДата);
	ЦветПродажа = """#00B000""";
	ЦветВозврат = """#FF0000""";
	ЦветТекст   = """#888888""";
	ЦветОстаток = """#4169E1""";
	
	тзОстатки = Неопределено;
	
	//18.12.13 изменен формат вывода истории продаж
	//ранее история продаж выводилась с сортировкой дат по возрастанию
	//теперь сортировка дат по убыванию
	
	Если ПараметрыАгента.ФорматОтображенияИсторииПродажНаКПК = 0 Тогда
		//старая схема
		Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
			ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
				ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					КолвоПосещенийПродажа = 0;
					КолвоПосещенийВозврат = 0;					
					ИсторияПродаж = "";
					ИсторияВозвратов = "";
					ПроданоЗаТриПоследнихПосещения = 0;
					МинимДатаПродажи = Дата(2999, 1,1);// самое далекое будущее, чтобы при первом сравнении дата встала на нужную
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока Выборка.Следующий() Цикл
						//Продажа
						Если Выборка.Количество > 0 Тогда
							Если КолвоПосещенийПродажа < МаксКолвоПосещенийПродажа Тогда
								КолвоПосещенийПродажа = КолвоПосещенийПродажа + 1;
								//ИсторияПродаж = Формат(Выборка.ДатаПосещения, "ДФ=дд.ММ") + "=" + Выборка.Количество + " " + ИсторияПродаж;
								ИсторияПродаж = ИсторияПродаж + "  " + Формат(Выборка.ДатаПосещения, "ДФ=дд.ММ") + "=" + Выборка.Количество;
								ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения + Выборка.Количество;
								МинимДатаПродажи = мин(МинимДатаПродажи,Выборка.ДатаПосещения);
							КонецЕсли;
						КонецЕсли;
						
						//Возврат
						Если Выборка.КоличествоВозврат < 0 Тогда
							Если КолвоПосещенийВозврат < МаксКолвоПосещенийВозврат Тогда
								КолвоПосещенийВозврат = КолвоПосещенийВозврат + 1;
								ИсторияВозвратов = ИсторияВозвратов 
								+ "  " + Формат(Выборка.ДатаПосещения, "ДФ=дд.ММ") + "=" + (-Выборка.КоличествоВозврат);   //цвет Gold
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					ИсторияПродаж = СтрЗаменить(СокрЛП(ИсторияПродаж), "  ", "&nbsp;&nbsp;");
					ИсторияВозвратов = СтрЗаменить(СокрЛП(ИсторияВозвратов), "  ", "&nbsp;&nbsp;");
					Если Не ПустаяСтрока(ИсторияПродаж + ИсторияВозвратов) Тогда //есть продажи или возвраты
						ИсторияПродаж = 
						?(ПустаяСтрока(ИсторияПродаж), 
						"", 
						"<font color=" + ЦветТекст + ">Прод&nbsp;</font><font color=" + ЦветПродажа + ">" 
						+ ИсторияПродаж + "&nbsp;" + Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории) 
						+ "</font>")
						+ ?(ПустаяСтрока(ИсторияПродаж) ИЛИ ПустаяСтрока(ИсторияВозвратов), 
						"", 
						"<br/>")
						+ ?(ПустаяСтрока(ИсторияВозвратов), 
						"", 
						"<font color=" + ЦветТекст + ">Возвр&nbsp;</font><font color=" + ЦветВозврат + ">" 
						+ ИсторияВозвратов + "&nbsp;" + Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории) 
						+ "</font>");
						
						стрТЗ= тзИстория.Добавить();
						стрТЗ.ИдКонтр       = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
						стрТЗ.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
						стрТЗ.План          = "";
						стрТЗ.ИсторияПродаж = ИсторияПродаж;
						стрТЗ.ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения;
						стрТЗ.КоличествоПосещений            = Мин(КолвоПосещенийПродажа,МаксКолвоПосещенийПродажа);
						стрТЗ.МинимДатаПродажи               = МинимДатаПродажи;
					КонецЕсли;  //есть история
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла;
		
	ИначеЕсли ПараметрыАгента.ФорматОтображенияИсторииПродажНаКПК = 1 Тогда
		//продажи по датам
		Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
			ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
				ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					КолвоПосещенийПродажа = 0;
					КолвоПосещенийВозврат = 0;					
					ИсторияПродаж = "";
					ПроданоЗаТриПоследнихПосещения = 0;
					МинимДатаПродажи = Дата(2999, 1, 1);// самое далекое будущее, чтобы при первом сравнении дата встала на нужную
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					массивПродажаВозврат = новый Массив();
					//в массиве хранятся структуры вида
					//Дата - число, Количество - число
					
					колвоПродажаВозврат = 0;
					ЭтоВозврат = Ложь;
					дней = 0;
					Пока Выборка.Следующий() И колвоПродажаВозврат < МаксКолвоПродажаВозврат Цикл
						//Продажа
						Если Выборка.Количество > 0 
							И КолвоПосещенийПродажа < МаксКолвоПосещенийПродажа Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийПродажа = КолвоПосещенийПродажа + 1;
							массивПродажаВозврат.Добавить(Новый Структура("Дата, Количество", 
							Выборка.ДатаПосещения, Выборка.Количество));
							МинимДатаПродажи = мин(МинимДатаПродажи, Выборка.ДатаПосещения);
							ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения + Выборка.Количество;
						КонецЕсли;
						//Возврат
						Если Выборка.КоличествоВозврат < 0 
							И КолвоПосещенийВозврат < МаксКолвоПосещенийВозврат 
							И колвоПродажаВозврат < МаксКолвоПродажаВозврат Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийВозврат = КолвоПосещенийВозврат + 1;
							массивПродажаВозврат.Добавить(Новый Структура("Дата, Количество", 
							Выборка.ДатаПосещения, Выборка.КоличествоВозврат));
						КонецЕсли;
					КонецЦикла;
					
					строкаДни = "";
					строкаДействия = "";
					оформлениеПродажа = "";
					
					Для каждого стр из массивПродажаВозврат Цикл
						оформлениеПродажа = "<font color=" + ?(стр.Количество > 0, ЦветПродажа, ЦветВозврат) + ">";
						строкаДни = строкаДни + оформлениеПродажа + Формат(стр.Дата, "ДФ=дд.ММ") + "</font>";
						строкаДействия = строкаДействия 
						+ оформлениеПродажа 
						+ СтрЗаменить(Лев("" + ?(стр.Количество > 0, стр.Количество, -стр.Количество) + "      ", 5), " ", "&nbsp;") 
						+ "</font>";
					КонецЦикла;
					
					Если массивПродажаВозврат.Количество() > 0 Тогда //есть история
						дата  = СтрЗаменить(Лев("дата    ", 6), " ", "&nbsp;");
						едИзм = 
						СтрЗаменить(Лев(Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории) + "        ", 6), " ", "&nbsp;");
						
						ИсторияПродаж = 
						"<tt>"
						+ "<font color=" + ЦветТекст + ">" + дата  + "&nbsp;</font>" + строкаДни + "<br/>"
						+ "<font color=" + ЦветТекст + ">" + едИзм + "&nbsp;</font>" + строкаДействия 
						+ "</tt>";
						
						стрТЗ = тзИстория.Добавить();
						стрТЗ.ИдКонтр       = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
						стрТЗ.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
						стрТЗ.План          = "";
						стрТЗ.ИсторияПродаж = ИсторияПродаж;
						стрТЗ.ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения;
						стрТЗ.КоличествоПосещений            = Мин(КолвоПосещенийПродажа,МаксКолвоПосещенийПродажа);
						стрТЗ.МинимДатаПродажи               = МинимДатаПродажи;
					КонецЕсли;  //есть история
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла; 
		
	ИначеЕсли ПараметрыАгента.ФорматОтображенияИсторииПродажНаКПК = 2 Тогда
		//продажи по дням
		Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
			ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
				ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					КолвоПосещенийПродажа = 0;
					КолвоПосещенийВозврат = 0;					
					ИсторияПродаж = "";
					ПроданоЗаТриПоследнихПосещения=0;
					МинимДатаПродажи=Дата(2999,1,1);// самое далекое будущее, чтобы при первом сравнении дата встала на нужную
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					массивПродажаВозврат = новый Массив();
					//в массиве хранятся структуры вида
					//ДнейНазад - число, Количество - число
					
					колвоПродажаВозврат = 0;
					ЭтоВозврат = Ложь;
					дней = 0;
					Пока Выборка.Следующий() И колвоПродажаВозврат < МаксКолвоПродажаВозврат Цикл
						//Продажа
						Если Выборка.Количество > 0 
							И КолвоПосещенийПродажа < МаксКолвоПосещенийПродажа Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийПродажа = КолвоПосещенийПродажа + 1;
							массивПродажаВозврат.Добавить(новый Структура("ДнейНазад, Количество",
							(ТекДата - Выборка.ДатаПосещения) / 86400, Выборка.Количество));
							МинимДатаПродажи = мин(МинимДатаПродажи, Выборка.ДатаПосещения);
							ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения + Выборка.Количество;
						КонецЕсли;
						//Возврат
						Если Выборка.КоличествоВозврат < 0 
							И КолвоПосещенийВозврат < МаксКолвоПосещенийВозврат 
							И колвоПродажаВозврат < МаксКолвоПродажаВозврат Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийВозврат = КолвоПосещенийВозврат + 1;
							массивПродажаВозврат.Добавить(новый Структура("ДнейНазад, Количество",
							(ТекДата - Выборка.ДатаПосещения) / 86400, Выборка.КоличествоВозврат));
						КонецЕсли;
					КонецЦикла;
					
					строкаДни = "";
					строкаДействия = "";
					оформлениеПродажа = "";
					дней = "";
					количество = "";
					
					Для каждого стр из массивПродажаВозврат Цикл
						оформлениеПродажа = "<font color=" + ?(стр.Количество > 0, ЦветПродажа, ЦветВозврат) + ">";
						строкаДни = строкаДни 
						+ оформлениеПродажа 
						+ СтрЗаменить(Лев(ЦелоеВСтроку(стр.ДнейНазад) + "      ", 5), " ", "&nbsp;") 
						+ "</font>";
						строкаДействия = строкаДействия 
						+ оформлениеПродажа 
						+ СтрЗаменить(Лев("" + ?(стр.Количество > 0, стр.Количество, -стр.Количество) + "      ", 5), " ", "&nbsp;")
						+ "</font>";
					КонецЦикла;
					
					Если массивПродажаВозврат.Количество() > 0 Тогда //есть история
						Дней  = СтрЗаменить(Лев("дней    ", 6), " ", "&nbsp;");
						едИзм = СтрЗаменить(Лев(Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории) + "        ", 6), " ", "&nbsp;");
						
						ИсторияПродаж = 
						"<tt>"
						+ "<font color=" + ЦветТекст + ">" + Дней  + "&nbsp;</font>" + строкаДни + "<br/>"
						+ "<font color=" + ЦветТекст + ">" + едИзм + "&nbsp;</font>" + строкаДействия + "</tt>";
						
						стрТЗ= тзИстория.Добавить();
						стрТЗ.ИдКонтр       = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
						стрТЗ.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
						стрТЗ.План          = "";
						стрТЗ.ИсторияПродаж = ИсторияПродаж;
						стрТЗ.ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения;
						стрТЗ.КоличествоПосещений            = Мин(КолвоПосещенийПродажа,МаксКолвоПосещенийПродажа);
						стрТЗ.МинимДатаПродажи               = МинимДатаПродажи;
					КонецЕсли;  //есть история
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла; 
		
	ИначеЕсли ПараметрыАгента.ФорматОтображенияИсторииПродажНаКПК = 3 Тогда
		//продажи по датам в строку
		Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
			ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
				ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					КолвоПосещенийПродажа = 0;
					КолвоПосещенийВозврат = 0;					
					ИсторияПродаж = "";
					ПроданоЗаТриПоследнихПосещения=0;
					МинимДатаПродажи=Дата(2999,1,1);// самое далекое будущее, чтобы при первом сравнении дата встала на нужную
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					массивПродажаВозврат = новый Массив();
					//в массиве хранятся структуры вида
					//Дата - число, Количество - число
					
					колвоПродажаВозврат = 0;
					ЭтоВозврат = Ложь;
					Пока Выборка.Следующий() И колвоПродажаВозврат < МаксКолвоПродажаВозврат Цикл
						//Продажа
						Если Выборка.Количество > 0 
								И КолвоПосещенийПродажа < МаксКолвоПосещенийПродажа Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийПродажа = КолвоПосещенийПродажа + 1;
							массивПродажаВозврат.Добавить(Новый Структура("Дата, Количество", 
								Выборка.ДатаПосещения, Выборка.Количество));
							МинимДатаПродажи = мин(МинимДатаПродажи, Выборка.ДатаПосещения);
							ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения + Выборка.Количество;
						КонецЕсли;
						//Возврат
						Если Выборка.КоличествоВозврат < 0 
								И КолвоПосещенийВозврат < МаксКолвоПосещенийВозврат 
								И колвоПродажаВозврат < МаксКолвоПродажаВозврат Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийВозврат = КолвоПосещенийВозврат + 1;
							массивПродажаВозврат.Добавить(Новый Структура("Дата, Количество", 
								Выборка.ДатаПосещения, Выборка.КоличествоВозврат));
						КонецЕсли;
					КонецЦикла;
						
					оформлениеПродажа = "";
					
					Для каждого стр из массивПродажаВозврат Цикл
						оформлениеПродажа = "<font color=" + ?(стр.Количество > 0, ЦветПродажа, ЦветВозврат) + ">";
						ИсторияПродаж = ИсторияПродаж 
							+ оформлениеПродажа 
							+ Формат(стр.Дата, "ДФ=дд.ММ") 
							+ "&nbsp/&nbsp" + СтрЗаменить(СокрЛП(Лев("" + ?(стр.Количество > 0, стр.Количество, -стр.Количество) + "      ", 5)), " ", "&nbsp") 
							+ "</font><font color=" + ЦветТекст + ">;&nbsp;</font>";
					КонецЦикла;
					
					Если массивПродажаВозврат.Количество() > 0 Тогда //есть история
						ИсторияПродаж = 
							"<font color=" + ЦветТекст + ">" 
							+ "дата&nbsp/&nbsp" + СокрЛП(Лев(Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории), 6)) 
							+ ":&nbsp;</font>" + ИсторияПродаж;
						
						стрТЗ= тзИстория.Добавить();
						стрТЗ.ИдКонтр       = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
						стрТЗ.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
						стрТЗ.План          = "";
						стрТЗ.ИсторияПродаж = ИсторияПродаж;
						стрТЗ.ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения;
						стрТЗ.КоличествоПосещений            = Мин(КолвоПосещенийПродажа,МаксКолвоПосещенийПродажа);
						стрТЗ.МинимДатаПродажи               = МинимДатаПродажи;
					КонецЕсли;  //есть история
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла; 
		
	ИначеЕсли ПараметрыАгента.ФорматОтображенияИсторииПродажНаКПК = 4 Тогда
		//продажи по дням в строку
		Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
			ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
				ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					КолвоПосещенийПродажа = 0;
					КолвоПосещенийВозврат = 0;					
					ИсторияПродаж = "";
					ПроданоЗаТриПоследнихПосещения=0;
					МинимДатаПродажи=Дата(2999,1,1);// самое далекое будущее, чтобы при первом сравнении дата встала на нужную
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					массивПродажаВозврат = новый Массив();
					//в массиве хранятся структуры вида
					//ДнейНазад - число, Количество - число
					
					колвоПродажаВозврат = 0;
					ЭтоВозврат = Ложь;
					дней = 0;
					Пока Выборка.Следующий() И колвоПродажаВозврат < МаксКолвоПродажаВозврат Цикл
						//Продажа
						Если Выборка.Количество > 0 
								И КолвоПосещенийПродажа < МаксКолвоПосещенийПродажа Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийПродажа = КолвоПосещенийПродажа + 1;
							массивПродажаВозврат.Добавить(новый Структура("ДнейНазад, Количество",
								(ТекДата - Выборка.ДатаПосещения) / 86400, Выборка.Количество));
							МинимДатаПродажи = мин(МинимДатаПродажи, Выборка.ДатаПосещения);
							ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения + Выборка.Количество;
						КонецЕсли;
						//Возврат
						Если Выборка.КоличествоВозврат < 0 
								И КолвоПосещенийВозврат < МаксКолвоПосещенийВозврат 
								И колвоПродажаВозврат < МаксКолвоПродажаВозврат Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийВозврат = КолвоПосещенийВозврат + 1;
							массивПродажаВозврат.Добавить(новый Структура("ДнейНазад, Количество",
								(ТекДата - Выборка.ДатаПосещения) / 86400, Выборка.КоличествоВозврат));
						КонецЕсли;
					КонецЦикла;
					
					оформлениеПродажа = "";
					Для каждого стр из массивПродажаВозврат Цикл
						оформлениеПродажа = "<font color=" + ?(стр.Количество > 0, ЦветПродажа, ЦветВозврат) + ">";
						ИсторияПродаж = ИсторияПродаж 
							+ оформлениеПродажа 
							+ ЦелоеВСтроку(стр.ДнейНазад) + " / " + СокрЛП("" + ?(стр.Количество > 0, стр.Количество, -стр.Количество)) 
							+ "</font><font color=" + ЦветТекст + ">;&nbsp;</font>";
					КонецЦикла;
					
					Если массивПродажаВозврат.Количество() > 0 Тогда //есть история
						ИсторияПродаж = 
							"<font color=" + ЦветТекст + ">" 
							+ "дней:&nbsp;/:&nbsp;" + СтрЗаменить(СокрЛП(Лев(Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории) + "      ", 6)), "", "&nbsp;")
							+ ":&nbsp;</font>" + ИсторияПродаж;
						
						стрТЗ= тзИстория.Добавить();
						стрТЗ.ИдКонтр       = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
						стрТЗ.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
						стрТЗ.План          = "";
						стрТЗ.ИсторияПродаж = ИсторияПродаж;
						стрТЗ.ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения;
						стрТЗ.КоличествоПосещений            = Мин(КолвоПосещенийПродажа,МаксКолвоПосещенийПродажа);
						стрТЗ.МинимДатаПродажи               = МинимДатаПродажи;
					КонецЕсли;  //есть история
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла; 
		
	ИначеЕсли ПараметрыАгента.ФорматОтображенияИсторииПродажНаКПК = 5 Тогда
		
		тзОстатки = новый ТаблицаЗначений();
		тзОстатки.колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		тзОстатки.колонки.Добавить("ИдКонтр", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
		тзОстатки.колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзОстатки.колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
		тзОстатки.колонки.Добавить("ДатаОстатка", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		тзОстатки.колонки.Добавить("Остаток", Новый ОписаниеТипов("Число"));
		
		Блокировщик = Неопределено;	
		БД = ОткрытьВнешнююБД(Блокировщик, Ложь);
		Если БД = Ложь Тогда
			Сообщить("Не удалось получить данные файла mobi_s.mdb, проверьте лог ошибок!", СтатусСообщения.Важное);
		Иначе					
			ТекстЗапроса="
			|SELECT OSTATKI.NOMENKLATURA, MIN(OSTATKI.OSTATOK) AS Ostatok, MAX(OSTATKI_POSL.MAXDATA) AS MAXDATA
			|FROM OSTATKI
			|    INNER JOIN (
			|        SELECT NOMENKLATURA, MAX(DATA) AS MAXDATA
			|        FROM OSTATKI
			|        WHERE KONTRAGENT=?
			|        GROUP BY NOMENKLATURA
			|    ) AS OSTATKI_POSL ON OSTATKI.NOMENKLATURA=OSTATKI_POSL.NOMENKLATURA
			|        AND OSTATKI.DATA = OSTATKI_POSL.MAXDATA
			|WHERE (OSTATKI.KONTRAGENT =?)
			|GROUP BY OSTATKI.NOMENKLATURA";
			
			Подгзапрос = БДПодготовитьЗапрос(БД, ТекстЗапроса);
			Для каждого стрТЗ Из тзАдресовДоставки Цикл
				Остаток = 0;
				КолвоЗаписей=0;
				БДУстановитьПараметр(ПодгЗапрос, 1, СокрЛП(стрТЗ.ИдКонтр));
				БДУстановитьПараметр(ПодгЗапрос, 2, СокрЛП(стрТЗ.ИдКонтр));
								
				Пока БДСледующаяЗапись(ПодгЗапрос) Цикл
					
					Остаток = БДЗначениеВКолонке(ПодгЗапрос, 1);
					Если Остаток < 0 Тогда
						Остаток = 0;
					КонецЕсли; 
					идНом = БДЗначениеВКолонке(ПодгЗапрос, 0);
					ДатаОстатка = ДатаИзSQLite(БДЗначениеВКолонке(ПодгЗапрос, 2));
					мНоменклатура = ПолучитьСсылкуПоGUID(идНом, "Номенклатура");
					Если Номенклатура.Найти(мНоменклатура)=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					новСтр = тзОстатки.Добавить();
					
					новСтр.АдресДоставки = стрТЗ.АдресДоставки;
					новСтр.Контрагент = стрТЗ.Контрагент;
					новСтр.ИдКонтр = стрТЗ.ИдКонтр;
					новСтр.Номенклатура = мНоменклатура;
					новСтр.ДатаОстатка = НачалоДня(ДатаОстатка);
					новСтр.Остаток = Остаток;
					
				КонецЦикла; 
				БДСбросПодготовленногоЗапроса(ПодгЗапрос);
			КонецЦикла;
			БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);						
			ЗакрытьВнешнююБД(БД, Блокировщик);
		КонецЕсли;
		
		тзОстатки2 = тзОстатки.Скопировать();
		
		//продажи и остатки датам в строку
		ВыборкаКонтрагентов.Сбросить();
		Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
			ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
				ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
						
					Остаток = "";
					ДатаОстатка = Дата(2999,1,1);
					Продажа = "";
					ДатаПродажа = Дата(2999,1,1);
					
					остатки = тзОстатки2.НайтиСтроки(Новый Структура("ИдКонтр, Номенклатура",
						СокрЛП(ВыборкаНоменклатура.ИдКонтр), ВыборкаНоменклатура.Номенклатура));
					Если остатки.Количество() > 0 Тогда
						Если ДатаОстатка >= НачПериода Тогда							
							Остаток = остатки[0].Остаток;
							ДатаОстатка = остатки[0].ДатаОстатка;
							
							Для Каждого стрОстаток из остатки Цикл
								тзОстатки2.Удалить(стрОстаток);
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;	
						
					КолвоПосещенийПродажа = 0;
					КолвоПосещенийВозврат = 0;					
					ИсторияПродаж = "";
					ПроданоЗаТриПоследнихПосещения = 0;
					МинимДатаПродажи = Дата(2999,1,1);// самое далекое будущее, чтобы при первом сравнении дата встала на нужную
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					массивПродажаВозврат = новый Массив();
					//в массиве хранятся структуры вида
					//ДнейНазад - число, Количество - число
					
					колвоПродажаВозврат = 0;
					ЭтоВозврат = Ложь;
					дней = 0;
					Пока Выборка.Следующий() И колвоПродажаВозврат < МаксКолвоПродажаВозврат Цикл
						//Продажа
						Если Выборка.Количество > 0 
								И КолвоПосещенийПродажа < МаксКолвоПосещенийПродажа Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийПродажа = КолвоПосещенийПродажа + 1;
							массивПродажаВозврат.Добавить(новый Структура("ДнейНазад, Количество",
								(ТекДата - Выборка.ДатаПосещения) / 86400, Выборка.Количество));
							МинимДатаПродажи = мин(МинимДатаПродажи, Выборка.ДатаПосещения);
							ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения + Выборка.Количество;
							Если (Продажа = "") Тогда
								Продажа = Выборка.Количество;
								ДатаПродажа = Выборка.ДатаПосещения;
							КонецЕсли;
						КонецЕсли;
						//Возврат
						Если Выборка.КоличествоВозврат < 0 
								И КолвоПосещенийВозврат < МаксКолвоПосещенийВозврат 
								И колвоПродажаВозврат < МаксКолвоПродажаВозврат Тогда
							колвоПродажаВозврат = колвоПродажаВозврат + 1;
							КолвоПосещенийВозврат = КолвоПосещенийВозврат + 1;
							массивПродажаВозврат.Добавить(новый Структура("ДнейНазад, Количество",
								(ТекДата - Выборка.ДатаПосещения) / 86400, Выборка.КоличествоВозврат));
						КонецЕсли;
					КонецЦикла;
												
					стрТЗ = тзИстория.Добавить();
					стрТЗ.ИдКонтр       = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
					стрТЗ.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
					стрТЗ.План          = "";
					стрТЗ.ИсторияПродаж = "<tt>"
						+ "<font color=" + ЦветТекст + ">Продажа&nbsp;</font>" + "<font color=" + ЦветПродажа + ">" + ?(Продажа = "", 
								"данных нет &gt; " + ЧислоВСтроку(КолвоМесяцевНазадДляИстории) + " мес.", 
								Формат(ДатаПродажа, "ДФ=дд.ММ") + "&nbsp;=&nbsp;" + СтрЗаменить(Продажа, " ", "&nbsp;")
								+ " " + СокрЛП(Лев(Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории), 6)) + "</font><br/>")
						+ "<font color=" + ЦветТекст + ">Остаток : </font>" + "<font color=" + ЦветОстаток + ">" + ?(Остаток = "", 
								"данных нет &gt; " + ЧислоВСтроку(КолвоМесяцевНазадДляИстории) + " мес.", 
								Формат(ДатаОстатка, "ДФ=дд.ММ") + "&nbsp;=&nbsp;" + СтрЗаменить(остаток, " ", "&nbsp;")
								+ "&nbsp;" + СокрЛП(Лев(Строка(ВыборкаНоменклатура.НоменклатураЕдиницаИстории), 6)) + "</font>")
						+ "</tt>";
					стрТЗ.ПроданоЗаТриПоследнихПосещения = ПроданоЗаТриПоследнихПосещения;
					стрТЗ.КоличествоПосещений            = Мин(КолвоПосещенийПродажа, МаксКолвоПосещенийПродажа);
					стрТЗ.МинимДатаПродажи               = МинимДатаПродажи;
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла; 
		
		//если в тзОстатки2 есть данные - то надо их выгрузить
		Коэффициент = 0;
		Единица = "";
		Для каждого стрОстаток из тзОстатки2 Цикл
			Если стрОстаток.ДатаОстатка >= НачПериода Тогда							
				Единица = стрОстаток.Номенклатура.БазоваяЕдиницаИзмерения;
				
				стрТЗ = тзИстория.Добавить();
				стрТЗ.ИдКонтр       = СокрЛП(стрОстаток.ИдКонтр);
				стрТЗ.Номенклатура  = стрОстаток.Номенклатура;
				стрТЗ.План          = "";
				стрТЗ.ИсторияПродаж = "<tt>"
					+ "<font color=" + ЦветТекст + ">Продажа&nbsp;</font>" + "<font color=" + ЦветПродажа + ">"
						+ "данных&nbsp;нет&gt; " + ЧислоВСтроку(КолвоМесяцевНазадДляИстории) + "&nbsp;мес." + "</font><br/>"
					+ "<font color=" + ЦветТекст + ">Остаток&nbsp;</font>" + "<font color=" + ЦветОстаток + ">" 
						+ Формат(стрОстаток.ДатаОстатка, "ДФ=дд.ММ") + " = " + СтрЗаменить(стрОстаток.Остаток, " ", "&nbsp;") 
						+ "&nbsp;" + СтрЗаменить(СокрЛП(Лев(Строка(Единица), 6)), " ", "&nbsp;") 
						+ "</font>"
					+ "</tt>";
				стрТЗ.ПроданоЗаТриПоследнихПосещения = 0;
				стрТЗ.КоличествоПосещений            = 0;
				стрТЗ.МинимДатаПродажи               = ТекДата;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//определим план
	//на КПК План продаж ВСЕГДА округляется до целого значения, если выгружен числом (по продаже, по заявке)
	
	Если ПараметрыАгента.ТипРекомендуемогоПлана = 0 Тогда  //По правилу 1,5
		Запрос = Новый Запрос;
		//в ТаблНоменклатуры Остаток всегда в базовой единице
		Запрос.Текст = ТекстКлиентыИТовары + "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ТоварИзОстатков.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТоварИзОстатков.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
		|	ВЫРАЗИТЬ(ТоварИзОстатков.АдресДоставки КАК СТРОКА(200)) КАК АдресДоставки,
		|	ВЫРАЗИТЬ(ТоварИзОстатков.ДатаОстатка КАК ДАТА) КАК ДатаОстатка,
		|	ВЫРАЗИТЬ(ТоварИзОстатков.Остаток КАК ЧИСЛО) КАК Остаток
		|ПОМЕСТИТЬ ТаблОст
		|ИЗ
		|	&ТаблОстатков КАК ТоварИзОстатков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документ.Ссылка.Контрагент КАК Контрагент,
		|	Документ.Номенклатура КАК Номенклатура,
		|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, ДЕНЬ) КАК ДатаПосещения,
		|	Выбор когда Документ.Коэффициент = 0 Тогда Документ.Количество Иначе ЕСТЬNULL(Документ.Количество, 0) / ЕСТЬNULL(Документ.Коэффициент, 1) Конец КАК Количество,
		|	Документ.Ссылка
		|ПОМЕСТИТЬ Таблица
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
		|		ПО Документ.Ссылка.Контрагент = ВремАдреса.Контрагент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
		|		ПО (ТаблТов.Номенклатура = Документ.Номенклатура)
		|ГДЕ
		|	Документ.Ссылка.Дата >= &НачалоПериода
		|	И Документ.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВремАдреса.ИдКонтр КАК ИдКонтр,
		|	ВремАдреса.АдресДоставки КАК АдресДоставки,
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.ДатаПосещения КАК ДатаПосещения,
		|	Таблица.Количество КАК Количество,
		|	ЕСТЬNULL(ТаблОст.Остаток, 0) КАК Остаток,
		|	ТаблОст.ДатаОстатка КАК ДатаОстатка
		|ИЗ
		|	Таблица КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
		|		ПО Таблица.Контрагент = ВремАдреса.Контрагент
		|			И (&НЕСоздаватьТТпоАдресам
		|				ИЛИ (ВЫРАЗИТЬ(Таблица.Ссылка.АдресДоставки КАК СТРОКА(200))) = ВремАдреса.АдресДоставки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблОст КАК ТаблОст
		|		ПО Таблица.Номенклатура = ТаблОст.Номенклатура
		|			И Таблица.Контрагент = ТаблОст.Контрагент
		|			И (&НЕСоздаватьТТпоАдресам
		|				ИЛИ (ВЫРАЗИТЬ(Таблица.Ссылка.АдресДоставки КАК СТРОКА(200))) = ТаблОст.АдресДоставки)
		|ГДЕ
		|	Таблица.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПосещения УБЫВ
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Остаток),
		|	МАКСИМУМ(ДатаОстатка)
		|ПО
		|	ИдКонтр,
		|	АдресДоставки,
		|	Номенклатура,
		|	ДатаПосещения
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Если тзОстатки = Неопределено Тогда 		
			Блокировщик = Неопределено;	
			БД = ОткрытьВнешнююБД(Блокировщик, Ложь);
			Если БД = Ложь Тогда
				Сообщить("Не удалось получить данные файла mobi_s.mdb, проверьте лог ошибок!", СтатусСообщения.Важное);
			Иначе			
				тзОстатки = новый ТаблицаЗначений();
				тзОстатки.колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
				тзОстатки.колонки.Добавить("ИдКонтр", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
				тзОстатки.колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				тзОстатки.колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
				тзОстатки.колонки.Добавить("ДатаОстатка", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
				тзОстатки.колонки.Добавить("Остаток", Новый ОписаниеТипов("Число"));
				
				Для каждого стрТЗ Из тзАдресовДоставки Цикл
					Остаток = 0;
					КолвоЗаписей = 0;
					ТекстЗапроса = "
					|SELECT OSTATKI.NOMENKLATURA, MIN(OSTATKI.OSTATOK) AS Ostatok, MAX(OSTATKI_POSL.MAXDATA) AS MAXDATA
					|FROM OSTATKI
					|    INNER JOIN (
					|        SELECT NOMENKLATURA, MAX(DATA) AS MAXDATA
					|        FROM OSTATKI
					|        WHERE KONTRAGENT=?
					|        GROUP BY NOMENKLATURA
					|    ) AS OSTATKI_POSL ON OSTATKI.NOMENKLATURA=OSTATKI_POSL.NOMENKLATURA
					|        AND OSTATKI.DATA = OSTATKI_POSL.MAXDATA
					|WHERE (OSTATKI.KONTRAGENT =?)
					|GROUP BY OSTATKI.NOMENKLATURA";
					Подгзапрос = БДПодготовитьЗапрос(БД, ТекстЗапроса);
					БДУстановитьПараметр(ПодгЗапрос, 1, СокрЛП(стрТЗ.ИдКонтр));
					БДУстановитьПараметр(ПодгЗапрос, 2, СокрЛП(стрТЗ.ИдКонтр));
					Пока БДСледующаяЗапись(ПодгЗапрос) Цикл
						
						Остаток = БДЗначениеВКолонке(ПодгЗапрос, 1);
						Если Остаток < 0 Тогда
							Остаток = 0;
						КонецЕсли; 
						идНом = БДЗначениеВКолонке(ПодгЗапрос, 0);
						ДатаОстатка = ДатаИзSQLite(БДЗначениеВКолонке(ПодгЗапрос, 2));
						мНоменклатура = ПолучитьСсылкуПоGUID(идНом, "Номенклатура");
						Если Номенклатура.Найти(мНоменклатура) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						новСтр = тзОстатки.Добавить();
						новСтр.АдресДоставки = стрТЗ.АдресДоставки;
						новСтр.Контрагент = стрТЗ.Контрагент;
						новСтр.ИдКонтр = стрТЗ.ИдКонтр;
						новСтр.Номенклатура = мНоменклатура;
						новСтр.ДатаОстатка = НачалоДня(ДатаОстатка);
						новСтр.Остаток = Остаток;
						
					КонецЦикла; 
				БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);						
				КонецЦикла; 	
			КонецЕсли;
			ЗакрытьВнешнююБД(БД, Блокировщик);
		КонецЕсли;
		
		Запрос.Параметры.Вставить("ТаблОстатков", тзОстатки);			
		Запрос.УстановитьПараметр("Табл", тзАдресовДоставки);
		Запрос.УстановитьПараметр("ТаблНоменклатуры", Номенклатура);
		Запрос.Параметры.Вставить("НЕСоздаватьТТпоАдресам", (СпособОрганизацииТТ = 0));
		Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(ДобавитьМесяц(ТекущаяДата(), -КолвоМесяцевНазадДляПлана)));
		
		Результат = Запрос.Выполнить();
		ВыборкаИдКонтр = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИдКонтр.Следующий() Цикл
			ВыборкаАдресДоставки = ВыборкаИдКонтр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАдресДоставки.Следующий() Цикл
				ВыборкаНоменклатура = ВыборкаАдресДоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Попыток = 0;
					ПродажаКоличество = 0;
					ОстатокКоличество = 0;
					ДобавитьСтрокуВПлан = Истина;											
					Пока Выборка.Следующий() Цикл
						Если Попыток = 0 Тогда
							ПродажаКоличество = Выборка.Количество;
							ОстатокКоличество = Выборка.Остаток;
						КонецЕсли;
						
						Если Выборка.ДатаОстатка >= Выборка.ДатаПосещения Тогда
							//(ПоследнийСнятыйОстаток+ПоследняяРеализация-ТекущийОстаток)*1.5/КолвоРеализаций-ТекущийОстаток
							План="("+Формат(ОстатокКоличество, "ЧДЦ=3; ЧРД=.; ЧН=; ЧГ=") + "+" 
								+ Формат(ПродажаКоличество,"ЧДЦ=3; ЧРД=.; ЧН=; ЧГ=")+"-КонОстаток)*1.5"+"-КонОстаток";
							//необходимо получить ИД контрагента из адреса и ссылки на него
							стр=тзПлан.Добавить();
							стр.План		   = План;
							стр.ИдКонтр        = СокрЛП(Выборка.ИдКонтр);
							стр.Номенклатура   = Выборка.Номенклатура;
							стр.ИсторияПродаж  = "";
							ДобавитьСтрокуВПлан = Ложь;
							Прервать;	
						Иначе
							Попыток = Попыток + 1;
						КонецЕсли;
						
						Если Попыток > 1 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ДобавитьСтрокуВПлан Тогда
					//была только одна продажа в рассматриваемом периоде, остаток был снят ранее
						Если Попыток = 1 Тогда
							План="("+Формат(ОстатокКоличество, "ЧДЦ=3; ЧРД=.; ЧН=; ЧГ=") + "+" 
								+ Формат(ПродажаКоличество,"ЧДЦ=3; ЧРД=.; ЧН=; ЧГ=")+"-КонОстаток)*1.5"+"-КонОстаток";
							//необходимо получить ИД контрагента из адреса и ссылки на него
							стр=тзПлан.Добавить();
							стр.План			= План;
							стр.ИдКонтр 		= СокрЛП(ВыборкаНоменклатура.ИдКонтр);
							стр.Номенклатура 	= ВыборкаНоменклатура.Номенклатура;
							стр.ИсторияПродаж	= "";
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ПараметрыАгента.ТипРекомендуемогоПлана = 1 ИЛИ ПараметрыАгента.ТипРекомендуемогоПлана = 2 Тогда  //Последняя реализация(1) / заявка(2)
	//в этом режиме на КПК в качестве плана выгружаются суммарные данные по продажам 
	//из документов с максимальной датой (для 2х и более за один день - товарные части документов будут суммированы)
	//а не данные по последней продаже товара клиенту		
		
		Запрос = Новый Запрос;
		Если ПараметрыАгента.ТипРекомендуемогоПлана = 1 Тогда 
			ТекстУсловие = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Документ.Ссылка.Контрагент КАК Контрагент,
			|	Документ.Номенклатура КАК Номенклатура,
			|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, ДЕНЬ) КАК ДатаПосещения,
			|	СУММА(Выбор когда Документ.Коэффициент = 0 Тогда Документ.Количество Иначе ЕСТЬNULL(Документ.Количество / ЕСТЬNULL(Документ.Коэффициент, 1), 0) Конец) КАК Количество,
			|	Документ.Ссылка
			|ПОМЕСТИТЬ Таблица
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК Документ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
			|		ПО Документ.Ссылка.Контрагент = ВремАдреса.Контрагент
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
			|		ПО (ТаблТов.Номенклатура = Документ.Номенклатура)
			|ГДЕ
			|	Документ.Ссылка.Дата >= &НачалоПериода
			|	И Документ.Ссылка.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	Документ.Ссылка.Контрагент,
			|	Документ.Номенклатура,
			|	Документ.Ссылка,
			|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, ДЕНЬ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.ДатаПосещения КАК ДатаПосещения,
			|	Таблица.Количество КАК Количество,
			|	ВремАдреса.ИдКонтр КАК ИдКонтр,
			|	ВремАдреса.АдресДоставки КАК АдресДоставки
			|ИЗ
			|	Таблица КАК Таблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
			|		ПО Таблица.Контрагент = ВремАдреса.Контрагент
			|			И (&НЕСоздаватьТТпоАдресам
			|				ИЛИ (ВЫРАЗИТЬ(Таблица.Ссылка.АдресДоставки КАК СТРОКА(200))) = ВремАдреса.АдресДоставки)
			|ГДЕ
			|	Таблица.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПосещения УБЫВ
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	ДатаПосещения,
			|	ИдКонтр,
			|	АдресДоставки,
			|	Номенклатура";
		Иначе
			ТекстУсловие = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Документ.Ссылка.ДоговорКонтрагента.Владелец КАК Контрагент,
			|	Документ.Номенклатура КАК Номенклатура,
			|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, ДЕНЬ) КАК ДатаПосещения,
			|	СУММА(Документ.Количество) КАК Количество,
			|	Документ.Ссылка
			|ПОМЕСТИТЬ Таблица
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю.Товары КАК Документ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
			|		ПО Документ.Ссылка.ДоговорКонтрагента.Владелец = ВремАдреса.Контрагент
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
			|		ПО (ТаблТов.Номенклатура = Документ.Номенклатура)
			|ГДЕ
			|	Документ.Ссылка.Дата >= &НачалоПериода
			|	И НЕ Документ.Ссылка.ПометкаУдаления
			|
			|СГРУППИРОВАТЬ ПО
			|	Документ.Ссылка.ДоговорКонтрагента.Владелец,
			|	Документ.Номенклатура,
			|	Документ.Ссылка,
			|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, ДЕНЬ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.ДатаПосещения КАК ДатаПосещения,
			|	Таблица.Количество КАК Количество,
			|	ВремАдреса.ИдКонтр КАК ИдКонтр,
			|	ВремАдреса.АдресДоставки КАК АдресДоставки
			|ИЗ
			|	Таблица КАК Таблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремАдреса КАК ВремАдреса
			|		ПО Таблица.Контрагент = ВремАдреса.Контрагент
			|			И (&НЕСоздаватьТТпоАдресам
			|				ИЛИ (ВЫРАЗИТЬ(Таблица.Ссылка.АдресДоставки КАК СТРОКА(200))) = ВремАдреса.АдресДоставки)
			|ГДЕ
			|	Таблица.Ссылка ССЫЛКА Документ.СчетНаОплатуПокупателю
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПосещения УБЫВ
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	ДатаПосещения,
			|	ИдКонтр,
			|	АдресДоставки,
			|	Номенклатура";
		КонецЕсли;
		
		Запрос.Текст = ТекстКлиентыИТовары + ТекстУсловие;
		Запрос.УстановитьПараметр("Табл", тзАдресовДоставки);
		Запрос.УстановитьПараметр("ТаблНоменклатуры", Номенклатура);
		Запрос.УстановитьПараметр("НЕСоздаватьТТпоАдресам", (СпособОрганизацииТТ = 0));
		Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(ДобавитьМесяц(ТекущаяДата(), -КолвоМесяцевНазадДляПлана)));
		ДатаПоследнегоДокумента = ДатаПустая();
		
		Результат = Запрос.Выполнить();
		ВыборкаДаты = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДаты.Следующий() Цикл
			ВыборкаКонтрагентов = ВыборкаДаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагентов.Следующий() Цикл    //бежим по Контрагентам
				ВыборкаАдреса = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаАдреса.Следующий() Цикл //по номенклатурам
					ВыборкаНоменклатура = ВыборкаАдреса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл
						стрТЗ = тзПлан.Добавить();
						стрТЗ.ИдКонтр = СокрЛП(ВыборкаКонтрагентов.ИдКонтр);
						стрТЗ.Номенклатура = ВыборкаНоменклатура.Номенклатура;
						стрТЗ.План = СтрЗаменить(ЦелоеВСтроку(Окр(ВыборкаНоменклатура.Количество, 0)), ",", ".");
						стрТЗ.ИсторияПродаж = "";							
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			Прервать;
		КонецЦикла;
	
	ИначеЕсли ПараметрыАгента.ТипРекомендуемогоПлана = 3 Тогда  //По скорости продаж
		Если тзИстория.Количество() <> 0 Тогда
			НачалоТекДня = НачалоДня(ТекущаяДата());
			Для каждого стрИстория Из тзИстория Цикл
				МинимДатаПродажи = НачалоДня(стрИстория.МинимДатаПродажи);
				ДнейПродажи      = Окр((НачалоТекДня - МинимДатаПродажи) / 86400, 0);
				Если (ДнейПродажи <> 0) И (стрИстория.КоличествоПосещений <> 0) Тогда
					СкоростьПродаж = стрИстория.ПроданоЗаТриПоследнихПосещения / ДнейПродажи;
					МыПридемКВамВСледующийРазЧерез = ДнейПродажи / стрИстория.КоличествоПосещений;
					//План в виде например строка "(500-КонОстаток)*1.5"
					стрТЗ = тзПлан.Добавить();
					стрТЗ.ИдКонтр = стрИстория.ИдКонтр;
					стрТЗ.Номенклатура = стрИстория.Номенклатура;
					стрТЗ.План = "(" + ЧислоВСтроку(Окр(СкоростьПродаж * МыПридемКВамВСледующийРазЧерез, 2, 1)) + "-КонОстаток)*1.5"; 
					стрТЗ.ИсторияПродаж = "";
				КонецЕсли;				
			КонецЦикла; 	
		КонецЕсли; 
	КонецЕсли; 
	
	//вывод результатов
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	тзПлан.ИдКонтр КАК ИдКонтр,
	|	ВЫРАЗИТЬ(тзПлан.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзПлан.План КАК План,
	|	тзПлан.ИсторияПродаж КАК История
	|ПОМЕСТИТЬ ВремПлан
	|ИЗ
	|	&тзПлан КАК тзПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	тзИстория.ИдКонтр КАК ИдКонтр,
	|	ВЫРАЗИТЬ(тзИстория.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзИстория.План КАК План,
	|	тзИстория.ИсторияПродаж КАК История
	|ПОМЕСТИТЬ ВремИстория
	|ИЗ
	|	&тзИстория КАК тзИстория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПланИстория.ИдКонтр КАК ИдКонтр,
	|	ПланИстория.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ПланИстория.План) КАК План,
	|	МАКСИМУМ(ПланИстория.История) КАК История
	|ПОМЕСТИТЬ ПланИстория
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВремПлан.ИдКонтр КАК ИдКонтр,
	|		ВремПлан.Номенклатура КАК Номенклатура,
	|		ВремПлан.План КАК План,
	|		"""" КАК История
	|	ИЗ
	|		ВремПлан КАК ВремПлан
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВремИстория.ИдКонтр,
	|		ВремИстория.Номенклатура,
	|		"""",
	|		ВремИстория.История
	|	ИЗ
	|		ВремИстория КАК ВремИстория) КАК ПланИстория
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланИстория.ИдКонтр,
	|	ПланИстория.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ТаблТов
	|ИЗ
	|	&ТаблНоменклатуры КАК ТАБЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПланИстория.ИдКонтр КАК ИдКонтр,
	|	ВЫРАЗИТЬ(ТаблТов.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ПланИстория.План КАК План,
	|	ПланИстория.История КАК История
	|ИЗ
	|	ПланИстория КАК ПланИстория
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
	|		ПО ПланИстория.Номенклатура = ТаблТов.Номенклатура";
	
	Запрос.УстановитьПараметр("тзИстория", тзИстория);
	Запрос.УстановитьПараметр("тзПлан", тзПлан);
	Запрос.УстановитьПараметр("ТаблНоменклатуры", Номенклатура);
	
	Подсказки = Запрос.Выполнить().Выбрать();
	
	Ответ = "";
	Счетчик = 0;
	Пока Подсказки.Следующий() Цикл
		Ответ = Ответ
			+ СокрЛП(Подсказки.ИдКонтр) + Таб    //код Контрагента
			+ УникИдентификатор(Подсказки.Номенклатура) + Таб     //код Номенклатуры			
			+ ?(ПустаяСтрока(Подсказки.План), "", "CAST(((" + СокрЛП(Подсказки.План) + ") + 0.5) AS INTEGER)") + Таб //план
			+ СокрЛП(Подсказки.История) + РазделительСтрок;   //история продаж (строкой)
		
		Счетчик = Счетчик + 1;
		Если Счетчик % 20 = 0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки подсказок");
				Возврат Ложь;
			КонецЕсли;
			Ответ = "";
		КонецЕсли;
	КонецЦикла;
	Возврат ПорцияОбмена(Адрес, Ответ, "Подсказки продаж выгружены " + Счетчик + " записей","Ошибка выгрузки подсказок");
КонецФункции

// Выгружает подсказки продаж по запросу с КПК
// Параметры
// Адрес - идентификатор сессии обмена
// спКонтрагентов - список Контрагентов
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьПодсказкиПродажПоЗапросу(Адрес, ТелоСообщения, НачСтр)
	Если НЕ ПорцияОбмена(Адрес,"OK","Выгружаются подсказки по запросу") Тогда
		Возврат Ложь;
	КонецЕсли;
	тзАдресовДоставки = новый ТаблицаЗначений;
	тзАдресовДоставки.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тзАдресовДоставки.Колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
	тзАдресовДоставки.Колонки.Добавить("ИдКонтр", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(32, ДопустимаяДлина.Переменная)));
	
	КолСтр = СтрЧислоСтрок(ТелоСообщения);  //в теле сообщения перечислены коды Контрагентов
	Для Н = НачСтр По КолСтр Цикл
		мКод           = СтрПолучитьСтроку(ТелоСообщения, Н);
		мКонтрагент    = Справочники.Контрагенты.ПустаяСсылка();
		мАдресДоставки = "";
		
		ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
		Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
			ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
			Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
				Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
					ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ПолучитьКонтрагентаИАдресПоКоду(мКод, мКонтрагент, мАдресДоставки, ПапкаРодителя);
		
		Если мКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		//РАЗОБРАТЬСЯ ДобавитьОшибку("Не найден контрагент с кодом "+мКод);
		Иначе
			стрТЗ = тзАдресовДоставки.Добавить();
			стрТЗ.Контрагент = мКонтрагент;
			
			Если СпособОрганизацииТТ = 1 И Значениезаполнено(мАдресДоставки) Тогда
				стрТЗ.АдресДоставки = мАдресДоставки; //к адресу нужно добавить контрагента, т.к. 2 контрагента могут иметь одинаковый адрес (а одном торговом центре)
				стрТЗ.ИдКонтр       = мКод; 
			Иначе
				стрТЗ.АдресДоставки = "";
				стрТЗ.ИдКонтр       = мКонтрагент.Код; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	тзНоменклатура = Новый ТаблицаЗначений;
	ПолучитьСписокНоменклатуры(тзНоменклатура);
	ВыгрузитьПодсказкиПродаж(Адрес, тзАдресовДоставки, тзНоменклатура);
	
	Возврат СерверПослатьОтвет(Адрес, "", 1)
КонецФункции

// Выгружает подсказки продаж при полной загрузке
// Параметры
// Адрес - идентификатор сессии обмена
// ТаблМаршрутовСегодня - Маршрут на сегодня 
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьПодсказкиПродажПриПолнойЗагрузке(Адрес, ТаблКонтрагентов, Номенклатура)
	Если НЕ ПорцияОбмена(Адрес,"SalesHelp", "Выгружаются подсказки...") Тогда
		Возврат Ложь;
	КонецЕсли;
	тзАдресовДоставки = новый ТаблицаЗначений;
	тзАдресовДоставки.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тзАдресовДоставки.Колонки.Добавить("ИдКонтр", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(32, ДопустимаяДлина.Переменная)));
	тзАдресовДоставки.Колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
	
	Если ТаблКонтрагентов <> Неопределено Тогда
		Если СпособОрганизацииТТ = 0 Тогда
			Для Каждого стрТЗ Из ТаблКонтрагентов Цикл
				НовСтр = тзАдресовДоставки.Добавить();
				НовСтр.Контрагент	 = стрТЗ.Контрагент;
				НовСтр.ИдКонтр       = стрТЗ.Контрагент.Код; 
				НовСтр.АдресДоставки = "";
			КонецЦикла; 
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(Табл.Контрагент КАК Справочник.Контрагенты) КАК Контрагент
			|ПОМЕСТИТЬ Клиенты
			|ИЗ
			|	&Табл КАК Табл
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Клиенты.Контрагент КАК Контрагент,
			|	Клиенты.Контрагент.Код КАК КонтрагентКод,
			|	КИ.Представление КАК Адрес,
			|	КИ.Вид.Код КАК АдресКод,
			|	NULL КАК ФактАдрес
			|ИЗ
			|	Клиенты КАК Клиенты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ
			|		ПО Клиенты.Контрагент = КИ.Объект
			|ГДЕ
			|	КИ.Вид В(&АдресаДляТТ)
			|	И КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Клиенты.Контрагент,
			|	Клиенты.Контрагент.Код,
			|	NULL,
			|	NULL,
			|	ВЫРАЗИТЬ(КИ.Представление КАК СТРОКА(200))
			|ИЗ
			|	Клиенты КАК Клиенты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ
			|		ПО Клиенты.Контрагент = КИ.Объект
			|ГДЕ
			|	КИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
			|	И КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
			|ИТОГИ
			|	МАКСИМУМ(КонтрагентКод),
			|	МАКСИМУМ(ФактАдрес)
			|ПО
			|	Контрагент";
			Запрос.УстановитьПараметр("Табл", ТаблКонтрагентов);
			Запрос.УстановитьПараметр("АдресаДляТТ", АдресаДляТТ.ВыгрузитьКолонку("АдресДляТТ"));
			
			Результат = Запрос.Выполнить();
			ВыборкаКонтрагент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
				НовСтр = тзАдресовДоставки.Добавить();
				НовСтр.Контрагент	 = ВыборкаКонтрагент.Контрагент;
				НовСтр.ИдКонтр       = СокрЛП(ВыборкаКонтрагент.КонтрагентКод);
				НовСтр.АдресДоставки = ВыборкаКонтрагент.ФактАдрес;
				Выборка = ВыборкаКонтрагент.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.Адрес) Тогда
						НовСтр = тзАдресовДоставки.Добавить();
						НовСтр.Контрагент	 = Выборка.Контрагент;
						НовСтр.ИдКонтр       = Лев(
							Выборка.КонтрагентКод + "                            ", ДлинаКодаКонтрагенты) + СокрЛП(Выборка.АдресКод);
						НовСтр.АдресДоставки = Выборка.Адрес;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ОтветОтКПК = ВыгрузитьПодсказкиПродаж(Адрес, тзАдресовДоставки, Номенклатура);
	
	Возврат ОтветОтКПК;
КонецФункции

// Выгружает каналы сбыта
// Параметры
// Адрес - идентификатор сессии обмена
// тзНоменклатуры - Таблица с номенклатурой
// спКонтрагентов - контрагенты
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСвойстваОбъектов(Адрес, тзНоменклатуры, спКонтрагентов, тзАдресаДляТТ, Выгружать)
	Если НЕ ПорцияОбмена(Адрес, "Properties", "Выгружаются свойства объектов...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик = 0;
	Ответ = "";
	найденныеСтроки = Новый Массив();
	
	Если Выгружать Тогда
		//Выгрузим значения свойства канал сбыта для Контрагента
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Код КАК КонтрагентКод,
		|	СвойстваКонтр.Значение КАК КаналСбыта
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваКонтр
		|		ПО Контрагенты.Ссылка = СвойстваКонтр.Объект
		|ГДЕ
		|	СвойстваКонтр.Свойство = &СвойствоКаналСбыта
		|	И Контрагенты.Ссылка В(&спКонтрагентов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрагентКод
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("СвойствоКаналСбыта", ПВХКаналаСбытаКонтрагента);
		Запрос.УстановитьПараметр("спКонтрагентов", спКонтрагентов);
		ТекКод = "";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТекКод <> Выборка.КонтрагентКод Тогда
				ТекКод = Выборка.КонтрагентКод; //исключим возможность двойников 
				Ответ = Ответ
					+ "КаналСбыта" + Таб
					+ "1" + Таб
					+ СокрЛП(Выборка.КонтрагентКод) + Таб
					+ Лев(УбратьСпецСимволы(Строка(Выборка.КаналСбыта)), 12) + РазделительСтрок;
				
				Счетчик = Счетчик + 1;
				Если Счетчик % 100 = 0 Тогда
					Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
						ДобавитьОшибку("Ошибка выгрузки каналов сбыта");
						Возврат Ложь;
					КонецЕсли;
					Счетчик = 0;
					Ответ = "";
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла;
		//Выгрузим значения категорий номенклатуры
		Запрос = Новый Запрос;
		
		Если Конфигурация = "БухКазахстан" Тогда
			Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
			|ПОМЕСТИТЬ НоменклатураВрем
			|ИЗ
			|	&ТаблНоменклатуры КАК ТАБЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Ном.Номенклатура КАК Номенклатура,
			|	ПОДСТРОКА(Категории.Категория.Наименование, 13, 12) КАК КаналСбыта
			|ИЗ
			|	РегистрСведений.КатегорииОбъектов КАК Категории
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураВрем КАК Ном
			|		ПО Категории.Объект = Ном.Номенклатура
			|ГДЕ
			|	Категории.Категория В(&СписокКатегорий)";
		Иначе
			Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
			|ПОМЕСТИТЬ НоменклатураВрем
			|ИЗ
			|	&ТаблНоменклатуры КАК ТАБЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Ном.Номенклатура КАК Номенклатура,
			|	ПОДСТРОКА(Категории.Свойство.Наименование, 13, 12) КАК КаналСбыта
			|ИЗ
			|	РегистрСведений.ЗначенияСвойствОбъектов КАК Категории
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураВрем КАК Ном
			|		ПО Категории.Объект = Ном.Номенклатура
			|ГДЕ
			|	Категории.Свойство В(&СписокКатегорий)
			|	И Категории.Значение = ИСТИНА";
		КонецЕсли;
		
		Запрос.Текст = Текст;
		ТЗ = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "КаналыСбыта");
		СписокКатегорий = ТЗ.ВыгрузитьКолонку("КаналСбытаНоменклатура");
		Запрос.УстановитьПараметр("СписокКатегорий", СписокКатегорий);		
		Запрос.УстановитьПараметр("ТаблНоменклатуры", тзНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			УнКод = УникИдентификатор(Выборка.Номенклатура);
			Ответ = Ответ
				+ "КаналСбыта" + Таб
				+ "4" + Таб
				+ УнКод + Таб
				+ УбратьСпецСимволы(Выборка.КаналСбыта) + РазделительСтрок;
			
			Счетчик = Счетчик + 1;
			Если Счетчик % 100 = 0 Тогда
				Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
					ДобавитьОшибку("Ошибка выгрузки каналов сбыта");
					Возврат Ложь;
				КонецЕсли;
				Счетчик = 0;
				Ответ = "";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Если Конфигурация = "БухКазахстан" Тогда
		//Выгрузим значения категорий для документов
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Код, Наименование ИЗ Справочник.КатегорииОбъектов ГДЕ НазначениеКатегории = &Док");
		Запрос.УстановитьПараметр("Док", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл	
			Ответ = Ответ + Выборка.Код + "0" + Таб + "12" + Таб + "" + Таб + Выборка.Наименование + РазделительСтрок;
			Ответ = Ответ + Выборка.Код + "1" + Таб + "14" + Таб + "" + Таб + Выборка.Наименование + РазделительСтрок;
			Ответ = Ответ + Выборка.Код + "2" + Таб + "16" + Таб + "" + Таб + Выборка.Наименование + РазделительСтрок;
			Ответ = Ответ + Выборка.Код + "3" + Таб + "18" + Таб + "" + Таб + Выборка.Наименование + РазделительСтрок;
			Ответ = Ответ + Выборка.Код + "4" + Таб + "37" + Таб + "" + Таб + Выборка.Наименование + РазделительСтрок;
			Счетчик = Счетчик + 5;
			
			Если Счетчик % 100 = 0 Тогда
				Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
					ДобавитьОшибку("Ошибка выгрузки каналов сбыта");
					Возврат Ложь;
				КонецЕсли;
				Счетчик = 0;
				Ответ = "";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ПорцияОбмена(Адрес,Ответ,"Свойства объектов выгружены " + Счетчик + " записей","Ошибка выгрузки свойств объектов");
КонецФункции

//Выгружает типы цен, которые есть в договорах выгруженных Контрагентов, плюс тип цен по-умолчанию
// Параметры
// Адрес - идентификатор сессии обмена
// СписокТиповЦен - Список типов цен
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьТипыЦен(Адрес, тзТиповЦен)
	Если НЕ ПорцияОбмена(Адрес,"PriceTypes","Выгружаются типы цен...") Тогда
		Возврат Ложь;
	КонецЕсли;
  	Счетчик=0;
	Ответ="";
	Для Каждого стрТЦ Из тзТиповЦен Цикл
		ТЦ = стрТЦ.ТипЦен;
		Если ТЦ = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда 
			Продолжить; 
		КонецЕсли;
		
		Ответ=Ответ
			+УникИдентификатор(ТЦ)+Таб
			+УбратьСпецСимволы(ТЦ.Наименование)+РазделительСтрок;
		
		Счетчик=Счетчик+1;
		Если Счетчик%50=0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
				ДобавитьОшибку("Ошибка выгрузки типов цен");
				Возврат Ложь;
			КонецЕсли;
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	Возврат ПорцияОбмена(Адрес,Ответ,"Типы цен выгружены "+Счетчик+" записей","Ошибка выгрузки типов цен");
КонецФункции

//Выгружает значения цен из списка типов цен, заданных у Контрагентов, для выгруженной Номенклатуры
// Параметры
// Адрес - идентификатор сессии обмена
// тзНоменклатуры - Таблица с номенклатурой
// СписокТиповЦен - Список типов цен
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьЦены(Адрес, ТаблНоменклатуры, тзТиповЦен)
	
	Если НЕ ПорцияОбмена(Адрес, "Prices", "Выгружаются цены...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ АвтономныйРежим Тогда
		Сервер.ПерезапускКомпрессора(Адрес);
	КонецЕсли; 
	
	Ответ = "";
	Счетчик = 0;
	ТекДата = КонецДня(ТекущаяДата());
	Условие = "";
	Организация = ПараметрыАгента.Организации[0].Организация;
	Если Конфигурация = "БухКазахстан" Тогда
		Условие = " И Организация = &Организация";
	КонецЕсли;
	
	ЗапросНоменклатура = Новый Запрос;
	ЗапросНоменклатура.УстановитьПараметр("ТаблНоменклатуры", ТаблНоменклатуры);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросНоменклатура.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
    ЗапросНоменклатура.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТАБЛ.Партия КАК Партия
	|ПОМЕСТИТЬ ТаблТов
	|ИЗ
	|	&ТаблНоменклатуры КАК ТАБЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	Результат = ЗапросНоменклатура.Выполнить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ТаблТов.Номенклатура, Цены.Цена, Цены.Валюта ИЗ ТаблТов КАК ТаблТов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, ТипЦен = &ТипЦен" + Условие + ") КАК Цены
	|	ПО (Цены.Номенклатура = ТаблТов.Номенклатура)";
	
	Если Конфигурация = "БухБеларусь" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ТаблТов.Номенклатура, ТаблТов.Партия, Цены.Цена, Цены.Валюта ИЗ ТаблТов КАК ТаблТов
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, ТипЦен = &ТипЦен" + Условие + ") КАК Цены
		|	ПО (Цены.Номенклатура = ТаблТов.Номенклатура)";
	КонецЕсли;
	КурсыВалют = Новый Соответствие;
	Валюта = Справочники.Валюты.Выбрать();
	Пока Валюта.Следующий() Цикл
		Структура = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДата, Новый Структура("Валюта", Валюта.Ссылка));
		Структура.Кратность = ?(Структура.Кратность = 0, 1, Структура.Кратность);
		КурсыВалют.Вставить(Валюта.Ссылка, Структура);
	КонецЦикла;
	ВалютаКПК = ПараметрыАгента.ВалютаКПК;
	СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДата, Новый Структура("Валюта", ВалютаКПК));
	
	Для Каждого стрТипЦен Из тзТиповЦен Цикл
		ТипЦен = стрТипЦен.ТипЦен;
		Если стрТипЦен.ТипЦен.Пустая() Тогда 
			Продолжить; 
		КонецЕсли;
		ТипЦенКод = УникИдентификатор(ТипЦен);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ДатаСреза", ТекДата);
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Если Конфигурация = "БухКазахстан" Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл                                     
			
			ТекЦена = ОкруглитьЦену(Выборка.Цена, ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);
			Если ВалютаКПК <> Выборка.Валюта Тогда
				Структура = КурсыВалют.Получить(Выборка.Валюта);
				ТекЦена = ПересчитатьИзВалютыВВалюту(ТекЦена, Выборка.Валюта, ВалютаКПК,
					Структура.Курс, СтруктураВалютаКПК.Курс, Структура.Кратность, СтруктураВалютаКПК.Кратность);
			КонецЕсли;
			
			Если Не ТипЦен.ЦенаВключаетНДС Тогда
				ТекЦена = Окр(ТекЦена * (1 + ?(ЗначениеЗаполнено(Выборка.Номенклатура.СтавкаНДС), ПолучитьСтавкуНДС(Выборка.Номенклатура.СтавкаНДС), 0) / 100), 2);
			КонецЕсли;
			
			Если ТекЦена = 0 Тогда Продолжить; КонецЕсли;
			КодТовара = УникИдентификатор(Выборка.Номенклатура);
			Если Конфигурация = "БухБеларусь" И Выборка.Партия <> "" Тогда
				КодТовара = КодТовара + "#" + УникИдентификатор(Выборка.Партия);
			КонецЕсли;
			Ответ=Ответ+
			КодТовара+Таб+
			ТипЦенКод+Таб+
			СуммаВСтроку(ТекЦена)+РазделительСтрок;
			Счетчик=Счетчик+1;	
			
			Если Счетчик%50=0 Тогда
				Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
					ДобавитьОшибку("Ошибка выгрузки цен");
					Возврат Ложь;
				КонецЕсли;
				Ответ="";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Цены выгружены "+Счетчик+" записей","Ошибка выгрузки цен");
	
КонецФункции

Функция ОкруглитьЦену(Число, ПараметрПорядокОкругления, ОкруглятьВБольшуюСторону)

	Перем Результат;
	
	Порядок = ПорядокОкругленияЦен[ПараметрПорядокОкругления];
	КоличествоИнтервал = Число / Порядок;
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		Результат = Число;
	Иначе                                                 
		Если ОкруглятьВБольшуюСторону Тогда
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе
			Результат = Порядок * Окр(КоличествоИнтервал, 0 ,РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Выгружает скидки
// Параметры
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСкидки(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"Discounts","Выгружаются скидки...") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ АвтономныйРежим Тогда
		Сервер.ПерезапускКомпрессора(Адрес);
	КонецЕсли; 
	Ответ=""; Счетчик=0;
	Возврат ПорцияОбмена(Адрес,Ответ,"Скидки выгружены "+Счетчик+" записей","Ошибка выгрузки скидок");
КонецФункции

// Выгружает служебные данные Service
// Параметры 
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСлужебныеДанные(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"Service","Выгружаются служебные данные...") Тогда
		Возврат Ложь;
	КонецЕсли;
    ПериодСнятияGPSКоординат = Формат(ПараметрыАгента.ПериодGPS,"ЧГ=0");
	ПериодОтправкиGPSКоординат = Формат(ПараметрыАгента.ПериодОтправкиКоординат,"ЧГ=0");
	Ответ =	ДатаВСтрокуДляКПК(ТекущаяДата())+Таб     	//Дата
			+УникИдентификатор(ПараметрыАгента.ТипЦенПоУмолчанию)+Таб     	//код типа цен поумолчанию
			+?(ПериодСнятияGPSКоординат="",0,ПериодСнятияGPSКоординат)+Таб  	//период снятия координат
			+?(ПериодОтправкиGPSКоординат="",0,ПериодОтправкиGPSКоординат)+Таб	//период отправки координат
			+?(ПараметрыАгента.ПечатьФормБезНомера,"1","0")+Таб	 //1 печатать документы с кпк с пустым полем номера
			+?(ПараметрыАгента.ВключитьGPSМониторинг,"1","0")+РазделительСтрок;
	Счетчик = 0;		
	//Если ПараметрыАгента.ВыгружатьОтчеты Тогда
		тзОтчеты = ПрочитатьОтчеты(ПараметрыАгента.Агент); 
		
		Для каждого стрОтчет Из тзОтчеты Цикл
			Если (стрОтчет.Загружать=Ложь) Тогда Продолжить; КонецЕсли;
 			Если ЗначениеЗаполнено(стрОтчет.НазваниеОтчета) Тогда
				Ответ=Ответ
					+стрОтчет.КодОтчета+Таб
					+УбратьСпецСимволы(стрОтчет.НазваниеОтчета)+Таб
					+?(ПараметрыАгента.ВыгружатьОтчеты,1,0)+Таб
					+?(стрОтчет.ЗапрашиватьПериод,1,0)+Таб
					+?(ПустаяСтрока(стрОтчет.ОтборПоКонтрагенту),0,1)+Таб
					+?(ПустаяСтрока(стрОтчет.ОтборПоДоговору),0,1)+Таб
					+?(ПустаяСтрока(стрОтчет.ОтборПоНоменклатуре),0,1)+РазделительСтрок;
				Счетчик = Счетчик + 1;	
			КонецЕсли; 
		КонецЦикла; 	  
	//КонецЕсли; 

	Возврат ПорцияОбмена(Адрес,Ответ,"Служебные данные выгружены "+Счетчик+" записей","Ошибка выгрузки служебных данных");
КонецФункции

// Выгрузить в КПК все сообщения для Агента с указанными статусами
// Параметры 
// Адрес - идентификатор сессии обмена
// Статусы - строка, задаются статусы сообщений через запятую
// тзНоменклатуры - таблица значений Номенклатура/детализация для дублирования сообщений по строкам детализации
// массивКонтрагенты - массив ссылок на контрагентов из доступных агенту
// ФлагЗавершенияОбмена - признак завершения обмена данными
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСообщения(Адрес, Статусы, тзНоменклатуры, массивКонтрагенты, НачалоОтвета, ФлагЗавершенияОбмена = 0)
	Если НЕ ПорцияОбмена(Адрес,НачалоОтвета,"Выгружаются сообщения...") Тогда
		Возврат Ложь;
	КонецЕсли;

	АвторСообщения = глЗначениеПеременной("глТекущийПользователь");
	Код = 0;
	Ответ = "";
	Счетчик = 0;
	Привязка = Неопределено;
	
	Блокировщик = Неопределено;
	БД = ОткрытьВнешнююБД(Блокировщик, Истина);
	Если БД = Ложь Тогда
		Сообщить(ОшибкаНетДоступаКВнешнейБД, СтатусСообщения.Важное);
		Статус = ПорцияОбмена(
			Адрес,Ответ,"Сообщения выгружены "+Счетчик+" записей","Ошибка выгрузки сообщений", ФлагЗавершенияОбмена);
		Возврат Статус;
	КонецЕсли;
	
	ТекстЗапроса=
		"Select CODE,DT,OBJTYPE,OBJKOD,THEME,BODY,ACTUALLY,TODO,AGENT,AUTHOR,STATUS "
		+ "from [messages] " 
		+ "where AGENT='" + СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код) + "' AND STATUS <> 4 ";
	ПодгЗапрос=БДПодготовитьЗапрос(БД, ТекстЗапроса);
	
	Пока БДСледующаяЗапись(ПодгЗапрос) Цикл //Цикл по записям DBF
		
		//заменить разделитель строки на символ 11
		код 			= БДЗначениеВКолонке(ПодгЗапрос, 0);
		дата 			= СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 1));    //дата записывается в требуемом формате в момент сохранения сообщения
		тема 			= СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 4));
		актуальность 	= БДЗначениеВКолонке(ПодгЗапрос, 6);
		сделатьДо 		= БДЗначениеВКолонке(ПодгЗапрос, 7);
		ТелоСообщения 	= 
			СтрЗаменить(
				СтрЗаменить(
					СтрЗаменить(
						СтрЗаменить(
							СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 5)),
							Символы.Таб, 
							" "),
						Символы.ВК + Символы.ПС,
						Символы.ВТаб),
					Символы.ВК,
					Символы.ВТаб),
				Символы.ПС,
				Символы.ВТаб);
		УбратьСпецСимволыВСтроке(ТелоСообщения, "" + Символы.ВТаб);
		ТипПривязки 	= СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 2));
		КодАгента   	= СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 8));
		КодПривязки 	= СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 3));
		АвторСообщения	= СокрЛП(БДЗначениеВКолонке(ПодгЗапрос, 9));
		СтатусСообщ		= БДЗначениеВКолонке(ПодгЗапрос, 10);
		СтатусСообщ		= "" + ?(СтатусСообщ = 1, 2, СтатусСообщ);                    
		Привязка		= Неопределено;
		Если ТипПривязки="1" Тогда  //КЛИЕНТ
			Попытка
				Об = ПолучитьСсылкуПоGUID(КодПривязки,"Контрагенты");
				Если НЕ Об = Неопределено Тогда
					Если Не Об.Пустая() Тогда
						Если НЕ массивКонтрагенты.Найти(Об) = Неопределено Тогда
							Привязка = Об.Код;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли
			Исключение
			КонецПопытки;
		ИначеЕсли ТипПривязки="4" Тогда //Товар
			Об = ПолучитьСсылкуПоGUID(КодПривязки,"Номенклатура");
			Если НЕ Об = Неопределено Тогда
				Если Не Об.Пустая() Тогда
					строкиДетализации = тзНоменклатуры.НайтиСтроки(новый Структура("Номенклатура", Об));
					код = код * 10000;
					индекс = 0;
					Для Каждого стр из строкиДетализации Цикл 
						Ответ=Ответ + ДобавитьСообщениеКВыгрузке(
							код + индекс, 
							дата, 
							АвторСообщения, 
							ТипПривязки, 
							УникИдентификатор(стр.Номенклатура), 
							тема, 
							ТелоСообщения, 
							актуальность, 
							СтатусСообщ, 
							сделатьДо);
						индекс = индекс + 1;
					КонецЦикла;
					Счетчик = Счетчик + индекс;
				КонецЕсли;
			КонецЕсли;
			Привязка = Неопределено;
		ИначеЕсли ТипПривязки="6" Тогда
			Привязка = КодАгента;
		КонецЕсли; 
		Если НЕ Привязка = Неопределено Тогда
			Ответ=Ответ + ДобавитьСообщениеКВыгрузке(
				код, дата, АвторСообщения, ТипПривязки, Привязка, тема, ТелоСообщения, актуальность, СтатусСообщ, сделатьДо);
			Счетчик = Счетчик + 1;
		КонецЕсли;		
	КонецЦикла;
	БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);
	Статус = ПорцияОбмена(
		Адрес,Ответ,"Сообщения выгружены "+Счетчик+" записей","Ошибка выгрузки сообщений", ФлагЗавершенияОбмена);
	
	Если Статус Тогда
		//изменить статус на отосланные (2)
		
		БДЗапросБезРезультата(БД, "Update [messages] Set STATUS = 2 where AGENT='" + СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код) + "' AND STATUS = 1");
					
	КонецЕсли;	
	
	ЗакрытьВнешнююБД(БД, Блокировщик);	
					
	Возврат Статус;
КонецФункции	

// Формирует строку с параметрами сообщения в соответствии с протоколом обмена
// Параметры:
// 		CODE - Строка, код сообщения
// 		DT - Строка, дата и время создания сообщения в формате DD.MM.YYYY HH:MM:SS
// 		АвторСообщения - Строка, имя автора сообщения
// 		ТипПривязки - Строка, код таблицы, к которой привязано сообщение
// 			(1- клиент, 4 - товар, 6 - агент)
// 		Привязка - Строка, уникальный код объекта, к которому привязано сообщение
// 			(клиент, товар, или агент)
// 		THEME - Строка, тема сообщения
// 		ТелоСообщения - Строка, само сообщение
// 		ACTUALLY - Строка, дата и время, до которого сообщение актуально, пока не используется
// 		Статус - Строка, Статус сообщения: 2-Новое, 3-Прочитано, 4-Выполнено
// 		TODO - Флаг важности. Сейчас в КПК не задействовано.
// Возвращаемое значение:
// 		Строка, отформатированная в соответствии с протоколом обмена
Функция ДобавитьСообщениеКВыгрузке(CODE, DT, Автор, ТипПривязки, Привязка, THEME, ТелоСообщения, ACTUALLY, Статус, TODO)
	Ответ = ""
		+ ЦелоеВСтроку(CODE) + Таб
		+ DT + Таб
		+ Автор + Таб
		+ ЦелоеВСтроку(ТипПривязки)	+ Таб
	//Если код привязки к Агенту, то передадим КодАгента, иначе КодОбъектаПривязки		
		+ Привязка + Таб
		+ THEME + Таб
		+ ТелоСообщения + Таб
		+ Формат(ACTUALLY) + Таб
		+ ЦелоеВСтроку(Статус) + Таб
		+ TODO + РазделительСтрок;
	
    возврат Ответ;
КонецФункции
 
// Выгрузить в КПК все сообщения для Агента с указанными статусами
// Параметры 
// Адрес - идентификатор сессии обмена
// Статусы - строка, задаются статусы сообщений через запятую
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСообщенияПоЗапросу(Адрес, Статусы)
	
	Если ПараметрыАгента.ВыгружатьСообщения Тогда
		тзНоменклатуры = Новый ТаблицаЗначений;
		ПолучитьСписокНоменклатуры(тзНоменклатуры);
		
		МВТДолги = Неопределено;
		тзКонтрагенты = ПолучитьТаблицуКонтрагентов(
			ПараметрыАгента.Агент,
			ПараметрыАгента.ЗапретитьИзменятьТипЦен,
			ПараметрыАгента.ВыделятьЦветомКонтрагентов, 
			Истина, МВТДолги);
		
		Возврат ВыгрузитьСообщения(Адрес, "1,2,3", тзНоменклатуры, тзКонтрагенты.ВыгрузитьКолонку("Контрагент"), "OK", 1);
	Иначе
		Если НЕ ПорцияОбмена(Адрес, "OK", "Выгружаются сообщения...") Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат ПорцияОбмена(Адрес, "", "Выгрузка сообщений агенту отключена", "Ошибка выгрузки сообщений", 1);
	КонецЕсли;
	
КонецФункции	
 
// Реагирует на запрос на обновление остатков
// Параметры 
//	Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьОстатки(Адрес, Платформа)
	Если НЕ ПорцияОбмена(Адрес,"OK","Выполняется запрос 'Загрузка остатков'") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	тзНоменклатура = Новый ТаблицаЗначений;
	тзОстатки = Новый ТаблицаЗначений;
	ПолучитьСписокНоменклатуры(тзНоменклатура, тзОстатки);
	
	тзОрганизации = ПрочитатьОрганизации(ПараметрыАгента.Агент); 
	Если (ТипЗнч(тзОрганизации) <> Тип("ТаблицаЗначений")) Или (тзОрганизации.Количество() = 0) Тогда                            
		ДобавитьСообщение("Не заданы организации. Будут выгружены все.");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка КАК Организация, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузоотправитель
		|ИЗ Справочник.Организации СГРУППИРОВАТЬ ПО Ссылка";
		тзОрганизации = Запрос.Выполнить().Выгрузить();
	КонецЕсли; 
    
	МВТДолги = Истина;
	тзКонтрагенты = ПолучитьТаблицуКонтрагентов(
		ПараметрыАгента.Агент,
		ПараметрыАгента.ЗапретитьИзменятьТипЦен,
		ПараметрыАгента.ВыделятьЦветомКонтрагентов, 
		Истина, МВТДолги); //получим выборку с контрагентами
	
	спКонтрагентов = тзКонтрагенты.ВыгрузитьКолонку("Контрагент"); //список контрагентов

	тзДоговоры = ПолучитьТаблицуДоговоров(
		спКонтрагентов,
		тзОрганизации, 
		ПараметрыАгента.ТипЦенПоУмолчанию, 
		ПараметрыАгента.ТипСоздаваемогоДокументаПокупка, 
		ПараметрыАгента.ТорговляСКолес, МВТДолги);
	
	тзТиповЦен = ПолучитьТаблицуТиповЦен(тзДоговоры);	
	
    //список номенклатуры
	Если НЕ ВыгрузитьНоменклатуру(Адрес, тзНоменклатура) Тогда 
		Возврат ложь; 
	КонецЕсли;
	
	Если НЕ ВыгрузитьОстаткиНоменклатуры(Адрес,тзОстатки) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Группы номенклатуры (папки) 
	Если НЕ ВыгрузитьГруппыНоменклатуры(Адрес, тзНоменклатура) Тогда 
		Возврат ложь; 
	КонецЕсли;
	
	//Состав групп номенклатуры
	Если НЕ ВыгрузитьСоставГруппНоменклатуры(Адрес, тзНоменклатура) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Типы цен
	Если НЕ ВыгрузитьТипыЦен(Адрес, тзТиповЦен) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Цены
	Если НЕ ВыгрузитьЦены(Адрес, тзНоменклатура, тзТиповЦен) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Единицы измерения	
	Если НЕ ВыгрузитьЕдиницы(Адрес, тзНоменклатура) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		Если НЕ ВыгрузитьМаршруты(Адрес, Платформа, ПараметрыАгента.ВыгружатьМаршруты, Истина, спКонтрагентов) Тогда 
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;
	
	//сообщения	
	Если ПараметрыАгента.ВыгружатьСообщения Тогда
		Если ВыгрузитьСообщения(Адрес, "1,2,3", тзНоменклатура, тзКонтрагенты.ВыгрузитьКолонку("Контрагент"), "Messages") Тогда
		Иначе
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат СерверПослатьОтвет(Адрес, РазделительСтрок, 1); //передаем пустую строку
	
КонецФункции

// Реагирует на запрос выгрузки цен контрагента
// Параметры 
//	Адрес - идентификатор сессии обмена
//	ТелоЗапроса - запрос
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьЦеныКонтрагента(Адрес, ТелоЗапроса)
	параметрыЗапроса = СтрПолучитьСтроку(ТелоЗапроса, 5);
	параметрыЗапроса = СтрЗаменить(параметрыЗапроса, таб, РазделительСтрок);
	КодКлиента = СтрПолучитьСтроку(параметрыЗапроса, 1);
	ИдДоговора = СтрПолучитьСтроку(параметрыЗапроса, 2);
	
	тзНоменклатура = Новый ТаблицаЗначений;
	ПолучитьСписокНоменклатуры(тзНоменклатура);
	
	Если НЕ ПорцияОбмена(Адрес, "OK", "Выполняется запрос 'Загрузка цен контрагентов'") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ответ = "";
	Счетчик = 0;
	ТекДата = КонецДня(ТекущаяДата());
	Условие = "";
	ТекстОтвета = "контрагента";
	Организация = Неопределено;
	Если Конфигурация = "БухКазахстан" Тогда
		Условие = " И Организация = &Организация";
		ТекстОтвета = "организации " + Организация;
		Если ЗначениеЗаполнено(ИдДоговора) Тогда
			Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(ИдДоговора)));
			Организация = ?(ЗначениеЗаполнено(Договор.Организация), Договор.Организация, ПараметрыАгента.Организации[0].Организация);
		КонецЕсли;
	КонецЕсли;
	
	ЗапросНоменклатура = Новый Запрос;
	ЗапросНоменклатура.УстановитьПараметр("ТаблНоменклатуры", тзНоменклатура);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросНоменклатура.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
    ЗапросНоменклатура.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ТАБЛ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ТаблТов
	|ИЗ
	|	&ТаблНоменклатуры КАК ТАБЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	Результат = ЗапросНоменклатура.Выполнить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ТаблТов.Номенклатура, Цены.Цена, Цены.Валюта ИЗ ТаблТов КАК ТаблТов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, ТипЦен = &ТипЦен" + Условие + ") КАК Цены
	|	ПО (Цены.Номенклатура = ТаблТов.Номенклатура)";
	КурсыВалют = Новый Соответствие;
	Валюта = Справочники.Валюты.Выбрать();
	Пока Валюта.Следующий() Цикл
		Структура = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДата, Новый Структура("Валюта", Валюта.Ссылка));
		Структура.Кратность = ?(Структура.Кратность = 0, 1, Структура.Кратность);
		КурсыВалют.Вставить(Валюта.Ссылка, Структура);
	КонецЦикла;
	ВалютаКПК = ПараметрыАгента.ВалютаКПК;
	СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДата, Новый Структура("Валюта", ВалютаКПК));
	
	ТипЦен = ПараметрыАгента.ТипЦенПоУмолчанию;
	ТипЦенКод = УникИдентификатор(ТипЦен);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаСреза", ТекДата);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Если Конфигурация = "БухКазахстан" Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл                                     
		
		Структура = КурсыВалют.Получить(Выборка.Валюта);
		ТекЦена = ОкруглитьЦену(Выборка.Цена, ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);
		Если ВалютаКПК <> Выборка.Валюта Тогда
			Структура = КурсыВалют.Получить(Выборка.Валюта);
			ТекЦена = ПересчитатьИзВалютыВВалюту(ТекЦена, Выборка.Валюта, ВалютаКПК,
				Структура.Курс, СтруктураВалютаКПК.Курс, Структура.Кратность, СтруктураВалютаКПК.Кратность);
			КонецЕсли;
			
		Если Не ТипЦен.ЦенаВключаетНДС Тогда
			ТекЦена = Окр(ТекЦена * (1 + ?(ЗначениеЗаполнено(Выборка.Номенклатура.СтавкаНДС), ПолучитьСтавкуНДС(Выборка.Номенклатура.СтавкаНДС), 0) / 100), 2);
		КонецЕсли;
		
		Если ТекЦена = 0 Тогда Продолжить; КонецЕсли;
		Ответ = Ответ + УникИдентификатор(Выборка.Номенклатура) + Таб + СуммаВСтроку(ТекЦена) + РазделительСтрок;
		Счетчик = Счетчик + 1;	
		Если Счетчик % 50 = 0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
				ДобавитьОшибку("Ошибка выгрузки цен");
				Возврат Ложь;
			КонецЕсли;
			Ответ = "";
		КонецЕсли;
	КонецЦикла;
	
	Ответ = Ответ + РазделительСтрок;
	Если НЕ ПорцияОбмена(Адрес, Ответ , "Цены " + ТекстОтвета + " выгружены " + Счетчик + " записей", "Ошибка выгрузки цен контрагента") Тогда
		ДобавитьОшибку("Ошибка выгрузки цен контрагента");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СерверПослатьОтвет(Адрес, РазделительСтрок, 1); //передаем пустую строку	
	
КонецФункции

// Выгружает "быстрые остатки" после загрузки документов
// Параметры 
//	Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьБыстрыеОстатки(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"OK","Выгружаются быстрые остатки") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблНоменклатура = Новый ТаблицаЗначений;
	ПолучитьСписокНоменклатуры(0, ТаблНоменклатура);
	
	Счетчик = 0;
	Ответ = "";
	Для Каждого стрНоменклатура Из ТаблНоменклатура Цикл
			УнКодТовара = УникИдентификатор(стрНоменклатура.Номенклатура);
		Если Конфигурация = "БухБеларусь" И стрНоменклатура.Партия <> "" Тогда
			УнКодТовара = УнКодТовара + "#" + УникИдентификатор(стрНоменклатура.Партия);
		КонецЕсли;
		УнКодСклада = УникИдентификатор(стрНоменклатура.Склад);
		Номенклатура = стрНоменклатура.Номенклатура;
		
		Ответ = Ответ
			+ УнКодТовара + Таб
			+ УнКодСклада + Таб
			+ КоличествоВСтроку(Окр(стрНоменклатура.Остаток))
			+ РазделительСтрок;
		
		Счетчик = Счетчик + 1;
		Если Счетчик % 50 = 0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
				ДобавитьОшибку("Ошибка выгрузки быстрых остатков");
				Возврат Ложь;
			КонецЕсли;
			Ответ = "";
		КонецЕсли;
	КонецЦикла;
	Возврат ПорцияОбмена(Адрес,Ответ,"Быстрые остатки выгружены "+Счетчик+" записей","Ошибка выгрузки быстрых остатков");
КонецФункции

// Выгружает список файлов для обновления из файла update.ini
// формат файла update.ini первая строка версия обновления, остальные - список файлов
// Параметры 
//	Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьСписокФайловДляОбновления(Адрес, Платформа)
	
	КаталогОбновления =  ПолучитьКаталог("Updates");
	Если  Платформа = "WM" Тогда
	    КаталогОбновления = КаталогОбновления + "\WM"
	ИначеЕсли Платформа = "Android" Тогда
	    КаталогОбновления = КаталогОбновления + "\Android"
	ИначеЕсли Платформа = "HTML" Тогда
	    КаталогОбновления = КаталогОбновления + "\HTML"
	КонецЕсли;
	Файл=Новый Файл(КаталогОбновления);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(КаталогОбновления); 
	КонецЕсли;
	ИмяФайла=КаталогОбновления +"\update.ini";
	Ответ="OK"+РазделительСтрок;
	//проверить наличие файла
	Файл=Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок+РазделительСтрок,1);
	КонецЕсли;
	
	ФайлОбновить = Новый ЧтениеТекста(ИмяФайла);
	//проверить содержимое файла (пустой или только одна строка)
	Стр=ФайлОбновить.ПрочитатьСтроку();
	Если Стр=Неопределено Тогда
		Возврат СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок+РазделительСтрок,1);
	КонецЕсли;
	Попытка
		Версия =  Число(Стр);
    Исключение
		Возврат СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок+РазделительСтрок,1);
	КонецПопытки;
	Ответ = Ответ + Стр + РазделительСтрок;
	//выгружаем данные файла
	Пока Истина Цикл
		Стр=ФайлОбновить.ПрочитатьСтроку();
		Если Стр=Неопределено Тогда Прервать; КонецЕсли;
		Если ПустаяСтрока(Стр) Тогда Прервать; КонецЕсли;
		
		ИмяОбновляемогоФайла = КаталогОбновления+"\"+Стр;
		ОбнФайл=Новый Файл(ИмяОбновляемогоФайла);
		Если ОбнФайл.Существует() Тогда
			Ответ = Ответ + Стр + РазделительСтрок; 
		КонецЕсли;
	КонецЦикла;	
	
	Возврат СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,1);
КонецФункции

//Выгружает доп. реквизиты
// Параметры
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьДопРеквизиты(Адрес)
	Если НЕ ПорцияОбмена(Адрес, "Requisites", "Выгружаются доп. реквизиты...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Сч = 0;
	Ответ = "";
	
	ДокументКПК = Новый Соответствие;
	ДокументКПК.Вставить("12", ПараметрыАгента.РазрешитьПродажу);
	ДокументКПК.Вставить("13", ПараметрыАгента.РазрешитьПродажу);
	ДокументКПК.Вставить("14", ПараметрыАгента.РазрешитьЗаявку);
	ДокументКПК.Вставить("15", ПараметрыАгента.РазрешитьЗаявку);
	ДокументКПК.Вставить("16", ПараметрыАгента.РазрешитьПокупку);
	ДокументКПК.Вставить("17", ПараметрыАгента.РазрешитьПокупку);
	ДокументКПК.Вставить("18", ПараметрыАгента.РазрешитьПКО);
	ДокументКПК.Вставить("29", ПараметрыАгента.РазрешитьДобавлениеКлиентов);
	ДокументКПК.Вставить("37", ПараметрыАгента.РазрешитьИнвентаризацию);
	ДокументКПК.Вставить("38", ПараметрыАгента.РазрешитьИнвентаризацию);
	
	Документ1С = Новый Соответствие;
	Документ1С.Вставить("12", ПараметрыАгента.ТипСоздаваемогоДокумента);
	Документ1С.Вставить("13", ПараметрыАгента.ТипСоздаваемогоДокумента);
	Документ1С.Вставить("14", ПараметрыАгента.ТипСоздаваемогоДокументаЗаявка);
	Документ1С.Вставить("15", ПараметрыАгента.ТипСоздаваемогоДокументаЗаявка);
	Документ1С.Вставить("16", ПараметрыАгента.ТипСоздаваемогоДокументаПокупка);
	Документ1С.Вставить("17", ПараметрыАгента.ТипСоздаваемогоДокументаПокупка);
	Документ1С.Вставить("37", ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация);
	Документ1С.Вставить("38", ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация);
	
	Табл = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ДополнительныеРеквизиты");
	Если ТипЗнч(Табл) = Тип("ТаблицаЗначений") Тогда
		Для Каждого Стр Из Табл Цикл
			Если Стр.Исп И ДокументКПК[Стр.Документ] И (Стр.ВариантДокумента = Строка(Документ1С[Стр.Документ]) Или Стр.ВариантДокумента = "") Тогда
				Ответ = Ответ 
					+ Стр.КодРеквизита + Таб 
					+ Стр.Наименование + Таб 
					+ Стр.Документ + Таб 
					+ Стр.ПолеПривязки + Таб 
					+ Стр.ТипДанных + Таб 
					+ Стр.Пометка + РазделительСтрок;
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Доп. реквизиты выгружены " + Сч + " записей","Ошибка выгрузки доп. реквизитов");
КонецФункции

//Выгружает значения доп. реквизитов
// Параметры
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьЗначенияДопРеквизитов(Адрес, МассивКонтрагентов, Организации)
	Если НЕ ПорцияОбмена(Адрес,"ReqValues","Выгружаются значения доп. реквизитов...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Сч = 0;
	Ответ = "";
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодРеквизита",	Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("КодЗначения",	Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("КодПривязки",	Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Представление",Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("ЗначениеПоУмолчанию",Новый ОписаниеТипов("Булево"));
	
	ДокументКПК = Новый Соответствие;
	ДокументКПК.Вставить("12", ПараметрыАгента.РазрешитьПродажу);
	ДокументКПК.Вставить("13", ПараметрыАгента.РазрешитьПродажу);
	ДокументКПК.Вставить("14", ПараметрыАгента.РазрешитьЗаявку);
	ДокументКПК.Вставить("15", ПараметрыАгента.РазрешитьЗаявку);
	ДокументКПК.Вставить("16", ПараметрыАгента.РазрешитьПокупку);
	ДокументКПК.Вставить("17", ПараметрыАгента.РазрешитьПокупку);
	ДокументКПК.Вставить("18", ПараметрыАгента.РазрешитьПКО);
	ДокументКПК.Вставить("29", ПараметрыАгента.РазрешитьДобавлениеКлиентов);
	ДокументКПК.Вставить("37", ПараметрыАгента.РазрешитьИнвентаризацию);
	ДокументКПК.Вставить("38", ПараметрыАгента.РазрешитьИнвентаризацию);
	
	Документ1С = Новый Соответствие;
	Документ1С.Вставить("12", ПараметрыАгента.ТипСоздаваемогоДокумента);
	Документ1С.Вставить("13", ПараметрыАгента.ТипСоздаваемогоДокумента);
	Документ1С.Вставить("14", ПараметрыАгента.ТипСоздаваемогоДокументаЗаявка);
	Документ1С.Вставить("15", ПараметрыАгента.ТипСоздаваемогоДокументаЗаявка);
	Документ1С.Вставить("16", ПараметрыАгента.ТипСоздаваемогоДокументаПокупка);
	Документ1С.Вставить("17", ПараметрыАгента.ТипСоздаваемогоДокументаПокупка);
	Документ1С.Вставить("37", ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация);
	Документ1С.Вставить("38", ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация);
	
	Табл = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ДополнительныеРеквизиты");
	Если ТипЗнч(Табл) = Тип("ТаблицаЗначений") Тогда
		Для Каждого Стр Из Табл Цикл
			Если Стр.Исп И Стр.ТипДанных = "0" И ДокументКПК[Стр.Документ]
				И (Стр.ВариантДокумента = Строка(Документ1С[Стр.Документ]) Или Стр.ВариантДокумента = "") Тогда
				Попытка
					Выполнить(Стр.Текст);
				Исключение
					СтрОшибка = "При заполнении значений дополнительного реквизита " + СокрЛП(стр.Наименование) + " произошла ошибка: " + ОписаниеОшибки();
					ДобавитьВЛогФайл(СтрОшибка, ПараметрыАгента.Агент, , СтатусСообщения.Важное);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Для Каждого Стр Из ТЗ Цикл
		Сч = Сч + 1;
		Ответ = Ответ
			+ Стр.КодЗначения + Таб 
			+ Стр.КодРеквизита + Таб 
			+ Стр.КодПривязки + Таб 
			+ Стр.Представление + Таб
			+ ?(Стр.ЗначениеПоУмолчанию, "1", "0") + РазделительСтрок;
		Если Сч % 100 = 0 Тогда
			Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда
				ДобавитьОшибку("Ошибка выгрузки значений реквизитов");
				Возврат Ложь;
			КонецЕсли;
			Ответ = "";
		КонецЕсли;
	КонецЦикла;
	
    Возврат ПорцияОбмена(Адрес, Ответ, "Значения доп. реквизитов выгружены " + Сч + " записей", "Ошибка выгрузки значений доп. реквизитов");
КонецФункции

//Выгружает значения доп. реквизитов
// Параметры
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьДокументыОснования(Адрес, Организации, МассивКонтрагентов, тзАдресаДляТТ, тзДоговоры, МВТДолги)
	Если НЕ ПорцияОбмена(Адрес,"DocReasons","Выгружаются документы основания...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик=0; Ответ="";
	НайденныеСтроки = Новый Массив();
	Если ПараметрыАгента.РазрешитьПКО И ВестиРасчетыПоДокументам Тогда
		ТекДата = КонецДня(ТекущаяДата());
		ЕстьТТпоАдресам = (тзАдресаДляТТ <> Неопределено);  //точки НЕ нужны
		//ТекстЗапроса =
		//"ВЫБРАТЬ
		//|	Долги.Организация,
		//|	Долги.Субконто1 КАК Контрагент,
		//|	Долги.Субконто2 КАК Договор,
		//|	ЕСТЬNULL(Долги.Субконто2.УстановленСрокОплаты, ЛОЖЬ) КАК УстановленСрокОплаты,
		//|	ЕСТЬNULL(Долги.Субконто2.СрокОплаты, 0) КАК СрокОплаты,
		//|	ЕСТЬNULL(Долги.Субконто3, Долги.Субконто2) КАК Основание,
		//|	НАЧАЛОПЕРИОДА(Долги.Субконто3.Дата, ДЕНЬ) КАК ОснованиеДата,
		//|	ЕСТЬNULL(Долги.Субконто3.Номер, Долги.Субконто2.Код) КАК ОснованиеНомер,
		//|	Долги.СуммаРазвернутыйОстатокДт - Долги.СуммаРазвернутыйОстатокКт КАК Долг
		//|ИЗ
		//|	РегистрБухгалтерии." + РегБух + ".Остатки(
		//|			&Дата,
		//|			НЕ Счет.Забалансовый
		//|				И НЕ Счет В ИЕРАРХИИ (&ИсключенныеСчета),
		//|			&ВидыСубконтоКД,
		//|			Субконто1 В (&Контрагенты)
		//|				И Субконто2.ВидДоговора В (&ВидыДоговоров)
		//|				И Организация В (&Организации)) КАК Долги";		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Долги.Организация,
		|	Долги.Контрагент КАК Контрагент,
		|	Долги.Договор КАК Договор,
		|	Долги.Документ КАК Основание,
		|	Долги.Документ.Дата КАК ОснованиеДата,
		|	ЕСТЬNULL(Долги.Документ.Номер, Долги.Документ.Код) КАК ОснованиеНомер,
		|	Долги.Долг - Долги.Аванс КАК Долг,
		|	Долги.ДолгПросрочен КАК ДолгПросрочен
		|ИЗ
		|	ОстаткиДокументы КАК Долги";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = МВТДолги;
		
		Выборка = Запрос.Выполнить().Выбрать();
		ВыборкаДоговорУникИД = "";
	 
		КоэффПересчета = 1;
		Если ПараметрыАгента.ВалютаКПК <> мВалютаРегламентированногоУчета Тогда
			Структура = ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ТекущаяДата());
			СтруктураВалютаКПК = ПолучитьКурсВалюты(ПараметрыАгента.ВалютаКПК, ТекущаяДата());
			
			КоэффПересчета = Структура.Курс * СтруктураВалютаКПК.Кратность
			/ (?(СтруктураВалютаКПК.Курс = 0, 1, СтруктураВалютаКПК.Курс) * ?(Структура.Кратность = 0, 1, Структура.Кратность));
		КонецЕсли;
	
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Основание) Тогда
				Продолжить;
			КонецЕсли;
			
			Долг = Окр(Выборка.Долг * КоэффПересчета, 2);
			Долг = СуммаВСтроку(Долг);
			
			Красным = Ложь;
			//Если Выборка.УстановленСрокОплаты Тогда
			//	Если Истина Тогда  // ПоКалендарнымДням
			//		РазницаДатВСекундах = ТекДата - Выборка.ОснованиеДата;
			//		РазницаДней = Цел(РазницаДатВСекундах/(24 * 60 * 60));
			//	Иначе
			//		РазницаДней = ЧислоРабочихДней(Выборка.ОснованиеДата);
			//	КонецЕсли;
			//	ОсталосьДней=Выборка.СрокОплаты-РазницаДней;
			//	
			//	Красным=ОсталосьДней<0;
			//КонецЕсли;
			Красным=Выборка.ДолгПросрочен > 0;
			Основание="";
			
			Если Красным Тогда 
				Основание="<font color=""Red"">"; 
			КонецЕсли;
			Основание = Основание + УбратьСпецСимволы(Выборка.Основание.Метаданные().Представление() + " "
				+ Выборка.ОснованиеНомер+" от "+ Формат(Выборка.ОснованиеДата,"ДФ=dd.MM.yyyy"));
			Если Красным Тогда 
				Основание=Основание+"</font>"; 
			КонецЕсли;
			Основание =УбратьСпецСимволы(Основание);
			
			КонтрагентКод="";
			СоздаватьТТпоАдресам = Ложь;
			Если ЕстьТТпоАдресам Тогда      //ведём ТТ по Адресам
				Отбор = Новый Структура();
				Отбор.Вставить("Контрагент", Выборка.Контрагент);
				НайденныеСтроки = тзАдресаДляТТ.НайтиСтроки(Отбор);
				СоздаватьТТпоАдресам = (НайденныеСтроки.Количество()>1); //Несколько ТТ
			КонецЕсли; 
			
			Если СоздаватьТТпоАдресам Тогда //нужны ТТ поАдресам
				//добавить группу
				
				ОрганизацияКод = СокрЛП(Выборка.Организация.Код);
				КонтрагентКод = СокрЛП(Выборка.Контрагент.Код);
				ОснованиеКод = УникИдентификатор(Выборка.Основание) + "_" + УникИдентификатор(Выборка.Договор);
				ВыборкаДоговорУникИД = УникИдентификатор(Выборка.Договор);
				
				Ответ = Ответ +
				УникИдентификатор(Выборка.Основание) + "_" + УникИдентификатор(Выборка.Договор) + Таб +
				"18" + Таб +
				Основание + Таб +
				СокрЛП(Выборка.Организация.Код) + Таб +
				КонтрагентКод + Таб +
				ВыборкаДоговорУникИД + Таб +
				//ОснованиеКомментарий + Таб +
				"" + Таб +
				Долг + Таб +
				"" + Таб+
				ЦелоеВСтроку(Счетчик) + РазделительСтрок;			
				Счетчик = Счетчик + 1;
				
				Для каждого строка Из НайденныеСтроки Цикл
					
					Ответ = Ответ +
					ОснованиеКод + Таб +
					"18" + Таб +
					Основание + Таб +
					ОрганизацияКод + Таб+
					//код составим из кода контрагента и кода адреса
					УпаковатьКодКонтрагентаИКодАдреса(КонтрагентКод,строка.АдресКод) + Таб +
					ВыборкаДоговорУникИД + Таб +
					//ОснованиеКомментарий + Таб +
					"" + Таб +
					Долг + Таб +
					"" + Таб +
					ЦелоеВСтроку(Счетчик) + РазделительСтрок;			
					Счетчик = Счетчик + 1;
					Если Счетчик % 50 = 0 Тогда
						Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
							ДобавитьОшибку("Ошибка выгрузки документов оснований");
							Возврат Ложь;
						КонецЕсли;
						Ответ = "";
					КонецЕсли;
				КонецЦикла;
			Иначе				
				Если ЕстьТТпоАдресам И НайденныеСтроки.Количество() > 0 Тогда
					
					строка = НайденныеСтроки[0];
					
					Ответ=Ответ+
					УникИдентификатор(Выборка.Основание) + "_" + УникИдентификатор(Выборка.Договор) + Таб +
					"18"+Таб+
					Основание+Таб+
					СокрЛП(Выборка.Организация.Код)+Таб+
					//код составим из кода контрагента и кода адреса
					УпаковатьКодКонтрагентаИКодАдреса(СокрЛП(Выборка.Контрагент.Код),строка.АдресКод)+Таб+
					УникИдентификатор(Выборка.Договор)+Таб+
					""+Таб+
					Долг+Таб+
					""+Таб+
					ЦелоеВСтроку(Счетчик)+РазделительСтрок;			
					Счетчик=Счетчик+1;
					
				Иначе //ТТ по адресам НЕ ведутся Добавим просто контрагента
					Ответ=Ответ+
					УникИдентификатор(Выборка.Основание) + "_" + УникИдентификатор(Выборка.Договор) + Таб +
					"18"+Таб+
					Основание+Таб+
					СокрЛП(Выборка.Организация.Код)+Таб+
					СокрЛП(Выборка.Контрагент.Код)+Таб+
					УникИдентификатор(Выборка.Договор)+Таб+
					""+Таб+
					Долг+Таб+
					""+Таб+
					ЦелоеВСтроку(Счетчик)+РазделительСтрок;			
					Счетчик=Счетчик+1;
				КонецЕсли			
			КонецЕсли;				
			
			Если Счетчик%50=0 Тогда
				Если НЕ СерверПослатьОтвет(Адрес,Ответ,0) Тогда
					ДобавитьОшибку("Ошибка выгрузки документов оснований");
					Возврат Ложь;
				КонецЕсли;
				Ответ="";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПорцияОбмена(Адрес, Ответ, "Документы основания выгружены " + Счетчик + " записей", "Ошибка выгрузки документов оснований");
КонецФункции

// Определяет адреса доставки контрагентов
// Параметры:
// 		спКонтрагентов - Массив или СписокЗначений, содержит контрагентов, для которых определять адреса
// Возвращаемое значение:
// 		ТаблицаЗначений с колонками:
// 			КонтрагентКод - Строка, код контрагента
// 			Адрес - Строка, адрес контрагента
// 			Контрагент - ссылка на элем. спр. Контрагенты, контрагент
// 			АдресКод - Строка, код данного вида адреса
Функция  ПолучитьАдресаТТ(спКонтрагентов);
	Если СпособОрганизацииТТ = 0 Тогда  //по холдингам
		Возврат Неопределено;  //точки НЕ нужны
	КонецЕсли; 
	Если (АдресаДляТТ.Количество() < 2) Тогда //если выбран только один адрес для торг.точек, то НЕ разбиваем контрагентов на ТТ 
		Возврат Неопределено;  //точки НЕ нужны
	КонецЕсли;  
	
	//получим все адреса ТТ для нужных нам контрагентов
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект.Код КАК КонтрагентКод,
	|	КонтактнаяИнформация.Представление КАК Адрес,
	|	КонтактнаяИнформация.Объект КАК Контрагент,
	|	КонтактнаяИнформация.Вид.Код КАК АдресКод
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В(&спКонтрагентов)
	|	И КонтактнаяИнформация.Вид В(&АдресаДляТТ)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Запрос.УстановитьПараметр("спКонтрагентов", спКонтрагентов);
	Запрос.УстановитьПараметр("АдресаДляТТ", АдресаДляТТ.ВыгрузитьКолонку("АдресДляТТ"));
	
	тзАдресаДляТТ = Запрос.Выполнить().Выгрузить();
	возврат тзАдресаДляТТ;

КонецФункции // ПолучитьАдресаТТ()

// Определяет перечень типов цен, которые необходимо выгрузить на КПК
// Параметры:
// 		тзДоговоры - ТаблицаЗначений, содержит выгружаемые на КПК договоры. Содержит колонку
// 			ТипЦен - ссылка на элем. спр. ТипыЦенНоменклатуры, тип цен, применяемый для данного договора
// Возвращаемое значение:
// 		ТаблицаЗначений, содержит колонку ТипЦен
Функция ПолучитьТаблицуТиповЦен(тзДоговоры)
    тзТиповЦен = Неопределено;
	
	Если ПараметрыАгента.ВыгружатьТипыЦенИзДоговоров Тогда
		тзТиповЦен=Новый ТаблицаЗначений; //получим все типы цен
		тзТиповЦен = тзДоговоры.Скопировать(,"ТипЦен");
	Иначе
		ТЗ = ПрочитатьИзРегистраСохраненныеНастройки(ПараметрыАгента.Агент,"ДоступныеТипыЦен"); //это Табл значений
		Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
			ТЗ = Новый ТаблицаЗначений;
		КонецЕсли;
		Если ТЗ.Колонки.Найти("ТипЦен")= Неопределено Тогда
			ТЗ.Колонки.Добавить("ТипЦен", Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры"));
		КонецЕсли; 	 
		тзТиповЦен = ТЗ.Скопировать(ТЗ.НайтиСтроки(новый структура("Пометка", Истина)), "ТипЦен");
	КонецЕсли;
	
	стр = тзТиповЦен.Добавить();
	стр.ТипЦен = ПараметрыАгента.ТипЦенПоУмолчанию;
	тзТиповЦен.Свернуть("ТипЦен","");
	возврат тзТиповЦен;
		
КонецФункции // ПолучитьТаблицуТиповЦен()

Функция ВыгрузитьИнформациюОФотографиях(Адрес, спКонтрагентов, спНоменклатура, спЗадания)
	ДобавитьСообщение("Выгружается информация о новых изображениях...");
	
	КаталогФотоНаУстройстве = ПолучитьКаталог("Agents\"+СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код)+"\Photo\Device");
	КаталогНовыеФото = ПолучитьКаталог("Agents\"+СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код)+"\Photo\Device\New");
	КаталогУдалитьФото = ПолучитьКаталог("Agents\"+СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код)+"\Photo\Device\Delete");
	
	УдалитьФайлы(КаталогНовыеФото + "\", "*.*");
	УдалитьФайлы(КаталогУдалитьФото + "\", "*.*");
	
	ФотоНаУстройстве = Новый ТаблицаЗначений;
	ФотоНаУстройстве.Колонки.Добавить("ИмяФайла",Новый ОписаниеТипов("Строка"));
	ФотоНаУстройстве.Колонки.Добавить("РасширениеФайла",Новый ОписаниеТипов("Строка"));
	ФотоНаУстройстве.Индексы.Добавить("ИмяФайла");
	НеобходимыеФото = Новый ТаблицаЗначений;
	НеобходимыеФото.Колонки.Добавить("ИмяФайла",Новый ОписаниеТипов("Строка"));
	НеобходимыеФото.Индексы.Добавить("ИмяФайла");
	Файлы = НайтиФайлы(КаталогФотоНаУстройстве + "\", "*.*");
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ЭтоКаталог() Тогда Продолжить; КонецЕсли;
		
		НовСтр = ФотоНаУстройстве.Добавить();
		НовСтр.ИмяФайла = Файл.ИмяБезРасширения;
		НовСтр.РасширениеФайла = Файл.Расширение;
	КонецЦикла;
	
	КолвоФото = 0;
	Если Конфигурация = "БухКазахстан" Тогда
		ОбщийСписок = Новый Массив;
		Колво = спКонтрагентов.Количество();
		Для Н = 0 По Колво - 1 Цикл
			ОбщийСписок.Добавить(спКонтрагентов[Н]);
		КонецЦикла;
		Колво = спНоменклатура.Количество();
		Для Н = 0 По Колво - 1 Цикл
			Попытка
				ОбщийСписок.Добавить(спНоменклатура[Н]);
			Исключение
				Сообщить("" + ОписаниеОшибки() + " Строка " + Н);
			КонецПопытки;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ Ссылка ИЗ Справочник.ХранилищеДополнительнойИнформации
		|ГДЕ ВидДанных = &Изображение И Объект В(&ОбщийСписок) И ПометкаУдаления = ЛОЖЬ
		|СГРУППИРОВАТЬ ПО Ссылка";
		Запрос.Параметры.Вставить("ОбщийСписок",ОбщийСписок);
		Запрос.Параметры.Вставить("Изображение", Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЕстьВерсияДанных = ЕстьВерсияДанных();
		Если НЕ ЕстьВерсияДанных Тогда
			СисИнфо = Новый  СистемнаяИнформация;
			Версия1С = СисИнфо.ВерсияПриложения;
			платформа81 = ?(Лев(Версия1С, 3) = "8.1", Истина, Ложь);		
			Если платформа81 Тогда
				ДобавитьСообщение("Платформа не поддерживает реквизит ВерсияДанных. " 
				+ "Изменение фотографий товаров и клиентов не отслеживается." + РазделительСтрок 
				+ "Необходимо обновление до 1С:Предприятие 8.2");
			Иначе
				ДобавитьСообщение(
				"Конфигурация запущена в режиме совместимости 8.1, в этом режиме не поддерживается реквизит ВерсияДанных.
				|Изменение фотографий товаров и клиентов не отслеживается.");	
			КонецЕсли
		КонецЕсли;
		Пока Выборка.Следующий() Цикл
			Запись = Выборка.Ссылка;
			
			КодТипа = "";
			ТипЗначения = ТипЗнч(Запись.Объект);
			Если ТипЗначения = Тип("СправочникСсылка.Номенклатура") Тогда
				КодТипа = "4";
			ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Контрагенты") Тогда
				КодТипа = "1";
			КонецЕсли;
			
			ИмяФайла = Строка(ТипЗначения);
			ИмяФайла = СтрЗаменить(ИмяФайла,"Справочник ссылка: ", "");
			УникИд = Строка(Запись.УникальныйИдентификатор());
			Если ЕстьВерсияДанных Тогда 
				УникИд = УникИд + ЗаменитьНедопустимыеСимволыВВерсииДанных(Запись.ВерсияДанных); 
			КонецЕсли;
			ИмяФайла = ИмяФайла+"-"+УникИд+"_"+Строка(Запись.Объект.УникальныйИдентификатор())+"_"+КодТипа;
			НовСтр = НеобходимыеФото.Добавить();
			НовСтр.ИмяФайла = ИмяФайла;
			
			Стр = ФотоНаУстройстве.Найти(ИмяФайла, "ИмяФайла");
			Если Стр = Неопределено Тогда
				Картинка = Запись.Хранилище.Получить();
				Если ТипЗнч(картинка) = Тип("Картинка") Тогда
					Попытка
						расширение = картинка.Формат();
					Исключение
						расширение = ФорматКартинки.НеизвестныйФормат;
					КонецПопытки;
					Если расширение = ФорматКартинки.НеизвестныйФормат Тогда 
					Иначе	
						Картинка.Записать(КаталогНовыеФото+"\"+ИмяФайла+"."+Строка(расширение));
						КолвоФото = КолвоФото + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  // казах
	
	Для Каждого Событие Из спЗадания Цикл
		Для Каждого Картинка Из Событие.ТаблицаИзображений Цикл
			ФС = Новый Файл(Картинка.Путь);
			Если ФС.Существует() Тогда
				ИмяФайла = "Сотытие-" + Строка(Событие.УникальныйИдентификатор()) + "_" + Картинка.НомерСтроки + "_34";
				Стр = ФотоНаУстройстве.Найти(ИмяФайла, "ИмяФайла");
				Если Стр = Неопределено Тогда
					Если ФС.Расширение <> ФорматКартинки.НеизвестныйФормат Тогда 
						НовСтр = НеобходимыеФото.Добавить();
						НовСтр.ИмяФайла = ИмяФайла;
						КопироватьФайл(Картинка.Путь, КаталогНовыеФото + "\" + ИмяФайла + Строка(ФС.Расширение));
						КолвоФото = КолвоФото + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	КолвоФотоУдалить = 0;
	Для Каждого Стр Из ФотоНаУстройстве Цикл
		Если НеобходимыеФото.Найти(Стр.ИмяФайла, "ИмяФайла") <> Неопределено Тогда 
			Продолжить; 
		КонецЕсли;		
		КопироватьФайл(
			КаталогФотоНаУстройстве + "\" + Стр.ИмяФайла + Стр.РасширениеФайла,
			КаталогУдалитьФото + "\" + Стр.ИмяФайла + Стр.РасширениеФайла);
		КолвоФотоУдалить=КолвоФотоУдалить+1;
	КонецЦикла;
	
	Если КолвоФото + КолвоФотоУдалить > 0 тогда
		СерверПослатьОтвет(Адрес,
			"NewPhoto" + РазделительСтрок 
			+ "Необходимо " 
				+ ?(КолвоФото > 0, "загрузить новые " + КолвоФото + " фото", "") 
				+ ?(КолвоФото > 0 И КолвоФотоУдалить > 0, " и ", "") 
				+ ?(КолвоФотоУдалить > 0, "удалить старые "+КолвоФотоУдалить+" фото", "") + РазделительСтрок 
			+ РазделительСтрок, 0);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Реагирует на запрос полной загрузки
// Параметры 
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьДанные(Адрес, Платформа)
	ДобавитьСообщение("Выполняется запрос 'Полная загрузка'");
	Если ПараметрыАгента.ТипЦенПоУмолчанию.Пустая() Тогда
		Ответ="Не задан тип цен по-умолчанию";
		ДобавитьОшибку(Ответ);
		СерверПослатьОтвет(Адрес, Ответ + РазделительСтрок, 1);
		Возврат Ложь;
	КонецЕсли;
	
	// Применяем настройку агента ВалютаКПК     
	ПараметрыАгента.ВалютаКПК = ПараметрыАгента.ВалютаНастройка;
	ЗаписатьВРегистрСохраненныеНастройки(ПараметрыАгента.Агент, ПараметрыАгента.ВалютаНастройка, "ВалютаКПК");
	
	//создать таблицу номенклатуры	
	тзНоменклатура = Новый ТаблицаЗначений;
	тзОстатки = Новый ТаблицаЗначений;
	ПолучитьСписокНоменклатуры(тзНоменклатура, тзОстатки);
	тзОстатки.Индексы.Добавить("Номенклатура");
	спНоменклатура = тзНоменклатура.ВыгрузитьКолонку("Номенклатура"); //список товаров
	
// подготовить таблицу организаций
    тзОрганизации = ПрочитатьОрганизации(ПараметрыАгента.Агент); 
	Если (ТипЗнч(тзОрганизации) <> Тип("ТаблицаЗначений")) или (тзОрганизации.Количество()=0) Тогда
		ДобавитьСообщение("Не заданы организации.Будут выгружены все ");
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Организации.Ссылка КАК Организация,
		               |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузоотправитель
		               |ИЗ
		               |	Справочник.Организации КАК Организации";
		
		тзОрганизации = Запрос.Выполнить().Выгрузить();
	КонецЕсли; 
	
	//подготовить таблицу контрагентов
	МВТДолги = Неопределено;
	тзКонтрагенты = ПолучитьТаблицуКонтрагентов(
		ПараметрыАгента.Агент,
		ПараметрыАгента.ЗапретитьИзменятьТипЦен,
		ПараметрыАгента.ВыделятьЦветомКонтрагентов, 
		Ложь, МВТДолги);
	Если тзКонтрагенты.Количество() = 0 Тогда
		Ответ="Контрагенты НЕ выгружены. Проверьте условия отбора. ";
		ДобавитьОшибку(Ответ);
		СерверПослатьОтвет(Адрес, Ответ + РазделительСтрок, 1);
		Возврат Ложь;
	КонецЕсли; 
	
	Ответ="OK"+РазделительСтрок;
	Если НЕ СерверПослатьОтвет(Адрес, Ответ, 0) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	//служебные данные	
	Если НЕ ВыгрузитьСлужебныеДанные(Адрес) Тогда 
		Возврат Ложь;
	КонецЕсли;
	//служебные данные	
	Если НЕ ВыгрузитьНастройкиАгента(Адрес) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		Если НЕ ВыгрузитьНастройкиКолонокДокументов(Адрес) Тогда 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Список номенклатуры
	Если НЕ ВыгрузитьНоменклатуру(Адрес, тзНоменклатура) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Если НЕ ВыгрузитьОстаткиНоменклатуры(Адрес, тзОстатки) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Группы номенклатуры (папки) 
	Если НЕ ВыгрузитьГруппыНоменклатуры(Адрес, тзНоменклатура) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Состав групп номенклатуры
	Если НЕ ВыгрузитьСоставГруппНоменклатуры(Адрес, тзНоменклатура) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		Если НЕ ВыгрузитьСклады(Адрес) Тогда 
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;
	
	спКонтрагентов = тзКонтрагенты.ВыгрузитьКолонку("Контрагент"); //список контрагентов
	
	//подготовить таблицу адресов торговых точек
	тзАдресаДляТТ = ПолучитьАдресаТТ(спКонтрагентов);
	
	//подготовить таблицу Юр.лиц
	тзЮрЛица = Новый ТаблицаЗначений;
	тзЮрЛица.Колонки.Добавить("Код");
	тзЮрЛица.Колонки.Добавить("Наименование");
	
	// Контрагенты
	Если НЕ ВыгрузитьКонтрагентов(Адрес, тзКонтрагенты, тзАдресаДляТТ, тзЮрЛица) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	// Группы контрагентов (папки) 
	//Если НЕ ВыгрузитьГруппыКонтрагентов(Адрес,тзЮрЛица) Тогда 
	//	Возврат Ложь; 
	//КонецЕсли;
	
	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		Если НЕ ВыгрузитьСегментыКонтрагентов(Адрес,тзКонтрагенты) Тогда
			Возврат Ложь; 
		КонецЕсли;
		Если НЕ ВыгрузитьНазначениеСегментовКонтрагентов(Адрес, тзКонтрагенты) Тогда
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;
	
	// подготовить таблицу договоров
    тзДоговоры = ПолучитьТаблицуДоговоров(
		спКонтрагентов,
		тзОрганизации, 
		ПараметрыАгента.ТипЦенПоУмолчанию, 
		ПараметрыАгента.ТипСоздаваемогоДокументаПокупка, 
		ПараметрыАгента.ТорговляСКолес, МВТДолги);
	
	// Договора   
	Если НЕ ВыгрузитьДоговоры(Адрес,тзДоговоры,тзАдресаДляТТ,Платформа) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	// Скидки
	Если НЕ ВыгрузитьСкидки(Адрес) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//подготовить таблицу типов цен	
	тзТиповЦен = ПолучитьТаблицуТиповЦен(тзДоговоры);	
	
	//Типы Цен
	Если НЕ ВыгрузитьТипыЦен(Адрес,тзТиповЦен) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Цены
	Если НЕ ВыгрузитьЦены(Адрес,тзНоменклатура,тзТиповЦен) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Единицы измерения 
	Если НЕ ВыгрузитьЕдиницы(Адрес,тзНоменклатура) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Агенты    
	Если НЕ ВыгрузитьАгентов(Адрес) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Организации
	Если НЕ ВыгрузитьОрганизации(Адрес,тзОрганизации) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	//Маршруты
	//03.03.14 Если в настроках агента снят флажок "Выгружать задания" то необходимо выгрузить 
	//начало секции заданий согласно протокола чтобы очистить список заданий на КПК
	Если ПараметрыАгента.ВыгружатьМаршруты Тогда
		Если НЕ ВыгрузитьМаршруты(Адрес, Платформа, ПараметрыАгента.ВыгружатьМаршруты, Истина, спКонтрагентов) Тогда 
			Возврат Ложь; 
		КонецЕсли;
		//Маршруты за сегодня
		Если ЗаданияВозможны Тогда
			ТаблМаршрутов = ПолучитьПланПосещений(ПараметрыАгента.Агент, ТекущаяДата(), Истина, спКонтрагентов);
		Иначе
			ТаблМаршрутов = Новый ТаблицаЗначений;
			ТаблМаршрутов.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		КонецЕсли;
	КонецЕсли;
	
	//Подсказки продаж
	Если ПараметрыАгента.ВыгружатьПодсказкиПродаж Тогда
		Если НЕ ВыгрузитьПодсказкиПродажПриПолнойЗагрузке(Адрес, тзКонтрагенты, тзНоменклатура) Тогда 
			Возврат Ложь; 
		КонецЕсли;
	Иначе
		Если ПараметрыАгента.ВыгружатьМаршруты Тогда
			Если НЕ ВыгрузитьПодсказкиПродажПриПолнойЗагрузке(Адрес, ТаблМаршрутов, тзНоменклатура) Тогда 
				Возврат Ложь; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//СвойстваОбъектов (КаналыСбыта)
	Если НЕ ВыгрузитьСвойстваОбъектов(Адрес, тзНоменклатура, спКонтрагентов, тзАдресаДляТТ, ПараметрыАгента.ВыгружатьКаналыСбыта) Тогда 
		Возврат Ложь; 
	КонецЕсли;

	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		ВыгрузитьПечатныеФормы(Адрес);
	КонецЕсли;
	
	//сообщения	
	Если ПараметрыАгента.ВыгружатьСообщения Тогда
		Если НЕ ВыгрузитьСообщения(Адрес,"1,2,3", тзНоменклатура, спКонтрагентов, "Messages") Тогда 
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;

	//формы
	Если НЕ ВыгрузитьФормы(Адрес) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Если (Платформа="Android") ИЛИ (Платформа="HTML") Тогда
		Если НЕ ВыгрузитьДопРеквизиты(Адрес) Тогда 
			Возврат Ложь; 
		КонецЕсли;
		
		Если НЕ ВыгрузитьЗначенияДопРеквизитов(Адрес, спКонтрагентов, тзОрганизации.ВыгрузитьКолонку("Организация")) Тогда 
			Возврат Ложь; 
		КонецЕсли;
		
		Если НЕ ВыгрузитьДокументыОснования(Адрес,тзОрганизации.ВыгрузитьКолонку("Организация"), спКонтрагентов, тзАдресаДляТТ, тзДоговоры, МВТДолги) Тогда 
			Возврат Ложь; 
		КонецЕсли;
		
		спЗадания = новый Массив;
		Если ТаблМаршрутов <> Неопределено Тогда
			спЗадания = ТаблМаршрутов.ВыгрузитьКолонку("Событие");
		КонецЕсли;
		Если НЕ ВыгрузитьИнформациюОФотографиях(Адрес, спКонтрагентов, спНоменклатура, спЗадания) Тогда 
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СерверПослатьОтвет(Адрес, РазделительСтрок, 1) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Реагирует на запрос на обновление программы.
// Файл должен лежать в папке КаталогЛогФайлов\Update
// Адрес - идентификатор сессии обмена
// ИмяФайла - файл который нужно передать в КПК. Файл должен лежать в папке КаталогЛогФайлов\Update
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьФайл(Адрес, ИмяФайла, Платформа)
	Если НЕ ПорцияОбмена(Адрес,"OK","Отправляется файл "+ИмяФайла+"...") Тогда
		Возврат Ложь;
	КонецЕсли;
	//Запрет выгрузки файлов из папки кроме UpDates
	ИмяФайла= СтрЗаменить(ИмяФайла,":","");
	ИмяФайла= СтрЗаменить(ИмяФайла,"\","");
	ИмяФайла= СтрЗаменить(ИмяФайла,"/","");
	ИмяФайла= СтрЗаменить(ИмяФайла,"..","");
	ИмяФайла= СтрЗаменить(ИмяФайла,"*","");
	ИмяФайла= СтрЗаменить(ИмяФайла,"?","");
	
	КаталогОбновления =  ПолучитьКаталог("Updates");
	Если  Платформа = "WM" Тогда
	    КаталогОбновления = КаталогОбновления + "\WM"
	ИначеЕсли Платформа = "Android" Тогда
	    КаталогОбновления = КаталогОбновления + "\Android"
	ИначеЕсли Платформа = "HTML" Тогда
	    КаталогОбновления = КаталогОбновления + "\HTML"
	КонецЕсли;
	Файл=Новый Файл(КаталогОбновления);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(КаталогОбновления); 
	КонецЕсли;

	
	Файл=КаталогОбновления+"\"+ИмяФайла;
	Если НЕ Сервер.ПослатьФайл(Адрес,Файл) Тогда
		ДобавитьВЛогФайл("Ошибка при попытке отправить файл "+Файл,ПараметрыАгента.Агент,0);
	КонецЕсли;
	СерверПослатьОтвет(Адрес,"",1);
	Возврат Истина;
КонецФункции

// Загружает GPS-координаты агента
// Параметры
// Адрес - идентификатор сессии обмена
// Запрос - Текст полученный от КПК
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ЗагрузитьКоординаты(Адрес, Запрос)
	НачСтр = 5; //тело сообщения начинается с этой строки
	ДобавитьСообщение("Загружаются GPS-координаты агента... ");
	
	//если нет данных для загрузки то выходим
	КолСтр = СтрЧислоСтрок(Запрос);
	
	Если (КолСтр < НачСтр)  Тогда
		СерверПослатьОтвет(Адрес,"OK"+РазделительСтрок,1);
		Возврат Истина;    
	КонецЕсли;
	
	//проверить каталог GPS в папке пользователя
	КодАгента = СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код);
	Кат = ПолучитьКаталог("Agents\"+КодАгента+"\GPS");
	//Если Прав(Кат,1)="\" Тогда 
	//	Кат=Лев(Кат,СтрДлина(Кат)-1); 
	//КонецЕсли;
	СоздатьКаталог(Кат); 
	
	ЧасовойПояс=ПолучитьНастройку(ПараметрыАгента.Агент,"ЧасовойПояс",99);
	ТекущаяДатаДанных = Неопределено;
		
	Текст = Новый ЗаписьТекста;
	стр = Неопределено;
	
	чтТрек = новый ЧтениеТекста();
	стрТрек = "";
	ДатаДанныхСтр = "";
		
	Для Н = НачСтр По КолСтр Цикл
		стр = СтрПолучитьСтроку(Запрос,Н);
		ДатаДанныхСтр = СтрПолучитьСтроку(СтрЗаменить(стр,Таб,РазделительСтрок),1);
		ДатаДанных = ДатаИзСтрокиСКПК(ДатаДанныхСтр);
		ДатаДанных = КонвертироватьUTCВремяВЛокальное(ДатаДанных,ЧасовойПояс);
		ДатаДанных = НачалоДня(ДатаДанных);
		//Если в выгрузке встретим другую дату то нужно писать данные в другой файл
		Если ТекущаяДатаДанных <> ДатаДанных Тогда
			Если ТекущаяДатаДанных <> ДатаПустая() Тогда
				Текст.Закрыть();
			КонецЕсли; 
			ИмяGPSФайла=Кат + "\GPS_"+СокрЛП(Формат(ДатаДанных,"ДФ=""ггггММдд"""))+".txt";
			
			Если СуществуетФайл(ИмяGPSФайла) Тогда
				чтТрек.Открыть(ИмяGPSФайла);
				стрТрек = чтТрек.Прочитать();
				чтТрек.Закрыть();						
			Иначе
				стрТрек = "";
			КонецЕсли;						
			
			Текст = Новый ЗаписьТекста(ИмяGPSФайла, КодировкаТекста.ANSI,,Истина);
			ТекущаяДатаДанных = ДатаДанных;
		КонецЕсли;
				
		Если Найти(стрТрек, ДатаДанныхСтр) = 0 Тогда
			Текст.ЗаписатьСтроку(стр);
			стрТрек = стрТрек + "
			|" + стр;
		КонецЕсли;
	КонецЦикла;  
	Текст.Закрыть();
		
	Если стр = Неопределено Тогда
	Иначе		
		стр = СтрЗаменить(стр,Таб,РазделительСтрок);
		Время	= КонвертироватьUTCВремяВЛокальное(ДатаИзСтрокиСКПК(СтрПолучитьСтроку(стр,1)), ЧасовойПояс);
		Долгота	= СтрокуВЧисло(СтрПолучитьСтроку(стр,2));
		Широта	= СтрокуВЧисло(СтрПолучитьСтроку(стр,3));
		Скорость = СтрокуВЧисло(СтрПолучитьСтроку(стр,5));
		текДата = ТекущаяДатаСуточнаяКоррекция();
		ТекВремяC = текДата - 8 * 60 * 60;
		ТекВремяПО = ТекВремяC + 16 * 60 * 60;			
		
		Если ТекВремяC <= Время И Время <= ТекВремяПО Тогда
			ОбновитьТекКоординатыАгента(КодАгента, Время, Широта, Долгота, Скорость, "GPS");
			СохранитьТекущиеКоординатыАгентовВБазу();	
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	//СерверПослатьОтвет(Адрес,"OK"+РазделительСтрок,1);
	СерверПослатьОтвет(Адрес,"OK",0);
	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
	Возврат Истина;
КонецФункции

// Загружает географические координаты контрагентов в свойство контрагента  ввиде Широта+Пробел+Долгота
// Параметры
// Адрес - идентификатор сессии обмена
// Запрос - Текст полученный от КПК
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ЗагрузитьКоординатыКонтрагентов(Адрес, ТелоЗапроса)
	НачСтр = 5;
	ДобавитьСообщение("Загружаются координаты контрагентов... ");
	КолСтр=СтрЧислоСтрок(ТелоЗапроса);
	Если  КолСтр < НачСтр  Тогда
		СерверПослатьОтвет(Адрес,"OK"+РазделительСтрок,1);
		Возврат Истина;    
	КонецЕсли;
	//ТаблКоординаты = ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"КоординатыКонтрагентов");
	//идем циклом по выгружаемым данным и задаем для Контрагентов параметр Координаты GPS
	Для Н=НачСтр По КолСтр Цикл
		стр = СтрПолучитьСтроку(ТелоЗапроса,Н);
		стр = СтрЗаменить(стр,Таб,РазделительСтрок);  
		КодКонтрагент = СокрЛП(СтрПолучитьСтроку(стр,1));
		Если ЗначениеЗаполнено(КодКонтрагент) Тогда
			Широта	= СтрЗаменить(СтрПолучитьСтроку(стр,2),",",".");
			Долгота	= СтрЗаменить(СтрПолучитьСтроку(стр,3),",",".");
			
			Если ЗначениеЗаполнено(Широта) и  ЗначениеЗаполнено(Долгота) Тогда
				Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагент);
				Если Контрагент.Пустая() Тогда
					ДобавитьСообщение(
						"Не найден контрагент с кодом "+КодКонтрагент + ", координаты (" + Широта + ", " + Долгота + ")");
				Иначе
					УстановитьКоординатыКонтрагента(Контрагент,Широта,Долгота);	
				КонецЕсли;				
			КонецЕсли; 
		КонецЕсли;	
	КонецЦикла;		
	
	СерверПослатьОтвет(Адрес,"OK",0);
	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
	//ЗаписатьВРегистрСохраненныеНастройки(МобиС,ТаблКоординаты,"КоординатыКонтрагентов");
	Возврат Истина;	
КонецФункции

//сохраняет в регистр сведений полученные координаты агентов
Процедура СохранитьТекущиеКоординатыАгентовВБазу()
//блокируем общий для обработок объект
    МобиСОбъект = МобиС.ПолучитьОбъект();
	Попытка 
		МобиСОбъект.Заблокировать();
	Исключение
		МобиСОбъект = Неопределено;
		ПодключитьОбработчикОжидания("СохранитьТекущиеКоординатыАгентовВБазу", 1, Истина); 
		Возврат;
	КонецПопытки;
	
	Если Истина Тогда
//если блокировка успешна - тогда
//считываем последние записанные в базу координаты
		таблКоординаты = ПрочитатьКоординатыАгентов();
//дополняем полученные координаты имевшимися ранее
		стрТЗ = Неопределено;	
		ТекВремяC = ТекущаяДатаСуточнаяКоррекция() - 8 * 60 * 60;
		ТекВремяПО = ТекВремяC + 16 * 60 * 60;		
		для каждого стр из таблКоординаты Цикл	    	
			Если ТекВремяC <= Стр.ДатаВремя 
				И Стр.ДатаВремя <= ТекВремяПО Тогда
				//если обрабатываемая координата корректна - +/- 8 часов от текущего времени
				стрТЗ = ТаблТекущиеКоординаты.НайтиСтроки(новый Структура("Код", стр.Код));
				Если стрТЗ.Количество() = 0 Тогда
				//если в актуальных координатах не нашли ранее сохраненную координату - её необходиом добавить
					стрТЗ = ТаблТекущиеКоординаты.Добавить();
					стрТЗ.Код = стр.Код;
					стрТЗ.ДатаВремя = стр.ДатаВремя;
					стрТЗ.Широта = стр.Широта;
					стрТЗ.Долгота = стр.Долгота;
					стрТЗ.Скорость = стр.Скорость;
					стрТЗ.Источник = стр.Источник;
				Иначе//если координата этого агента была сохранена, то надо проверить и выбрать самую свежую
					Если стрТЗ[0].ДатаВремя < стр.ДатаВремя
						ИЛИ (ТекВремяПО <= стрТЗ[0].ДатаВремя 
							ИЛИ стрТЗ[0].ДатаВремя <= ТекВремяC) Тогда
						//обрабатываемая координата новее запомненной или запомненная некорректна
						стрТЗ[0].ДатаВремя = стр.ДатаВремя;
						стрТЗ[0].Широта = стр.Широта;
						стрТЗ[0].Долгота = стр.Долгота;
						стрТЗ[0].Скорость = стр.Скорость;
						стрТЗ[0].Источник = стр.Источник;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;				
//сохраняем данные в базу
		ЗаписатьВРегистрСохраненныеНастройки(МобиС, ТаблТекущиеКоординаты, "ТекущиеКоординатыАгентов");
	КонецЕсли;
//освобождаем захваченный объект	
	МобиСОбъект.Разблокировать();
	ТаблТекущиеКоординаты.Очистить();
	МобиСОбъект = Неопределено;
КонецПроцедуры

Процедура ОбновитьТекКоординатыАгента(КодАгента, ДатаВремя, Широта, Долгота, Скорость, Источник)
	
	стрТЗ = ТаблТекущиеКоординаты.Найти(КодАгента,"Код");
	Если стрТЗ = Неопределено Тогда
		//координаты агента не зафиксировано, обновляем		
		стрТЗ = ТаблТекущиеКоординаты.Добавить();
		стрТЗ.Код = КодАгента;
		стрТЗ.ДатаВремя =датаВремя;
		стрТЗ.Широта =  Широта;
		стрТЗ.Долгота = Долгота;
		стрТЗ.Скорость = Скорость;
		стрТЗ.Источник = Источник;
	Иначе
		//координата агента есть, необходимо проверить
		//которая новее и её использовать
		Если стрТЗ.ДатаВремя > ДатаВремя Тогда
		//координата в базе свежее рассматриваемой	
		Иначе
			стрТЗ.ДатаВремя =датаВремя;
			стрТЗ.Широта =  Широта;
			стрТЗ.Долгота = Долгота;
			стрТЗ.Скорость = Скорость;
			стрТЗ.Источник = Источник;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

// Загружает текущие координат агентов
// Параметры
// Запрос - Текст полученный от КПК
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно
// сохраняем таблицу в настройках при закрытии обработки
Функция СохранитьТекущиеКоординатыАгентов(ТелоЗапроса)
//проблема
//если запущено несколько обработок то выгрузка координат в любую из запущенных затрет выгруженные ранее координаты	
//если запущено несколько обработок, то возможно что выгрузка координат в обработки из dll пройдет одновремено и в итоге будут потери координат
//
//схема следующая: 
//в обработках запоминаем пришедшые координаты и через отложенный вызов заносим их в базу 1С,
//при этом при занесении необходимо устанавливать блокировку на какой либо объект (например пользователь МобиС)
	НачСтр = 4;
	КолСтр=СтрЧислоСтрок(ТелоЗапроса);
	Если  КолСтр < НачСтр  Тогда
		Возврат Истина;    
	КонецЕсли;	
	
	текДата = ТекущаяДатаСуточнаяКоррекция();
	ТекВремяC = текДата - 8 * 60 * 60;
	ТекВремяПО = ТекВремяC + 16 * 60 * 60;			
	
	Для Н=НачСтр По КолСтр Цикл
		стр = СтрПолучитьСтроку(ТелоЗапроса,Н);
		стр = СтрЗаменить(стр,Таб,РазделительСтрок);  
		КодАгента 	= СокрЛП(СтрПолучитьСтроку(стр,1));
		
		СтрАгент=ПолучитьТаблицуАгентов().Найти(СокрЛП(КодАгента),"Код");
		Если СтрАгент=Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		ЧасовойПояс = ПолучитьНастройку(СтрАгент.Агент, "ЧасовойПояс", 99);
		
		ДатаВремя = ДатаИзСтрокиСКПК(СокрЛП(СтрПолучитьСтроку(стр,2)));
		Долгота = СтрЗаменить(СтрПолучитьСтроку(стр,3),",",".");
		Широта 	= СтрЗаменить(СтрПолучитьСтроку(стр,4),",",".");
		Скорость = СтрЗаменить(СтрПолучитьСтроку(стр,5),",",".");

		Если Долгота=0 или Широта=0 Тогда
			Продолжить;
		КонецЕсли;	
		
		датаВремя = КонвертироватьUTCВремяВЛокальное(ДатаВремя,ЧасовойПояс);
		Если ТекВремяПО <= датаВремя
				ИЛИ датаВремя <= ТекВремяC Тогда
			Продолжить;
		КонецЕсли;
		
		ОбновитьТекКоординатыАгента(КодАгента, ДатаВремя, Широта, Долгота, Скорость, "CP");
				
		// Отработаем ПоследнийОткликАгента
		ЗаписатьВРегистрСохраненныеНастройки(СтрАгент.Агент, текДата, "ПоследнийОткликАгента");
		
    КонецЦикла;	
	
	//сохранить данные - так сохранять нельзя тк будут потеряны данные, сохраненные другой обработкой 
	СохранитьТекущиеКоординатыАгентовВБазу();	
	Возврат Истина;	
КонецФункции

// Изменяет статус сообщений 
// Параметры
// Адрес - идентификатор сессии обмена
// Запрос - Текст полученный от КПК
// Возвращаемое значение Булево ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ИзменитьСтатусСообщений(Адрес,ТелоЗапроса)
	НачСтр = 5;
	ДобавитьСообщение("Загружается статус сообщений... "); 
	КолСтр=СтрЧислоСтрок(ТелоЗапроса);
	Если КолСтр < НачСтр  Тогда
		СерверПослатьОтвет(Адрес,"OK" + РазделительСтрок,1);
		Возврат Истина;    
	КонецЕсли;
	
	Блокировщик = Неопределено;
	БД = ОткрытьВнешнююБД(Блокировщик, истина);
	Если БД = Ложь Тогда
		Сообщить(ОшибкаНетДоступаКВнешнейБД, СтатусСообщения.Важное);
		СерверПослатьОтвет(Адрес,"OK" + РазделительСтрок,1);
		Возврат Истина;
	КонецЕсли;
	
	ПодгЗапрос = БДПодготовитьЗапрос(БД, "Update [messages] Set STATUS = ? Where CODE = ? AND STATUS < ?");
	
	Для Н = НачСтр По КолСтр Цикл
		стр = СтрПолучитьСтроку(ТелоЗапроса,Н);
		стр = СтрЗаменить(стр,Таб,РазделительСтрок);
		КодСообщения = ПолучитьЧислоИзСтроки(СокрЛП(СтрПолучитьСтроку(стр,1)));
		Статус       = СокрЛП(СтрПолучитьСтроку(стр,2));
		Если КодСообщения > 10000 Тогда
			КодСообщения = Цел(КодСообщения / 10000);
		КонецЕсли;
		
		БДУстановитьПараметр(ПодгЗапрос, 1, Статус);
		БДУстановитьПараметр(ПодгЗапрос, 2, КодСообщения);
		БДУстановитьПараметр(ПодгЗапрос, 3, Статус);

		БДСледующаяЗапись(ПодгЗапрос);
		БДСбросПодготовленногоЗапроса(ПодгЗапрос);
	КонецЦикла;		
	
	// удалить все строки с признаком "Удалить после прочтения" и статус >=3 (выполнено или прочитано)
	ПодгЗапрос=БДПодготовитьЗапрос(БД, "Delete From [messages] Where STATUS>=3 AND DEL=1");
	БДСледующаяЗапись(ПодгЗапрос);
	БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);
	
	ЗакрытьВнешнююБД(БД, Блокировщик);	

	СерверПослатьОтвет(Адрес,"OK" + РазделительСтрок,1);
	Возврат Истина;
КонецФункции

/////////////////////////////////////////////////
//СОЗДАНИЕ ДОКУМЕНТОВ

Процедура ОбработатьДопРеквизитыДокумента(Док, ДопРеквизитыСтрока, Документ, ВариантДокумента)
	
	стрИсключения = "";
	текстОшибки = "";
	
	//получаем таблицу настроенных дополнительных реквизитов
	ТЗДопРеквизиты = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ДополнительныеРеквизиты");
	Если ТипЗнч(ТЗДопРеквизиты) = Тип("ТаблицаЗначений") Тогда
		//выбираем используемые дополнительные реквизиты, допустимые для данного типа документа
		//по варианту документа пока не контролируем тк может быть либо тип документа, либо "все"
		ТЗДопРеквизиты = ТЗДопРеквизиты.Скопировать(ТЗДопРеквизиты.НайтиСтроки(
			новый Структура("Исп, Документ", Истина, Документ)));
		Если тзДопРеквизиты.Колонки.Найти("ТекстОбработкаДоукмента") = Неопределено Тогда
			тзДопРеквизиты.Колонки.Добавить("ТекстОбработкаДоукмента", новый ОписаниеТипов(("Строка")));
		КонецЕсли;
		
		ДопРеквизиты = СтрЗаменить(ДопРеквизитыСтрока, Символ(30), РазделительСтрок);
		Для Сч = 1 По СтрЧислоСтрок(ДопРеквизиты) Цикл
			РеквизитЗначение = СтрЗаменить(СтрПолучитьСтроку(ДопРеквизиты, Сч), Символ(31), РазделительСтрок);
			Если СтрЧислоСтрок(РеквизитЗначение) <> 2 Тогда 
				Продолжить; 
			КонецЕсли;
			Реквизит = СтрПолучитьСтроку(РеквизитЗначение, 1);
			Значение = СтрПолучитьСтроку(РеквизитЗначение, 2);
			
			стрДопРеквизит = ТЗДопРеквизиты.Найти(Реквизит, "КодРеквизита");
			Если стрДопРеквизит = Неопределено Тогда
				//данный ревизит не найден в списке доступных доп реквизитов 
			Иначе
				Если Документ = "37" И стрДопРеквизит.ВариантДокумента = "2" Тогда
					ВариантДокумента = "2";
				КонецЕсли;
				Если стрДопРеквизит.ВариантДокумента = ""
					ИЛИ стрДопРеквизит.ВариантДокумента = ВариантДокумента Тогда				
					Попытка
						Выполнить(стрДопРеквизит.ТекстОбработкаДоукмента);
					Исключение
						ИО = ИнформацияОбОшибке();
						ОО = ОписаниеОшибки();
						текстОшибки = ПолучитьОшибку(ИО, ОО);
						ДобавитьВЛогФайл("При обработке дополнительного реквизита " + Реквизит + " документа " + Док + " произошла ошибка: " + текстОшибки);				
						стрИсключения = стрИсключения + текстОшибки + Символы.ПС;
					КонецПопытки;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;						
		
		Если стрИсключения = "" Тогда
		Иначе
			ВызватьИсключение стрИсключения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, ДопРеквизитыСтрока, Документ, ВариантДокумента)
	
	стрИсключения = "";
	текстОшибки = "";
	
	//получаем таблицу настроенных дополнительных реквизитов
	ТЗДопРеквизиты = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ДополнительныеРеквизиты");
	Если ТипЗнч(ТЗДопРеквизиты) = Тип("ТаблицаЗначений") Тогда
		//выбираем используемые дополнительные реквизиты, допустимые для данного типа документа
		//по варианту документа пока не контролируем тк может быть либо тип документа, либо "все"
		ТЗДопРеквизиты = ТЗДопРеквизиты.Скопировать(ТЗДопРеквизиты.НайтиСтроки(
			новый Структура("Исп, Документ", Истина, Документ)));
		Если тзДопРеквизиты.Колонки.Найти("ТекстОбработкаДоукмента") = Неопределено Тогда
			тзДопРеквизиты.Колонки.Добавить("ТекстОбработкаДоукмента", новый ОписаниеТипов(("Строка")));
		КонецЕсли;
		ДопРеквизиты = СтрЗаменить(ДопРеквизитыСтрока, Символ(30), РазделительСтрок);
		Для Сч = 1 По СтрЧислоСтрок(ДопРеквизиты) Цикл
			РеквизитЗначение = СтрЗаменить(СтрПолучитьСтроку(ДопРеквизиты, Сч), Символ(31), РазделительСтрок);
			Если СтрЧислоСтрок(РеквизитЗначение) <> 2 Тогда 
				Продолжить; 
			КонецЕсли;
			Реквизит = СтрПолучитьСтроку(РеквизитЗначение, 1);
			Значение = СтрПолучитьСтроку(РеквизитЗначение, 2);
			
			стрДопРеквизит = ТЗДопРеквизиты.Найти(Реквизит, "КодРеквизита");
			Если стрДопРеквизит = Неопределено Тогда
				//данный ревизит не найден в списке доступных доп реквизитов 
			Иначе
				Если Документ = "38" И стрДопРеквизит.ВариантДокумента = "2" Тогда
					ВариантДокумента = "2";
				КонецЕсли;
				
				Если стрДопРеквизит.КодРеквизита = "СкидкаПроцент" Тогда
					СтрДок.ПроцентСкидки = Значение;
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧастиСУчетомСкидок(СтрДок, Док);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
				КонецЕсли;
				
				Если стрДопРеквизит.КодРеквизита = "Депозит" Тогда
					СтрДок.Депозит = ?(Значение = "1", Истина, Ложь);
				КонецЕсли;

				
				Если стрДопРеквизит.ВариантДокумента = ""
					ИЛИ стрДопРеквизит.ВариантДокумента = ВариантДокумента Тогда				
					Попытка
						Выполнить(стрДопРеквизит.ТекстОбработкаДоукмента);
					Исключение
						ИО = ИнформацияОбОшибке();
						ОО = ОписаниеОшибки();
						текстОшибки = ПолучитьОшибку(ИО, ОО);
						ДобавитьВЛогФайл("При обработке дополнительного реквизита " + Реквизит + " строки документа " + Док + " произошла ошибка: " + текстОшибки);
						стрИсключения = стрИсключения + текстОшибки + Символы.ПС;	
					КонецПопытки;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;						
		
		Если стрИсключения = "" Тогда
		Иначе
			ВызватьИсключение стрИсключения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//функция возвращает ответ на запрос с КПК "выгрузка документов"
//ИдДок - внутренний идентификатор документа на КПК
//ДокументСсылка - ссылка на сформированный в 1С документ
//ошибка - ошибка, возникшая при проведении документа
функция ОтветПоВыгрузкеДокумента(ИдДок, ДокументСсылка = Неопределено, ошибка = "")
	Возврат ?(ДокументСсылка = Неопределено,
		ЦелоеВСтроку(ИдДок) + Таб 
		+ Таб 
		+ УбратьСпецСимволы(ошибка, Символы.ВТаб) + таб 
		+ "" + РазделительСтрок,
		ЦелоеВСтроку(ИдДок) + Таб 
		+ УникИдентификатор(ДокументСсылка) + таб 
		+ УбратьСпецСимволы(ошибка, Символы.ВТаб) + таб 
		+ УбратьСпецСимволы(СокрЛП(ДокументСсылка.Номер)) + РазделительСтрок);
КонецФункции

//проанализируем организацию и договор
Функция ПолучитьДоговораКонтрагента(Стр, Док)
	
	ТекстОшибки = "";
	//СоответствиеКонтрагента = 0 Контрагент - Клиент, Грузополучатель - Клиент, ДоговорКонтрагента - договор клиента
	//СоответствиеКонтрагента = 1 Контрагент - Холдинг, Грузополучатель - Клиент,ДоговорКонтрагента - договор холдинга 
	ВладелецДоговора = Док.Контрагент; 
	ВидДоговора = "ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";    
	ВидДоговораТекст = "'с покупателем'";
	ВидДоговораПеречисление = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ВидДоговора = "ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)";
		ВидДоговораТекст = "'с поставщиком'";
		ВидДоговораПеречисление = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.Договор) Тогда
		Если Стр.Договор.ВидДоговора = ВидДоговораПеречисление
			Или Стр.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее И Конфигурация = "БухКазахстан" Тогда
			Возврат Стр.Договор;
		Иначе
			Сообщить("Договор '" + Стр.Договор + "' НЕ может быть выбран, т.к. он '" + Стр.Договор.ВидДоговора 
				+ "', а нужен " + ВидДоговораТекст, СтатусСообщения.Внимание);
			Стр.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			Возврат Стр.Договор;
		КонецЕсли;
	Иначе
		Сообщить("Договор не указан", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если Конфигурация = "БухКазахстан" Тогда
		ВидДоговора = ВидДоговора + " ИЛИ ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.Прочее)";
	КонецЕсли;
	МВТ = Новый МенеджерВременныхТаблиц;
	ЗапросВсе = Новый Запрос;
	ЗапросВсе.МенеджерВременныхТаблиц = МВТ;
	ЗапросВсе.Текст =
	"ВЫБРАТЬ Ссылка ПОМЕСТИТЬ Договоры ИЗ Справочник.ДоговорыКонтрагентов ГДЕ
	|	Владелец = &Владелец
	|	И (ВидДоговора = " + ВидДоговора + ")
	|	И Организация В (&Организации)
	|	И НЕ ПометкаУдаления
	|	И ЭтоГруппа = ЛОЖЬ";
	ЗапросВсе.УстановитьПараметр("Владелец", ВладелецДоговора);
	ЗапросВсе.УстановитьПараметр("Организации", ПараметрыАгента.Организации);
	Результат = ЗапросВсе.Выполнить();
		
	// 1. Основной договор
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ Ссылка 
		|ИЗ Договоры 
		|ГДЕ
		|Ссылка.Владелец.ОсновнойДоговорКонтрагента = Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить("Выбран основной договор контрагента: " + Выборка.Ссылка
			+ " организация по договору: " + Стр.Организация, СтатусСообщения.Информация);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// 2. первый попавшийся из выбранной организации
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ Ссылка 
		|ИЗ Договоры 
		|ГДЕ 
		| Ссылка.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Стр.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить("Выбран договор контрагента: " + Выборка.Ссылка, СтатусСообщения.Информация);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// 3. первый попавшийся др. организация
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Договоры";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить("Выбран договор контрагента: " + Выборка.Ссылка
			+ " изменена организация по договору: " + Выборка.Ссылка.Организация, СтатусСообщения.Информация);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.Договор) Тогда
		ДобавитьОшибку("Загрузка накладной " + стр.ИдДок + ". Договор " + Стр.Договор 
			+ " не подходит. Не удалось подобрать нужный договор");
	Иначе
		ДобавитьОшибку("Загрузка накладной " + стр.ИдДок + ". Не удалось подобрать нужный договор");
	КонецЕсли;
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
КонецФункции

функция НайтиОбъектКатегория(Парам)
	Парам = Лев(Парам, СтрДлина(Парам) - 1);
	Если Конфигурация = "БухКазахстан" Тогда
		Возврат Справочники.КатегорииОбъектов.НайтиПоКоду(Парам);
	Иначе
		Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду(Парам);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ПолучитьТаблицуКатегорий(ТаблКатегорий)
	ТаблКатегорий = Новый ТаблицаЗначений;
	ТаблКатегорий.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	Если Конфигурация = "БухКазахстан" Тогда
		ТаблКатегорий.Колонки.Добавить("Категория", Новый ОписаниеТипов("СправочникСсылка.КатегорииОбъектов"));
	Иначе
		ТаблКатегорий.Колонки.Добавить("Категория", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СвойстваОбъектов"));
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьКатегорииДокумента(Док, ТаблКат)
	Если Конфигурация = "БухКазахстан" Тогда
		Для Каждого СтрСтрок Из ТаблКат Цикл  //по строкам списка категорий
			Набор = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(Док);
			Набор.Отбор.Категория.Установить(СтрСтрок.Категория);
			Запись = Набор.Добавить();
			Запись.Объект = Док;
			Запись.Категория = СтрСтрок.Категория;
			Набор.Записать();
		КонецЦикла;
	Иначе
		Для Каждого СтрСтрок Из ТаблКат Цикл
			Набор = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(Док);
			Набор.Отбор.Свойство.Установить(СтрСтрок.Категория);
			Запись = Набор.Добавить();                    
			Запись.Объект = Док;   
			Запись.Свойство = СтрСтрок.Категория;
			Запись.Значение = Истина;
			Набор.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Устанавливает дату оплаты документа в соответствии с договором, указанным в документе
// Параметры:
// 		ДокОбъект - ДокументОбъект, документ, в котором устанавливать дату оплаты
Процедура УстановитьДатуОплатыПоДоговору(ДокОбъект)

    ДоговорКонтрагента 	= ДокОбъект.ДоговорКонтрагента;
	ДатаДокумента 		= ДокОбъект.Дата;

	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	Если ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя Тогда
		ЧислоДнейДоОплаты = ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты;
	Иначе
		ЧислоДнейДоОплаты = 0;
	КонецЕсли;
	ДатаОплатыНовая = ДатаДокумента;
	//Если НЕ ЧислоДнейДоОплаты = 0 Тогда
	//	ДатаОплатыНовая = ЗаполнениеДокументов.ОпределитьДату(ДатаДокумента, ЧислоДнейДоОплаты);
	//	Если ДатаОплатыНовая = Неопределено Тогда
	//		ДатаОплатыНовая = ДатаДокумента;
	//	КонецЕсли;	
	//КонецЕсли;
	ДокОбъект.ДатаОплаты = ДатаОплатыНовая;
КонецПроцедуры

Процедура ЗаписатьФотоДокумента(Док, Фото, типОбъекта)
	Если ПустаяСтрока(фото) Тогда 
		Возврат;
	КонецЕсли;
	
	Блокировщик = Неопределено;
	БД = ОткрытьВнешнююБД(Блокировщик, истина);
	Если БД = Ложь Тогда
		Сообщить(ОшибкаНетДоступаКВнешнейБД, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса=
		"INSERT INTO IncomingPhotos( [ObjectId], [MobiObjectType], [ObjectTypeName], [Filename], [photoDate]) " 
		+ "VALUES(?,?,?,?,?)";
	ПодгЗапрос=БДПодготовитьЗапрос(БД, ТекстЗапроса);
	БДУстановитьПараметр(ПодгЗапрос, 5, ДатаДляSQLite(ТекущаяДатаСуточнаяКоррекция()));
	
	БДУстановитьПараметр(ПодгЗапрос, 1, УникИдентификатор(Док));
	КаталогОтносительноОснКаталогаМобиС = 
		СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код) + "\Photo\" + ПолучитьИмяКаталогаПоТипуОбъекта(ТипОбъекта) + "\";
	БДУстановитьПараметр(ПодгЗапрос, 2, типОбъекта);
	БДУстановитьПараметр(ПодгЗапрос, 3, Док.Метаданные().Имя);
	
	Для Н=1 По СтрЧислоСтрок(Фото) Цикл
		ИмяФайла=СтрПолучитьСтроку(фото,Н);
		БДУстановитьПараметр(ПодгЗапрос, 4, КаталогОтносительноОснКаталогаМобиС + СтрПолучитьСтроку(Фото,Н));
		БДСледующаяЗапись(ПодгЗапрос);
		БДСбросПодготовленногоЗапроса(ПодгЗапрос);
	КонецЦикла;
		
	БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);
	ЗакрытьВнешнююБД(БД, Блокировщик);
КонецПроцедуры

// Заполняет счета в строке табличной части.
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(Док, СтрокаТЧ, ИмяТабЧасти, Заполнять = Истина) 
	
	МетаданныеДока = Док.Метаданные();
	СчетаУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрокаТЧ.Номенклатура, Док.Склад, Док.Дата,
		ОбщегоНазначения.ЕстьРеквизитДокумента("ДеятельностьНаПатенте", МетаданныеДока) И Док.ДеятельностьНаПатенте);
	Если Заполнять = Истина Тогда
		СтрокаТЧ.СчетУчета = СчетаУчета.СчетУчета;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПереданныеСчетУчета", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.ПереданныеСчетУчета = СчетаУчета.СчетПередачи;
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетДоходов", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетДоходов  = СчетаУчета.СчетДоходов;
			СтрокаТЧ.СчетРасходов = СчетаУчета.СчетРасходов;
			Если СтрокаТЧ.СчетДоходов.ВидыСубконто.Количество() > 0 Тогда
				СтрокаТЧ.Субконто = Новый(СтрокаТЧ.СчетДоходов.ВидыСубконто[0].ВидСубконто.ТипЗначения.Типы()[0]);
				Если ТипЗнч(СтрокаТЧ.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					СтрокаТЧ.Субконто = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
				КонецЕсли;
			Иначе
				СтрокаТЧ.Субконто = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаНДСПоРеализации", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетУчетаНДСПоРеализации = СчетаУчета.СчетУчетаНДСПродажи;
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаНДС", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
		КонецЕсли;
	ИначеЕсли Заполнять = Ложь Тогда
		СтрокаТЧ.СчетУчета = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетДоходов", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетДоходов  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.СчетРасходов = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаНДСПоРеализации", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаНДС", МетаданныеДока, ИмяТабЧасти) Тогда
			СтрокаТЧ.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ОтражениеВУСН", МетаданныеДока, ИмяТабЧасти) Тогда
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЕсли;
	
КонецПроцедуры
 
// создает таблицу со строками для загрузки документов
Функция СоздатьТаблицуСтрокРН()
	ТаблСтрок = Новый Таблицазначений;
	ТаблСтрок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблСтрок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблСтрок.Колонки.Добавить("Партия");
	ТаблСтрок.Колонки.Добавить("Колво", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Единица", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблСтрок.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблСтрок.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Остаток", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой))); //остаток в ТТ
	ТаблСтрок.Колонки.Добавить("Фейсинг", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой))); //количество на витрине
	ТаблСтрок.Колонки.Добавить("Форма", Новый ОписаниеТипов("Строка"));
	ТаблСтрок.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"));
	ТаблСтрок.Колонки.Добавить("Бонус", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	                           
	Возврат ТаблСтрок;
КонецФункции // СоздатьТаблицуСтрок()

// Пересчитывает цены, суммы, скидки и прочее в документе так, как если бы документ вводили вручную
// Параметры:
// 		Док - ДокументОбъект, документ, в котором выполнить пересчёт
Процедура ЗаполнитьРеализациюПоАлгоритмам1С(Док)
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	СтруктураЗначений = Новый Структура;
	
	Если Конфигурация = "БухКазахстан" Тогда
		СтруктураЗначений.Вставить("НовыйУчитыватьАкциз"		, Док.УчитыватьАкциз);
		СтруктураЗначений.Вставить("ТекущийУчитыватьАкциз"		, Док.УчитыватьАкциз);
		СтруктураЗначений.Вставить("НовыйСуммаВключаетАкциз"	, Док.СуммаВключаетАкциз);
		СтруктураЗначений.Вставить("ТекущийСуммаВключаетАкциз"	, Док.СуммаВключаетАкциз);
		МодульЦены	= "УправлениеЦенообразованием";
		Модуль		= "УправлениеВзаиморасчетами";
	Иначе
		МодульЦены	= "Ценообразование";
		Модуль		= "ЗаполнениеДокументов";
	КонецЕсли;	

	СтруктураРеквизитовДокумента = Неопределено;
	Выполнить("СтруктураРеквизитовДокумента = " + МодульЦены + ".ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(Док)");

	СтруктураЗначений.Вставить("ТекущийТипЦен"					, Док.ТипЦен);
	СтруктураЗначений.Вставить("ТекущийВалютаДокумента"			, Док.ВалютаДокумента);
	СтруктураЗначений.Вставить("ТекущийВалютаВзаиморасчетов"	, Док.ВалютаДокумента);
	СтруктураЗначений.Вставить("ТекущийКурсДокумента"			, Док.КурсВзаиморасчетов);
	СтруктураЗначений.Вставить("ТекущийКурсВзаиморасчетов"		, Док.КурсВзаиморасчетов);
	СтруктураЗначений.Вставить("ТекущийУчитыватьНДС"			, Док.УчитыватьНДС);
	СтруктураЗначений.Вставить("ТекущийСуммаВключаетНДС"		, Док.СуммаВключаетНДС);
	СтруктураЗначений.Вставить("ПерезаполнитьЦеныПоТипу"		, Ложь);
	СтруктураЗначений.Вставить("НовыйТипЦен"					, Док.ТипЦен);
	СтруктураЗначений.Вставить("ПересчитатьЦеныПоВалюте"		, Истина);
	СтруктураЗначений.Вставить("НовыйВалютаДокумента"			, Док.ВалютаДокумента);
	СтруктураЗначений.Вставить("НовыйКурсДокумента"				, Док.КурсВзаиморасчетов);
	СтруктураЗначений.Вставить("НовыйКурсВзаиморасчетов"		, Док.КурсВзаиморасчетов);
	СтруктураЗначений.Вставить("НовыйУчитыватьНДС"				, Док.УчитыватьНДС);
	СтруктураЗначений.Вставить("НовыйСуммаВключаетНДС"			, Док.СуммаВключаетНДС);
	СтруктураЗначений.Вставить("ТекущийКратностьДокумента"		, Док.КратностьВзаиморасчетов);
	СтруктураЗначений.Вставить("НовыйКратностьДокумента"		, Док.КратностьВзаиморасчетов);
	СтруктураЗначений.Вставить("ТекущийКратностьВзаиморасчетов"	, Док.КратностьВзаиморасчетов);
	СтруктураЗначений.Вставить("НовыйКратностьВзаиморасчетов"	, Док.КратностьВзаиморасчетов);
	
	Выполнить("" + Модуль + ".ИзменитьЦеныВалюту(Док, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, , ""Товары"", мВалютаРегламентированногоУчета, , СтруктураЗначений)");

КонецПроцедуры

// Заполняет все реквизиты документа РеализацияТоваровУслуг при его загрузке из КПК
// Параметры:
// 		Док - ДокументОбъект, загружаемый документ
// 		СтрШапки - ТаблицаЗначений, содержащая все реквизиты шапки в соответствии с протоколом обмена
// 		ТаблТовары - ТаблицаЗначений, содержащая все реквизиты таблицы документа в соответствии
// 			с протоколом обмена
Процедура ЗаполнитьРеализациюТоваровИУслуг(Док, СтрШапки, ТаблТовары)
		
	РасчитыватьЦены1С = ПараметрыАгента.РасчитыватьЦены1С;
	Док.Дата		= ДатаИзДатаИВремя(СтрШапки.Дата, ТекущаяДата());  //Время поставим текущее
	Док.ВидОперации	= Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
	Док.Склад		= ?(ЗначениеЗаполнено(СтрШапки.Склад), СтрШапки.Склад, ПараметрыАгента.Склады[0].Склад);

	Док.Комментарий = СокрЛП(
		?(ЗначениеЗаполнено(СтрШапки.ВремяДоставки),
			"Доставка заказана " + Формат(СтрШапки.ВремяДоставки, "ДЛФ=DD")
			+ " в " + Формат(СтрШапки.ВремяДоставки, "ДФ=ЧЧ:мм"),
			"")
		+ " " + СтрШапки.Комментарий);
	
	//Если СоответствиеКонтрагента = 0 Тогда //покупатель = грузополучатель
		Док.Грузополучатель			= СтрШапки.Контрагент;
		Док.Контрагент				= СтрШапки.Контрагент;
	//Иначе	//холдинг
	//	Док.Грузополучатель			= СтрШапки.Контрагент;
		//Док.Контрагент				= Док.Грузополучатель.ГоловнойКонтрагент;
	//КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрШапки.Договор) 
		И (СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		Или СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее И Конфигурация = "БухКазахстан") Тогда
		Док.ДоговорКонтрагента = СтрШапки.Договор;
	Иначе
		Док.ДоговорКонтрагента = ПолучитьДоговораКонтрагента(СтрШапки, Док);
	КонецЕсли;
	глПоследняяОшибкаПроведения = "";
	Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
		ВызовемИсключение = 1 / 0;
	КонецЕсли;
	
	Док.Организация		= Док.ДоговорКонтрагента.Организация;
	Док.ТипЦен			= ?(РасчитыватьЦены1С, ?(ЗначениеЗаполнено(Док.ДоговорКонтрагента.ТипЦен), Док.ДоговорКонтрагента.ТипЦен, СтрШапки.ТипЦены), СтрШапки.ТипЦены);
	Док.ВалютаДокумента	= Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	Док.УчитыватьНДС	= ОпределитьУчитыватьНДС(Док.Организация, Док.Дата);
	Док.СуммаВключаетНДС= Док.ТипЦен.ЦенаВключаетНДС;
	Док.АдресДоставки	= СтрШапки.АдресДоставки;
	КурсВалюты					= ПолучитьКурсВалюты(Док.ВалютаДокумента, Док.Дата);
	Док.КурсВзаиморасчетов		= КурсВалюты.Курс;
	Док.КратностьВзаиморасчетов	= КурсВалюты.Кратность;
	Док.Ответственный			= ПараметрыАгента.Агент;
	СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентом(Док.Организация, Док.Контрагент, Док.ДоговорКонтрагента, Док.ВалютаДокумента);
	Док.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	Док.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;

	НДСВидОперацииРеализации = Неопределено;
	Если Конфигурация = "БухКазахстан" Тогда
		//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
		//	Док.Автор = ПараметрыАгента.Агент;
		//КонецЕсли;
		Попытка
			НДСВидОперацииРеализации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойВидОперацииРеализации");
		Исключение
		КонецПопытки;
		Если Не ЗначениеЗаполнено(НДСВидОперацииРеализации) Тогда
			НДСВидОперацииРеализации = Справочники.ВидыРеализации.РеализацияТМЗ;
		КонецЕсли;
		Док.УчитыватьКПН			= ОрганизацияПлательщикКПН(Док.Организация);
		Если Док.УчитыватьКПН Тогда
			Док.ВидУчетаНУ			= Справочники.ВидыУчетаНУ.НУ;
		КонецЕсли;
		Док.СуммаВключаетАкциз		= Док.ТипЦен.ЦенаВключаетАкциз;
	ИначеЕсли Конфигурация = "БухБеларусь" Тогда
		Док.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		Док.ОтражатьВНалоговомУчете = Истина;
		Док.СчетУчетаРасчетовПоТаре	= СчетаУчета.СчетУчетаТарыПокупателя;
		//Процедура ЗаполнитьСчетаУчетаРасчетов(СчетаУчета = неопределено) Экспорт
		Док.ЗаполнитьСчетаУчетаРасчетов();
		Док.мУчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьПоследнее(Док.Дата,Новый Структура("Организация",Док.Организация));//Минск+

	Иначе
		Док.СчетУчетаРасчетовПоТаре	= СчетаУчета.СчетУчетаТарыПокупателя;
		//Док.СпособЗачетаАвансов		= Перечисления.СпособыЗачетаАвансов.Автоматически;
	КонецЕсли;
	
	СтруктураВалютаКПК = Неопределено;
	Если ПараметрыАгента.ВалютаКПК <> Док.ВалютаДокумента Тогда
		СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
	КонецЕсли;
	
	СуммаДокумента = 0;
	ДополнительныеПараметры = Новый Структура();
	Для Каждого СтрСтрок Из ТаблТовары Цикл  //по строкам Табличной части
		Если СтрСтрок.Колво = 0 Тогда Продолжить; КонецЕсли;
		
		СтрДок = Неопределено;
		стрСумма = СтрСтрок.Сумма;
		Если СтруктураВалютаКПК <> Неопределено Тогда
			стрСумма = ПересчитатьИзВалютыВВалюту(СтрСтрок.Сумма,
				ПараметрыАгента.ВалютаКПК, Док.ВалютаДокумента,
				СтруктураВалютаКПК.Курс, Док.КурсВзаиморасчетов,
				СтруктураВалютаКПК.Кратность, Док.КратностьВзаиморасчетов);
		КонецЕсли;
		
		Если СтрСтрок.Номенклатура.Услуга Тогда
			СтрДок = Док.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДок, ДополнительныеПараметры);
			СтрДок.Содержание 				= "услуга";
			СтрДок.Количество				= СтрСтрок.Колво;
			СтрДок.Номенклатура				= СтрСтрок.Номенклатура;
			СтрДок.СтавкаНДС				= ?(ЗначениеЗаполнено(СтрДок.Номенклатура.СтавкаНДС), СтрДок.Номенклатура.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
		Иначе
			СтрДок = Док.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДок, ДополнительныеПараметры);
			//товары
			СтрДок.Номенклатура				= СтрСтрок.Номенклатура;
			Если Конфигурация = "БухБеларусь" И СтрСтрок.Партия <> ""  Тогда
				СтрДок.Партия				= СтрСтрок.Партия;
			КонецЕсли;
			СтрДок.СтавкаНДС				= ?(ЗначениеЗаполнено(СтрДок.Номенклатура.СтавкаНДС), СтрДок.Номенклатура.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
			Если Док.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
				СтрДок.ЕдиницаИзмерения	    	= СтрСтрок.Единица;
				СтрДок.Количество				= СтрСтрок.Колво;
			КонецЕсли;
			СтрДок.Коэффициент				= СтрСтрок.Коэффициент;
			
			Если Конфигурация = "БухКазахстан" Тогда
				СтрДок.НДСВидОперацииРеализации	= НДСВидОперацииРеализации;
				Если Док.СуммаВключаетАкциз И Док.УчитыватьАкциз Тогда 
					СтрДок.СтавкаАкциза		= СтрДок.Номенклатура.СтавкаАкциза;
					ОбработкаТабличныхЧастей.РассчитатьСуммуАкцизаТабЧасти(СтрДок, Док);
				КонецЕсли;
			Иначе
				СтрДок.КоличествоМест 		= СтрСтрок.Колво;
				СтрДок.НомерГТД				= СтрДок.Номенклатура.НомерГТД;
				СтрДок.СтранаПроисхождения	= СтрДок.Номенклатура.СтранаПроисхождения;
				СтрДок.Себестоимость		= стрСумма; // Себестоимость в рублях
			КонецЕсли;
			ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "13", "0");	
			
		КонецЕсли;
		
		Если (РасчитыватьЦены1С) И НЕ((СтрСтрок.Бонус > 0) И (ПараметрыАгента.СпособПредоставленияБонусов = 0)) Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрДок, Док, мВалютаРегламентированногоУчета); 
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧастиСУчетомСкидок(СтрДок, Док);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
		Иначе
			СтавкаНДС = ПолучитьСтавкуНДС(СтрДок.СтавкаНДС) / 100;
			СтрДок.Цена = ?(СтрДок.Количество > 0, ?(Док.УчитыватьНДС, ?(Док.СуммаВключаетНДС, СтрСумма, СтрСумма / (1 + СтавкаНДС)), СтрСумма) / СтрДок.Количество, 0);
			СуммаСоСкидкой	= СтрСумма - СтрСумма * СтрШапки.Скидка / 100;
			СтрДок.СуммаНДС = ?(Док.УчитыватьНДС, СуммаСоСкидкой - СуммаСоСкидкой / (1 + СтавкаНДС), 0);
			СтрДок.Сумма	= ?(Док.СуммаВключаетНДС, СуммаСоСкидкой, СуммаСоСкидкой - СтрДок.СуммаНДС);
		КонецЕсли;
		ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "13", "0");
		СуммаДокумента = СуммаДокумента + СтрДок.Сумма;
	КонецЦикла;
	
	Если Конфигурация = "БухКазахстан" Тогда
		Док.ЗаполнитьСчетаУчетаВТабЧасти(Док.Товары, "Товары", Истина, Док.УчитыватьКПН);
	Иначе
	//Если Конфигурация = "БухБеларусь" Тогда
		//Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
		Док.ЗаполнитьСчетаУчетаВТабЧасти(Док.Товары, "Товары", Истина, Истина);
		Док.СуммаДокумента = СуммаДокумента;
	//Иначе
	//	Док.ЗаполнитьСчетаУчетаВТабЧасти(Док.Товары, "Товары", Истина);
	КонецЕсли;
	
	Если РасчитыватьЦены1С Тогда     
		ЗаполнитьРеализациюПоАлгоритмам1С(Док);//удаляет бонусы
	КонецЕсли;
	
	Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
		Док.УстановитьНовыйНомер(Док.Организация.Префикс);
	Иначе
		Док.Номер = СтрШапки.Номер;
	КонецЕсли;
	
	Док.Экспедитор = Док.Ответственный.ФизЛицо;
	
	//запускаем обработку дополнительных реквизитов			
	ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "12", "0");

КонецПроцедуры

// Создаёт документ реализация товаров и услуг на основе таблиц шапок и строк
// Параметры
// Адрес - идентификатор сессии обмена
// ТаблШапок - таблица значений с "шапками" документов
// ТаблСтрок - таблица значений с данными для табличной части Товары
// ТаблПользователей - Таблица значений с перечнем пользователей которых нужно оповещать о созданных документах
// ТаблКатегорий - Таблица категорий документа
Процедура СоздатьРеализациюТоваровИУслуг(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий)
	ДобавитьСообщение("Формируются накладные...");
	
	текДата = ТекущаяДата();
	ВремТабл = СоздатьТаблицуСтрокРН(); //временная таблица
	нетОшибок = Истина;
	Для Каждого СтрШапки Из ТаблШапок Цикл
		УникДок = СформироватьУникальныйКодДокумента("Реализация", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		
		СтруктПоиска = Новый Структура;
		СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
		ТаблТовары = ТаблСтрок.Скопировать(СтруктПоиска); //Таблица с товарами в накладной
		ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); //Таблица категорий
		ИтогКолво = ТаблТовары.Итог("Колво"); //проверим пустой документ
		Если ИтогКолво = 0 Тогда
			Ответ = Строка(СтрШапки.ИдДок) + Таб + УникИдентификатор(СсылкаДок) + РазделительСтрок;
			СерверПослатьОтвет(Адрес, Ответ, 0);
			Продолжить;
		КонецЕсли; 
		
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес, Ответ, 0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			нетОшибок = Истина;
			НачатьТранзакцию();
			Попытка
				Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				ЗаполнитьРеализациюТоваровИУслуг(Док, СтрШапки, ТаблТовары);	///////////////////////////////////////////
							
				Если ПараметрыАгента.ПроводитьПродажа Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					Док.Записать();
				КонецЕсли;
										
				Если ПараметрыАгента.ПроводитьПродажа Тогда
					Если Док.Проведен Тогда
						ТекстСтатуса = " (проведен)";
						Если ПараметрыАгента.СоздаватьСчетФактуру Тогда
							//создать счет фактуру с тем же номером
							СоздатьСчетФактуру(Док);
						КонецЕсли;
					Иначе
						ТекстСтатуса = " (не проведен)";
					КонецЕсли;
				КонецЕсли;			
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
			КонецПопытки;
			
			Если нетОшибок Тогда
				ЗаписатьУникКодДокумента(Док, УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
	            //добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект   = Док.ссылка;
				МенеджерЗаписи.Свойство = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект   = Док.ссылка;
				МенеджерЗаписи.Свойство = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение = СтрШапки.Дата;
				МенеджерЗаписи.Записать(Истина);			
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки.Фото, 12);			
				ЗавершитьСобытие(Адрес, Платформа, "Реализация", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				ЗафиксироватьТранзакцию();
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				СерверПослатьОтвет(Адрес, Ответ, 0);			
			Иначе
				ОтменитьТранзакцию();
				//СообщениеАгентуОбОшибке = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности.";
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ продажа не создан"; 
					Если ПараметрыАгента.ПроводитьПродажа Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Для контрагента " + Док.Контрагент + " не найден договор с покупателем";
					СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				//ДобавитьВЛогФайл(СообщениеАгентуОбОшибке, ПараметрыАгента.Агент, 0);
				//Если СообщениеАгентуОбОшибке <> глПоследняяОшибкаПроведения Тогда 
					ДобавитьВЛогФайл("Ошибка создания документа Продажа: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
	
КонецПроцедуры                      

// Оформляет документ СчетФактураВыданный на основании указанного документа
// Параметры:
// 		Документобъект - ДокументОбъект, на основании которого ввести Счёт-фактуру
Процедура СоздатьСчетФактуру(ДокументОбъект)
	глПоследняяОшибкаПроведения = "";
	ВидСчетаФактуры = "СчетФактураВыданный";
	Если (Не ДокументОбъект.Проведен) и (Не ДокументОбъект.ПометкаУдаления) Тогда
		Сообщить("Счет-фактуру нельзя вводить на основании НЕ проведенного документа!");
		Возврат;
	КонецЕсли;
	//Попытаемся найти счет-фактуру
	СчетФактура = Неопределено;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ Документ.СчетФактураВыданный.ДокументыОснования
	|ГДЕ ДокументОснование = &ДокументСсылка
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка.ПометкаУдаления,
	|	Ссылка.Проведен УБЫВ,
	|	Ссылка.Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СчетФактура = Выборка.Ссылка;
	КонецЕсли;
	ОбъектСчетаФактуры = Неопределено;
	глПоследняяОшибкаПроведения = "";
	//Если потерпели неудачу, то необходимо ввести новый документ 
	Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
		//Вводим новый документ на основании нашего
		ОбъектСчетаФактуры = Документы[ВидСчетаФактуры].ПолучитьФормуНовогоДокумента( , ЭтаФорма, Строка(ДокументОбъект));
		ОбъектСчетаФактуры.Заполнить(ДокументОбъект.Ссылка);
		Если ПараметрыАгента.ТорговляСКолес Тогда
			ОбъектСчетаФактуры.Номер = ДокументОбъект.Номер;
		Иначе
		КонецЕсли;
		ОбъектСчетаФактуры.Ответственный = ДокументОбъект.Ответственный;
		Если Конфигурация = "БухКазахстан" Тогда
			//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
			//	ОбъектСчетаФактуры.Автор = ПараметрыАгента.Агент;
			//КонецЕсли;
		Иначе 
			ОбъектСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
		КонецЕсли;
		Попытка
			ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда
				глПоследняяОшибкаПроведения = ОписаниеОшибки();
			КонецЕсли;
			Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
				глПоследняяОшибкаПроведения = "Счет-фактура к документу не создан"; 
			КонецЕсли;
            ДобавитьВЛогФайл("Ошибка создания документа Счет-Фактура: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
		КонецПопытки;
	ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
		Сообщить("Для данного документа уже есть Счет-Фактура.");			
	Иначе
		Сообщить("На основании документов, помеченных на удаление, ввод счетов-фактур НЕ предусмотрен.");
	КонецЕсли;
КонецПроцедуры     

// Заполняет все реквизиты документа РеализацияТоваровУслуг при его загрузке из КПК
// Параметры:
// 		Док - ДокументОбъект, загружаемый документ
// 		СтрШапки - ТаблицаЗначений, содержащая все реквизиты шапки в соответствии с протоколом обмена
// 		ТаблТовары - ТаблицаЗначений, содержащая все реквизиты таблицы документа в соответствии
// 			с протоколом обмена
Процедура ЗаполнитьАктОбОказанииПроизводственныхУслуг(Док, СтрШапки, ТаблТовары)
	
	РасчитыватьЦены1С = ПараметрыАгента.РасчитыватьЦены1С;
	Док.Дата = ДатаИзДатаИВремя(СтрШапки.Дата, ТекущаяДата());  //Время поставим текущее
	//Док.Комментарий = "" + СтрШапки.ИдДок + " " + СтрШапки.Комментарий;
	Док.Комментарий = СтрШапки.Комментарий;
	Док.Контрагент = СтрШапки.Контрагент;
	
	Если ЗначениеЗаполнено(СтрШапки.Договор)
		И (СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		Или СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее И Конфигурация = "БухКазахстан") Тогда
		Док.ДоговорКонтрагента = СтрШапки.Договор;
	Иначе
		Док.ДоговорКонтрагента = ПолучитьДоговораКонтрагента(СтрШапки, Док);
	КонецЕсли;
	глПоследняяОшибкаПроведения = "";
	Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
		ВызовемИсключение = 1 / 0;
	КонецЕсли;
	
	Док.Организация		= Док.ДоговорКонтрагента.Организация;
	Док.ТипЦен			= ?(РасчитыватьЦены1С, ?(ЗначениеЗаполнено(Док.ДоговорКонтрагента.ТипЦен), Док.ДоговорКонтрагента.ТипЦен, СтрШапки.ТипЦены), СтрШапки.ТипЦены);
	Док.ВалютаДокумента	= Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	Док.УчитыватьНДС	= ОпределитьУчитыватьНДС(Док.Организация, Док.Дата);
	Док.СуммаВключаетНДС= Док.ТипЦен.ЦенаВключаетНДС;
	КурсВалюты					= ПолучитьКурсВалюты(Док.ВалютаДокумента, Док.Дата);
	Док.КурсВзаиморасчетов		= КурсВалюты.Курс;
	Док.КратностьВзаиморасчетов	= КурсВалюты.Кратность;
	Док.Ответственный			= ПараметрыАгента.Агент;
	СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентом(Док.Организация, Док.Контрагент, Док.ДоговорКонтрагента, Док.ВалютаДокумента);
	Док.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
	Док.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;

	НДСВидОперацииРеализации = Неопределено;
	Если Конфигурация = "БухКазахстан" Тогда
		//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
		//	Док.Автор = ПараметрыАгента.Агент;
		//КонецЕсли;
		Док.ПодразделениеОрганизации = ПараметрыАгента.Подразделение;
		Док.СчетЗатратБУ	= ПланыСчетов.Типовой.ОсновноеПроизводство;
		Док.АдресДоставки	= СтрШапки.АдресДоставки;
		Док.Грузополучатель = СтрШапки.Контрагент;
		Если СоответствиеКонтрагента = 1 Тогда //покупатель = грузополучатель
			Док.Контрагент = Док.Грузополучатель.ГоловнойКонтрагент;
		КонецЕсли; 
		Попытка
			НДСВидОперацииРеализации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойВидОперацииРеализации");
		Исключение
		КонецПопытки;
		Если Не ЗначениеЗаполнено(НДСВидОперацииРеализации) Тогда
			НДСВидОперацииРеализации = Справочники.ВидыРеализации.РеализацияТМЗ;
		КонецЕсли;
		Док.УчитыватьКПН		= ОрганизацияПлательщикКПН(Док.Организация);
		Если Док.УчитыватьКПН Тогда
			Док.ВидУчетаНУ		= Справочники.ВидыУчетаНУ.НУ;
			Док.СчетЗатратНУ	= ПланыСчетов.Налоговый.ОсновноеПроизводство;
		КонецЕсли;
	ИначеЕсли Конфигурация = "БухБеларусь" Тогда
		Док.СчетЗатрат			= СчетаУчета.СчетРасчетов; 
		Док.ПодразделениеОрганизации = ПараметрыАгента.Подразделение;
	Иначе
		Док.Исполнитель			= ПараметрыАгента.Агент.ФизЛицо;
		Док.СпособЗачетаАвансов	= Перечисления.СпособыЗачетаАвансов.Автоматически;
		Док.ПодразделениеЗатрат = ПараметрыАгента.Подразделение;
		Док.СчетЗатрат			= СчетаУчета.СчетРасчетов;
	КонецЕсли;
	
	СтруктураВалютаКПК = Неопределено;
	Если ПараметрыАгента.ВалютаКПК <> Док.ВалютаДокумента Тогда
		СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
	КонецЕсли;
	
	МетаданныеДока = Док.Метаданные();
	Для Каждого СтрСтрок Из ТаблТовары Цикл  //по строкам Табличной части
		Если СтрСтрок.Колво = 0 Тогда Продолжить; КонецЕсли;
		
		стрСумма = СтрСтрок.Сумма;
		Если СтруктураВалютаКПК <> Неопределено Тогда
			стрСумма = ПересчитатьИзВалютыВВалюту(СтрСтрок.Сумма,
				ПараметрыАгента.ВалютаКПК, Док.ВалютаДокумента,
				СтруктураВалютаКПК.Курс, Док.КурсВзаиморасчетов,
				СтруктураВалютаКПК.Кратность, Док.КратностьВзаиморасчетов);
		КонецЕсли;
		
		СтрДок = Док.Услуги.Добавить();
		СтрДок.Количество	= СтрСтрок.Колво;
		СтрДок.Номенклатура	= СтрСтрок.Номенклатура;
		СтрДок.СтавкаНДС	= СтрДок.Номенклатура.СтавкаНДС;
		СтрДок.НоменклатурнаяГруппа	= СтрДок.Номенклатура.НоменклатурнаяГруппа;
		Если Не ЗначениеЗаполнено(Док.НоменклатурнаяГруппа) Тогда
			Док.НоменклатурнаяГруппа = СтрДок.НоменклатурнаяГруппа;
		КонецЕсли;
		
		Если (РасчитыватьЦены1С) И НЕ((СтрСтрок.Бонус > 0) И (ПараметрыАгента.СпособПредоставленияБонусов = 0)) Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрДок, Док, мВалютаРегламентированногоУчета); 
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
		Иначе
			СтавкаНДС = ПолучитьСтавкуНДС(СтрДок.СтавкаНДС) / 100;
			СтрДок.Цена = ?(СтрДок.Количество > 0, ?(Док.УчитыватьНДС, ?(Док.СуммаВключаетНДС, СтрСумма, СтрСумма / (1 + СтавкаНДС)), СтрСумма) / СтрДок.Количество, 0);
			СуммаСоСкидкой	= СтрСумма - СтрСумма * СтрШапки.Скидка / 100;
			СтрДок.СуммаНДС = ?(Док.УчитыватьНДС, СуммаСоСкидкой - СуммаСоСкидкой / (1 + СтавкаНДС), 0);
			СтрДок.Сумма	= ?(Док.СуммаВключаетНДС, СуммаСоСкидкой, СуммаСоСкидкой - СтрДок.СуммаНДС);
		КонецЕсли;
		
		СтрДок.СуммаПлановая = стрСумма;
		СтрДок.ПлановаяСтоимость = СтрДок.СуммаПлановая / СтрДок.Количество;
		
		СчетаНоменклатуры = Новый Структура;
		
		Если Конфигурация = "БухКазахстан" Тогда
			СтрДок.Коэффициент	= СтрСтрок.Коэффициент;
			СтрДок.НДСВидОперацииРеализации	= НДСВидОперацииРеализации;
			Выполнить("СчетаНоменклатуры = ПроцедурыБухгалтерскогоУчета.ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрДок.Номенклатура);");
			Док.ЗаполнитьСчетаБУ(СтрДок, "Услуги", СчетаНоменклатуры, Истина,  МетаданныеДока);
			
			// ЗаполнитьСчетаНУ
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетДоходовНУ", МетаданныеДока, "Услуги") Тогда
				СтрДок.СчетДоходовНУ = СчетаНоменклатуры.СчетДоходовОтРеализацииНУ;
				Выполнить("ПроцедурыБухгалтерскогоУчета.ЗаполнитьАналитикуСчетаТабличнойЧасти(СтрДок, СчетаНоменклатуры, ""СубконтоДоходовНУ"", ""СчетДоходовНУ"", ""СубконтоДоходовНУ"");");
				#Если Клиент Тогда
					РаботаСДиалогами.ЗаполнитьАналитикуПодразделениеСчетовДоходовЗатрат(СтрДок, СтрДок.СчетДоходовНУ, "СубконтоДоходовНУ", Док.ПодразделениеОрганизации);
				#КонецЕсли
			КонецЕсли;	
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетСписанияСебестоимостиНУ", МетаданныеДока, "Услуги") Тогда
				СтрДок.СчетСписанияСебестоимостиНУ = СчетаНоменклатуры.СчетСебестоимостиПриРеализацииНУ;
				Выполнить("ПроцедурыБухгалтерскогоУчета.ЗаполнитьАналитикуСчетаТабличнойЧасти(СтрДок, СчетаНоменклатуры, ""СубконтоСебестоимостиНУ"", ""СчетСписанияСебестоимостиНУ"", ""СубконтоСписанияСебестоимостиНУ"");");			
				#Если Клиент Тогда
					РаботаСДиалогами.ЗаполнитьАналитикуПодразделениеСчетовДоходовЗатрат(СтрДок, СтрДок.СчетСписанияСебестоимостиНУ, "СубконтоСписанияСебестоимостиНУ", Док.ПодразделениеОрганизации);
				#КонецЕсли
			КонецЕсли;			
		ИначеЕсли Конфигурация = "БухБеларусь" Тогда
			Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиУслуги(СтрДок, Истина, Истина);
		Иначе  // Россия
			Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиУслуги(СтрДок, Истина);
		КонецЕсли;
		ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "13", "1");	

	КонецЦикла;
	
	
	Если РасчитыватьЦены1С Тогда     
		//ЗаполнитьРеализациюПоАлгоритмам1С(Док);
	КонецЕсли;
	
	Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
		Док.УстановитьНовыйНомер(Док.Организация.Префикс);
	Иначе
		Док.Номер = СтрШапки.Номер;
	КонецЕсли;
	//запускаем обработку дополнительных реквизитов			
	ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "12", "1");

КонецПроцедуры

// Создаёт документ Акт об оказании производственных услуг на основе таблиц шапок и строк
// Параметры
// Адрес - идентификатор сессии обмена
// ТаблШапок - таблица значений с "шапками" документов
// ТаблСтрок - таблица значений с данными для табличной части Товары
// ТаблПользователей - Таблица значений с перечнем пользователей которых нужно оповещать о созданных документах
// ТаблКатегорий - Таблица категорий документа
Процедура СоздатьАктОбОказанииПроизводственныхУслуг(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий)
	ДобавитьСообщение("Формируются акты...");
	
	текДата = ТекущаяДата();
	ВремТабл = СоздатьТаблицуСтрокРН(); //временная таблица
	нетОшибок = Истина;
	Для Каждого СтрШапки Из ТаблШапок Цикл
		УникДок = СформироватьУникальныйКодДокумента("Реализация", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		
		СтруктПоиска = Новый Структура;
		СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
		ТаблТовары = ТаблСтрок.Скопировать(СтруктПоиска); //Таблица с товарами в накладной
		ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); //Таблица категорий
		ИтогКолво = ТаблТовары.Итог("Колво"); //проверим пустой документ
		Если ИтогКолво = 0 Тогда
			Ответ = Строка(СтрШапки.ИдДок) + Таб + УникИдентификатор(СсылкаДок) + РазделительСтрок;
			СерверПослатьОтвет(Адрес, Ответ, 0);
			Продолжить;
		КонецЕсли; 
		
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес, Ответ, 0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			нетОшибок = Истина;
			НачатьТранзакцию();
			Попытка
				Док = Документы.АктОбОказанииПроизводственныхУслуг.СоздатьДокумент();
				ЗаполнитьАктОбОказанииПроизводственныхУслуг(Док, СтрШапки, ТаблТовары);	
							
				Если ПараметрыАгента.ПроводитьПродажа Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					Док.Записать();
				КонецЕсли;
										
				Если ПараметрыАгента.ПроводитьПродажа Тогда
					Если Док.Проведен Тогда
						ТекстСтатуса = " (проведен)";
						Если ПараметрыАгента.СоздаватьСчетФактуру Тогда
							//создать счет фактуру с тем же номером
							СоздатьСчетФактуру(Док);
						КонецЕсли;
					Иначе
						ТекстСтатуса = " (не проведен)";
					КонецЕсли;
				КонецЕсли;			
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
			КонецПопытки;
			
			Если нетОшибок Тогда
				ЗаписатьУникКодДокумента(Док, УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
	            //добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект   = Док.ссылка;
				МенеджерЗаписи.Свойство = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект   = Док.ссылка;
				МенеджерЗаписи.Свойство = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение = СтрШапки.Дата;
				МенеджерЗаписи.Записать(Истина);			
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки.Фото, 12);			
				ЗавершитьСобытие(Адрес, Платформа, "Реализация", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				ЗафиксироватьТранзакцию();
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				СерверПослатьОтвет(Адрес, Ответ, 0);			
			Иначе
				ОтменитьТранзакцию();
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ продажа не создан"; 
					Если ПараметрыАгента.ПроводитьПродажа Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Для контрагента " + Док.Контрагент + " не найден договор с покупателем";
					СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл("Ошибка создания документа Продажа: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
	
КонецПроцедуры                      

// Создаёт документ Счет на оплату покупателю на основе таблиц шапок и строк
// Параметры
// Адрес - идентификатор сессии обмена
// ТаблШапок - таблица значений с "шапками" документов
// ТаблСтрок - таблица значений с данными для табличной части Товары
// ТаблПользователей - Таблица значений с перечнем пользователей которых нужно оповещать о созданных документах
// ТаблКатегорий - Таблица категорий документа
Процедура СоздатьСчетНаОплату(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий)
	ДобавитьСообщение("Формируются Счета на оплату...");
	
	текДата = ТекущаяДата();
	ВремТабл = СоздатьТаблицуСтрокРН(); //временная таблица
	нетОшибок = Истина;
	РасчитыватьЦены1С = ПараметрыАгента.РасчитыватьЦены1С;
	Для Каждого СтрШапки Из ТаблШапок Цикл
		УникДок = СформироватьУникальныйКодДокумента("Заказ", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		
		СтруктПоиска = Новый Структура;
		СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
		ТаблТовары = ТаблСтрок.Скопировать(СтруктПоиска); //Таблица с товарами в накладной
		ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); //Таблица категорий
		ИтогКолво = ТаблТовары.Итог("Колво"); //проверим пустой документ
		Если ИтогКолво = 0 Тогда
			Ответ = Строка(СтрШапки.ИдДок) + Таб + УникИдентификатор(СсылкаДок) + РазделительСтрок;
			СерверПослатьОтвет(Адрес, Ответ, 0);
			Продолжить;
		КонецЕсли; 
		
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес, Ответ, 0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			нетОшибок = Истина;
			НачатьТранзакцию();
			Попытка
				Док = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
				
				Док.Дата		= ДатаИзДатаИВремя(СтрШапки.Дата, ТекущаяДата());  //Время поставим текущее
				Док.Склад		= ?(ЗначениеЗаполнено(СтрШапки.Склад), СтрШапки.Склад, ПараметрыАгента.Склады[0].Склад);
				
				Док.Комментарий = СокрЛП(
					?(ЗначениеЗаполнено(СтрШапки.ВремяДоставки),
						"Доставка заказана " + Формат(СтрШапки.ВремяДоставки, "ДЛФ=DD")
						+ " в " + Формат(СтрШапки.ВремяДоставки, "ДФ=ЧЧ:мм"),
						"")
					+ " " + СтрШапки.Комментарий);
								
				Если СоответствиеКонтрагента = 0 Тогда //покупатель = грузополучатель
					Док.Контрагент = СтрШапки.Контрагент;
				Иначе	//холдинг
					Док.Контрагент = СтрШапки.Контрагент.ГоловнойКонтрагент;
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрШапки.Договор) 
					И ((СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
					Или (СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее) И Конфигурация = "БухКазахстан") Тогда
					Док.ДоговорКонтрагента = СтрШапки.Договор;
				Иначе
					Док.ДоговорКонтрагента = ПолучитьДоговораКонтрагента(СтрШапки, Док);
				КонецЕсли;
				глПоследняяОшибкаПроведения = "";
				Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
					ВызовемИсключение = 1 / 0;
				КонецЕсли;
				
				Док.Организация		= Док.ДоговорКонтрагента.Организация;
				УправлениеДенежнымиСредствами.УстановитьБанковскийСчет(Док.СтруктурнаяЕдиница, Док.Организация, мВалютаРегламентированногоУчета);
				Док.ТипЦен	= ?(РасчитыватьЦены1С, ?(ЗначениеЗаполнено(Док.ДоговорКонтрагента.ТипЦен), Док.ДоговорКонтрагента.ТипЦен, СтрШапки.ТипЦены), СтрШапки.ТипЦены);
				Док.ВалютаДокумента			= Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Док.УчитыватьНДС			= ОпределитьУчитыватьНДС(Док.Организация, Док.Дата);
				Док.СуммаВключаетНДС		= Док.ТипЦен.ЦенаВключаетНДС;
				КурсВалюты					= ПолучитьКурсВалюты(Док.ВалютаДокумента,Док.Дата);
				Док.КурсВзаиморасчетов		= КурсВалюты.Курс;
				Док.КратностьВзаиморасчетов	= КурсВалюты.Кратность;
				Док.Ответственный			= ПараметрыАгента.Агент;
				Док.АдресДоставки			= СтрШапки.АдресДоставки;
				Если Конфигурация = "БухКазахстан" Тогда
					//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
					//	Док.Автор = ПараметрыАгента.Агент;
					//КонецЕсли;
					Док.СуммаВключаетАкциз = Док.ТипЦен.ЦенаВключаетАкциз;
				ИначеЕсли Конфигурация = "БухБеларусь" Тогда
				Иначе
					Док.ОрганизацияПолучатель = ?(ЗначениеЗаполнено(Док.СтруктурнаяЕдиница), Док.СтруктурнаяЕдиница.Владелец, Док.Организация);
				КонецЕсли;
				СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентом(Док.Организация, Док.Контрагент, Док.ДоговорКонтрагента, Док.ВалютаДокумента);
				
				СтруктураВалютаКПК = Неопределено;
				Если ПараметрыАгента.ВалютаКПК <> Док.ВалютаДокумента Тогда
					СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
				КонецЕсли;
				
				ДополнительныеПараметры = Новый Структура();
				Для Каждого СтрСтрок Из ТаблТовары Цикл  //по строкам Табличной части
					Если СтрСтрок.Колво = 0 Тогда
						Продолжить;
					КонецЕсли;
					СтрДок = Неопределено;
					стрСумма = СтрСтрок.Сумма;
					Если СтруктураВалютаКПК <> Неопределено Тогда
						стрСумма = ПересчитатьИзВалютыВВалюту(СтрСтрок.Сумма,
							ПараметрыАгента.ВалютаКПК, Док.ВалютаДокумента,
							СтруктураВалютаКПК.Курс, Док.КурсВзаиморасчетов,
							СтруктураВалютаКПК.Кратность, Док.КратностьВзаиморасчетов);
					КонецЕсли;
			
					Если СтрСтрок.Номенклатура.Услуга Тогда
						СтрДок = Док.Услуги.Добавить();
						ЗаполнитьЗначенияСвойств(СтрДок, ДополнительныеПараметры);
						СтрДок.Содержание 	= "услуга";
						СтрДок.Номенклатура	= СтрСтрок.Номенклатура;
						СтрДок.СтавкаНДС	= СтрДок.Номенклатура.СтавкаНДС;
						СтрДок.Количество	= СтрСтрок.Колво;
					Иначе
						СтрДок = Док.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрДок, ДополнительныеПараметры);
						//товары
						СтрДок.Номенклатура	= СтрСтрок.Номенклатура;
						СтрДок.СтавкаНДС	= СтрДок.Номенклатура.СтавкаНДС;
						СтрДок.Количество	= СтрСтрок.Колво;
						Если Док.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
							СтрДок.ЕдиницаИзмерения =  СтрСтрок.Единица;  //СтрДок.Номенклатура.БазоваяЕдиницаИзмерения; // ???
							СтрДок.Коэффициент	= СтрСтрок.Коэффициент;
						КонецЕсли;
						
						Если Конфигурация = "БухБеларусь" Тогда
							Если Док.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Партия") <> Неопределено Тогда 
								СтрДок.Партия = СтрСтрок.Партия;
							КонецЕсли;
						КонецЕсли;
						Если Конфигурация = "БухКазахстан" Тогда
							Если Док.СуммаВключаетАкциз И Док.УчитыватьАкциз Тогда 
								СтрДок.СтавкаАкциза = СтрДок.Номенклатура.СтавкаАкциза;
								ОбработкаТабличныхЧастей.РассчитатьСуммуАкцизаТабЧасти(СтрДок, Док);
							КонецЕсли;
						КонецЕсли;
						ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "15", "0");	
					КонецЕсли;
					
					Если (СтрСтрок.Бонус > 0) И (ПараметрыАгента.СпособПредоставленияБонусов = 0) Тогда
						РасчитыватьЦены1С = Ложь;
					КонецЕсли;
					
					Если РасчитыватьЦены1С Тогда
						ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрДок, Док, мВалютаРегламентированногоУчета); 
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
					Иначе
						СтавкаНДС = ПолучитьСтавкуНДС(СтрДок.СтавкаНДС) / 100;
						СтрДок.Цена = ?(СтрДок.Количество > 0, ?(Док.УчитыватьНДС, ?(Док.СуммаВключаетНДС, СтрСумма, СтрСумма / (1 + СтавкаНДС)), СтрСумма) / СтрДок.Количество, 0);
						СуммаСоСкидкой	= СтрСумма - СтрСумма * СтрШапки.Скидка / 100;
						СтрДок.СуммаНДС = ?(Док.УчитыватьНДС, СуммаСоСкидкой - СуммаСоСкидкой / (1 + СтавкаНДС), 0);
						СтрДок.Сумма	= ?(Док.СуммаВключаетНДС, СуммаСоСкидкой, СуммаСоСкидкой - СтрДок.СуммаНДС);
					КонецЕсли;	
				КонецЦикла; 
				
				Если РасчитыватьЦены1С Тогда     
					ЗаполнитьРеализациюПоАлгоритмам1С(Док);//удаляет бонусы
				КонецЕсли;
				
				Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
					Док.УстановитьНовыйНомер(Док.Организация.Префикс);
				Иначе
					Док.Номер = СтрШапки.Номер;
				КонецЕсли;
				
				//запускаем обработку дополнительных реквизитов			
				ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "14", "0");
				
				Если ПараметрыАгента.ПроводитьЗаказ Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
					ТекстСтатуса = " (проведен)";
				Иначе
					Док.Записать();
					ТекстСтатуса = " (не проведен)";
				КонецЕсли;
				
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
			КонецПопытки;
			
			Если нетОшибок Тогда
				ЗаписатьУникКодДокумента(Док,УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
	            //добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение  = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение  = СтрШапки.ДатаСоздания;
				МенеджерЗаписи.Записать(Истина);			
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки.Фото, 14);			
				ЗавершитьСобытие(Адрес, Платформа, "Заказ", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				ЗафиксироватьТранзакцию();
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				СерверПослатьОтвет(Адрес, Ответ, 0);			
			Иначе
				ОтменитьТранзакцию();
				СообщениеАгентуОбОшибке = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности.";
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = "Неизвестная ошибка"; 
				КонецЕсли;
				Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Для контрагента " + Док.Контрагент + " не найден договор с покупателем";
					СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				КонецЕсли;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл(СообщениеАгентуОбОшибке, ПараметрыАгента.Агент, 0);
				Если СообщениеАгентуОбОшибке <> глПоследняяОшибкаПроведения Тогда 
					ДобавитьВЛогФайл("Ошибка создания документа Заказ: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СерверПослатьОтвет(Адрес, РазделительСтрок, 1);
	
КонецПроцедуры                      

Функция НайтиКассуДляПКО(Организация)
	Касса = Справочники.Кассы.ПустаяСсылка();
	стрОрганизация = ПараметрыАгента.Организации.Найти(Организация, "Организация");
	Если стрОрганизация <> Неопределено Тогда
		Касса = стрОрганизация.Касса;
	КонецЕсли;
	Если Касса.Пустая() Тогда
		ДобавитьОшибку("В настройках агента у организации " + Организация + " не указана Касса.");
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Кассы ГДЕ ВалютаДенежныхСредств = &Валюта И Владелец = &Организация");
		Запрос.УстановитьПараметр("Валюта", мВалютаРегламентированногоУчета);
		Запрос.УстановитьПараметр("Организация", Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Касса = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Касса;
КонецФункции

//создает документПКО с указанным набором параметров
//Параметры
//Дата - дата документа на КПК
//Контрагент - контрагент установленный в документе на КПК
//Договор - договор установленный в документе на КПК
//Организация - организация которую необходимо указать в документе
//ИдДок - идентификатор документа
//Комментарий - комментарий к документу из КПК
//Пр - флаг ПР из КПК
//СуммаПКО* - Оставшаяся сумма ПКО которую необходимо распределить в этом документа
//			  При формировании документа значение суммы будет изменяться в соответствии с документами основаниями
//Номер - номер документа в КПК
//ВремяРаботы - время работы над документом
//УникДок - уникальный код документа
//ДопРеквизиты - Дополнительные реквизиты к документу
//ТаблОснований - таблица Документов Оснований - содержит 3 колонки Договор, ДокументОснование и Организация
//ТаблКатегорий - таблица категорий для документа
//ТаблПользователей - таблица пользователей для механизма оповещения
//возвращает ссылку на созданный документ ПКО
Функция СоздатьДокументПКО(Адрес, СШ, СуммаПКО, УникДок, ТаблКатегорий, ТаблПользователей, ТаблОснований, НомераИз1С)
	
	Последний = ?(ТаблОснований.Количество() > 0, Ложь, Истина);
	Док = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	текДата = ТекущаяДата();
	
	Док.Дата			= ДатаИзДатаИВремя(СШ.Дата, текДата);
	Док.ВидОперации		= Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
	Док.Ответственный   = ПараметрыАгента.Агент;
	Док.ВалютаДокумента	= мВалютаРегламентированногоУчета;
	Док.Контрагент		= СШ.Контрагент;
	Док.ПринятоОт		= Док.Контрагент.НаименованиеПолное;
	//Док.Комментарий		= "" + СШ.ИдДок + " " + СШ.Комментарий;
	Док.Комментарий		= СШ.Комментарий;
	Док.СтатьяДвиженияДенежныхСредств = ПараметрыАгента.СтатьяДвиженияДенежныхСредств;
	Док.СчетКасса = ПараметрыАгента.СчетУчетаДенежныхСредств;
	
	Док.СуммаДокумента = 0;
	Если Последний Тогда
		Док.ДоговорКонтрагента = ПолучитьДоговораКонтрагента(СШ, Док);
	Иначе	
		Док.ДоговорКонтрагента = ТаблОснований[0].Договор;
	КонецЕсли;
	Док.Организация	= Док.ДоговорКонтрагента.Организация;
	
	запросДолгПоДокументу = Новый Запрос(
	"ВЫБРАТЬ
	|	Долги.СуммаРазвернутыйОстатокДт - Долги.СуммаРазвернутыйОстатокКт КАК СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрБухгалтерии." + РегБух + ".Остатки(
	|			&Дата,
	|			НЕ Счет.Забалансовый
	|				И НЕ Счет В ИЕРАРХИИ (&ИсключенныеСчета),
	|			&ВидыСубконтоКД,
	|			Субконто2.ВидДоговора В (&ВидыДоговоров)		
	//|				И Субконто3 = &Документ
	|) КАК Долги
	|ГДЕ Долги.СуммаРазвернутыйОстатокДт - Долги.СуммаРазвернутыйОстатокКт > 0");
	запросДолгПоДокументу.УстановитьПараметр("ВидыСубконтоКД",	МассивыВидовСубконто[1]);
	запросДолгПоДокументу.УстановитьПараметр("ВидыДоговоров",	ПолучитьМассивВидовДоговоров());
	запросДолгПоДокументу.УстановитьПараметр("ИсключенныеСчета",СтандартныеОтчеты.ПолучитьСписокСчетовИсключаемыхИзРасчетаЗадолженности(1));
	запросДолгПоДокументу.УстановитьПараметр("Дата",			КонецДня(ТекущаяДата()) + 1);
		
	запросДолгПоДоговору = Новый Запрос(
	"ВЫБРАТЬ
	|	Долги.СуммаРазвернутыйОстатокДт - Долги.СуммаРазвернутыйОстатокКт КАК СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрБухгалтерии." + РегБух + ".Остатки(
	|			&Дата,
	|			НЕ Счет.Забалансовый
	|				И НЕ Счет В ИЕРАРХИИ (&ИсключенныеСчета),
	|			&ВидыСубконтоКД,
	|			Субконто2.ВидДоговора В (&ВидыДоговоров)
	|				И Субконто2 = &Договор) КАК Долги
	|ГДЕ Долги.СуммаРазвернутыйОстатокДт - Долги.СуммаРазвернутыйОстатокКт > 0");		
	запросДолгПоДоговору.УстановитьПараметр("ВидыСубконтоКД",	МассивыВидовСубконто[1]);
	запросДолгПоДоговору.УстановитьПараметр("ВидыДоговоров",	ПолучитьМассивВидовДоговоров());
	запросДолгПоДоговору.УстановитьПараметр("ИсключенныеСчета",	СтандартныеОтчеты.ПолучитьСписокСчетовИсключаемыхИзРасчетаЗадолженности(1));
	запросДолгПоДоговору.УстановитьПараметр("Дата",				КонецДня(ТекущаяДата()) + 1);
	
	СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентом(Док.Организация, Док.Контрагент, Док.ДоговорКонтрагента, Док.ВалютаДокумента);
	
	Если Конфигурация = "БухКазахстан" Тогда
		//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
		//	Док.Автор = ПараметрыАгента.Агент;
		//КонецЕсли;
		Док.УчитыватьКПН		= ОрганизацияПлательщикКПН(Док.Организация);
		Если Док.УчитыватьКПН Тогда
			Док.ВидУчетаНУ		= Справочники.ВидыУчетаНУ.НУ;
		КонецЕсли;
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.БанковскиеСчета
		|ГДЕ НЕ ПометкаУдаления И Владелец = &Организация И ВалютаДенежныхСредств = &Валюта");
		Запрос.УстановитьПараметр("Организация", Док.Организация);
		Запрос.УстановитьПараметр("Валюта", Док.ВалютаДокумента);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Док.СчетОрганизации = Выборка.Ссылка;
		КонецЕсли;
		Док.Касса = НайтиКассуДляПКО(Док.Организация);
	ИначеЕсли Конфигурация = "БухБеларусь" Тогда
	Иначе
		Док.ПодразделениеОрганизации	= ПараметрыАгента.Подразделение;
	КонецЕсли;	
	
	СтруктПоиска = Новый Структура;
	СтруктПоиска.Вставить("ИдДок", СШ.ИдДок);
	ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); 	
	СуммаПлатежаПоСтроке = 0;
	КурсРегл = ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, Док.Дата);
	Док.ВалютаДокумента = мВалютаРегламентированногоУчета;
	Док.КурсДокумента = КурсРегл.Курс;
	Док.КратностьДокумента = КурсРегл.Кратность;

	Для каждого ДО Из ТаблОснований Цикл
		Если СуммаПКО <= 0 Тогда 
			Прервать;
		КонецЕсли;
		
		Валюта = мВалютаРегламентированногоУчета;
		ДатаВалюты = текДата;
		
		Стр = Док.РасшифровкаПлатежа.Добавить();
		Если ЗначениеЗаполнено(ДО.Документ) Тогда
			КурсВалюты = ПолучитьКурсВалюты(ДО.Документ.ДоговорКонтрагента.ВалютаВзаиморасчетов, Док.Дата);
			запросДолгПоДокументу.УстановитьПараметр("Документ", ДО.Документ);   
			результатЗапроса = запросДолгПоДокументу.Выполнить().Выбрать();
			Если результатЗапроса.Следующий() Тогда
				СуммаДокумента = результатЗапроса.СуммаВзаиморасчетовОстаток;
			Иначе
				СуммаДокумента = ДО.Документ.СуммаДокумента;
				Попытка
					СуммаДокумента = ?(ДО.Документ.СуммаВключаетНДС, 
						ДО.Документ.СуммаДокумента, 
						ДО.Документ.СуммаДокумента + ДО.Документ.СуммаНДС);
				Исключение
				КонецПопытки;                    
			КонецЕсли;
			Валюта = ДО.Документ.ВалютаДокумента;
			ДатаВалюты = Док.Дата;
		Иначе
			запросДолгПоДоговору.УстановитьПараметр("Договор", ДО.Договор);
			Выборка = запросДолгПоДоговору.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СуммаДокумента = Выборка.СуммаВзаиморасчетовОстаток;
				Валюта = ДО.Договор.ВалютаВзаиморасчетов;
			Иначе
				//если по договору нет долга - списываем на него все
				СуммаПлатежаПоСтроке = СуммаПКО;				
			КонецЕсли;			
		КонецЕсли;
		КурсВалюты = ПолучитьКурсВалюты(Валюта, ДатаВалюты);
		СуммаПлатежаПоСтроке = ПересчитатьИзВалютыВВалюту(СуммаДокумента, Валюта, мВалютаРегламентированногоУчета,
			КурсВалюты.Курс, Док.КурсДокумента, КурсВалюты.Кратность, Док.КратностьДокумента);
		
		СуммаПлатежаПоСтроке = ?(СуммаПКО > СуммаПлатежаПоСтроке, СуммаПлатежаПоСтроке, СуммаПКО);
		Если Конфигурация = "БухКазахстан" Тогда
			Стр.СчетУчетаРасчетовСКонтрагентомБУ = СчетаУчета.СчетРасчетовПокупателя;
			//Стр.СчетУчетаРасчетовСКонтрагентомНУ = ;
		ИначеЕсли Конфигурация = "БухБеларусь" Тогда
			Стр.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
		Иначе
			Стр.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			Стр.СпособПогашенияЗадолженности = ?(ЗначениеЗаполнено(Стр.Сделка), Перечисления.СпособыПогашенияЗадолженности.ПоДокументу, Перечисления.СпособыПогашенияЗадолженности.Автоматически);
		КонецЕсли;	
		Стр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансовПокупателя;
		Стр.Сделка							= ДО.Документ;
		Стр.ДоговорКонтрагента				= ДО.Договор;
		Стр.КратностьВзаиморасчетов			= КурсВалюты.Кратность;
		Стр.КурсВзаиморасчетов				= КурсВалюты.Курс;
		Стр.СтатьяДвиженияДенежныхСредств	= Док.СтатьяДвиженияДенежныхСредств;
		Стр.СуммаПлатежа					= СуммаПлатежаПоСтроке;
		Док.СуммаДокумента					= Док.СуммаДокумента + СуммаПлатежаПоСтроке;
		Стр.СуммаВзаиморасчетов = ПересчитатьИзВалютыВВалюту(СуммаПлатежаПоСтроке, мВалютаРегламентированногоУчета, Валюта,
			Док.КурсДокумента, КурсВалюты.Курс, Док.КратностьДокумента, КурсВалюты.Кратность);
			
		СуммаПКО = СуммаПКО - СуммаПлатежаПоСтроке;
	КонецЦикла;
	
	Если Последний Тогда
		//Если оснований нет, то необходимо сформировать ПКО на организацию и договор указанные в шапке
		//или по удовлетворяещему договору
		КурсВалюты = ПолучитьКурсВалюты(Док.ДоговорКонтрагента.ВалютаВзаиморасчетов, Док.Дата);

		Стр = Док.РасшифровкаПлатежа.Добавить();
		Если Конфигурация = "БухКазахстан" Тогда
			Стр.СчетУчетаРасчетовСКонтрагентомБУ = СчетаУчета.СчетРасчетовПокупателя;
			//Стр.СчетУчетаРасчетовСКонтрагентомНУ = ;
		Иначе
			Стр.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			//Стр.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
		КонецЕсли;	
		Стр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансовПокупателя;
		Стр.ДоговорКонтрагента				= Док.ДоговорКонтрагента;
		Стр.КратностьВзаиморасчетов			= КурсВалюты.Кратность;
		Стр.КурсВзаиморасчетов				= КурсВалюты.Курс;
		Стр.СтатьяДвиженияДенежныхСредств	= Док.СтатьяДвиженияДенежныхСредств;
		Стр.СуммаПлатежа					= СуммаПКО;
		Док.СуммаДокумента					= Док.СуммаДокумента + Стр.СуммаПлатежа;
		Стр.СуммаВзаиморасчетов				= Окр(СуммаПКО * ?(КурсВалюты.Кратность = 0, 1, КурсВалюты.Кратность) / ?(КурсВалюты.Курс = 0, 1, КурсВалюты.Курс), 2);
		Стр.СуммаВзаиморасчетов = ПересчитатьИзВалютыВВалюту(СуммаПКО, мВалютаРегламентированногоУчета, Док.ДоговорКонтрагента.ВалютаВзаиморасчетов,
			Док.КурсДокумента, КурсВалюты.Курс, Док.КратностьДокумента, КурсВалюты.Кратность);
		СуммаПКО = 0;
	КонецЕсли;                                               

	Реквизиты=СтрЗаменить(СШ.ДопРеквизиты,Символ(30),РазделительСтрок);
	Для Н=1 По СтрЧислоСтрок(Реквизиты) Цикл
		РеквЗнач=СтрЗаменить(СтрПолучитьСтроку(Реквизиты,Н),Символ(31),РазделительСтрок);
		Если СтрЧислоСтрок(РеквЗнач) <> 2 Тогда Продолжить; КонецЕсли;
		
		Ид=СтрПолучитьСтроку(РеквЗнач, 1);
		Значение=СтрПолучитьСтроку(РеквЗнач, 2);
	КонецЦикла;
	
	Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда
		Док.УстановитьНовыйНомер(Док.Организация.Префикс);
	Иначе
		Если НомераИз1С Тогда
		Иначе
			Док.Номер = СШ.Номер;
		КонецЕсли;
	КонецЕсли;
	
	Док.Экспедитор = Док.Ответственный.ФизЛицо;
	
	//запускаем обработку дополнительных реквизитов			
	ОбработатьДопРеквизитыДокумента(Док, СШ.ДопРеквизиты, "18", "0");
	Док.Записать();
	
	Если НомераИз1С И (НЕ ПараметрыАгента.СпособНумерацииДокументов = 0) Тогда
		ДобавитьВЛогФайл("Для документа " + Док + " номер установлен автоматически, и не соответствует номеру с КПК", ТекущийАгент);
	КонецЕсли;
	
	ЗаписатьУникКодДокумента(Док, УникДок);
	//заполнить категории документа
	ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
	//добавить свойство Время работы с документом
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект    = Док.ссылка;
	МенеджерЗаписи.Свойство  = ПВХУВремяСозданияДокумента;
	МенеджерЗаписи.Значение  = Строка(СШ.ВремяРаботы);
	МенеджерЗаписи.Записать(Истина);			
	
	ЗаписатьФотоДокумента(Док.Ссылка, СШ.Фото, 18);
	
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект    = Док.ссылка;
	МенеджерЗаписи.Свойство  = ПВХФотоДокумента;
	МенеджерЗаписи.Значение  = СШ.Фото;
	МенеджерЗаписи.Записать(Истина);			
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект    = Док.ссылка;
	МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
	МенеджерЗаписи.Значение  = СШ.ДатаСоздания;
	МенеджерЗаписи.Записать(Истина);
	
	НомераИз1С = Истина;
	Возврат Док;
КонецФункции

//Разбирает запрос на загрузку ПКО и помещает данные в таблицу шапок
// Адрес - идентификатор сессии обмена
// ТекстЗапроса - строка полученная с КПК
// Агент - для кого выгружаем
Функция ЗагрузитьПКО(Адрес, Платформа, ТекстЗапроса)
	ДобавитьВЛогФайл("Загружаются ПКО", ПараметрыАгента.Агент, 1);
	
	СерверПослатьОтвет(Адрес, "OK" + РазделительСтрок, 0);
	
	ТаблШапок = Новый ТаблицаЗначений;
	ТаблШапок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблШапок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблШапок.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблШапок.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов("ТаблицаЗначений"));
	ТаблШапок.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Проводной", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("СуммаПКО", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблШапок.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата"));	
	ТаблШапок.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));//время работы с документом в минутах	
	ТаблШапок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Задание", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фото", Новый ОписаниеТипов("Строка"));	
	ТаблШапок.Колонки.Добавить("РН", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	ТаблШапок.Колонки.Добавить("Время", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка"));
	
	ТаблКатегорий = Новый ТаблицаЗначений;
	ПолучитьТаблицуКатегорий(ТаблКатегорий);
	
	СпрОрганизации = Справочники.Организации;
	СпрКл = Справочники.Контрагенты;
	СпрДог = Справочники.ДоговорыКонтрагентов;
	
	Н = 5;
	КолСтр = СтрЧислоСтрок(ТекстЗапроса);
	Пока Н <= КолСтр Цикл
		ТекСтр=СтрПолучитьСтроку(ТекстЗапроса,Н);
		
		НовСтр=ТаблШапок.Добавить();
		ИДДок="";
		КолПарам = СтрЧислоВхождений(ТекСтр,Таб)+1;
		НомПарам = 1;
		Пока НомПарам<=КолПарам Цикл
			Парам="";
			ПозРазд=Найти(ТекСтр,Таб);
			Если ПозРазд<>0 Тогда
				Парам=Лев(ТекСтр,ПозРазд-1);
				ТекСтр=Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам=ТекСтр;
				ТекСтр="";
			КонецЕсли;
			
			Если НомПарам=1 Тогда
				ДатаВремя = ДатаИзСтрокиСКПК(Парам);
				НовСтр.Время = Сред(Парам,12); 
				НовСтр.Дата  = ДатаВремя;
			ИначеЕсли НомПарам=2 Тогда 
				ИДДок = Парам;
				НовСтр.ИдДок = Парам; 
			ИначеЕсли НомПарам=3 Тогда 
				НовСтр.Номер = Прав(Парам,11); 
			ИначеЕсли НомПарам=4 Тогда
				НайденныйОбъект = Справочники.Организации.НайтиПоКоду(Парам);
				Если НайденныйОбъект.Пустая() Тогда
					ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная организация с кодом " + Парам);
				Иначе	
					НовСтр.Организация = НайденныйОбъект;	
				КонецЕсли;
			ИначеЕсли НомПарам = 5 Тогда
				мКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
				мАдресДоставки = "";
				
				ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
				Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
					ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
					Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
						Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
							ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;

				
				ПолучитьКонтрагентаИАдресПоКоду(Парам, мКонтрагент, мАдресДоставки, ПапкаРодителя);
				Если мКонтрагент.Пустая() Тогда
					ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестный контрагент с кодом " + Парам);
				Иначе	
					НовСтр.Контрагент = мКонтрагент;	
				КонецЕсли;
			ИначеЕсли НомПарам = 6 Тогда  //договор
				Если ЗначениеЗаполнено(Парам) Тогда
					Договор = ?(ПустаяСтрока(Парам), 
						Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), 
						Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(Парам))));
					Если Договор.Пустая() Тогда
						ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестный договор с кодом " + Парам);
					Иначе	
						НовСтр.Договор = Договор;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НомПарам = 7 Тогда // Документ основание
				Рез=Новый ТаблицаЗначений;
				Рез.Колонки.Добавить("Документ");
				Рез.Колонки.Добавить("Договор");
				Рез.Колонки.Добавить("Организация");
				
				Если Не ПустаяСтрока(Парам) Тогда
					Ссылка=Неопределено;
					Основания=СтрЗаменить(Парам,Символ(31),РазделительСтрок);
					ТипыДокументов = Метаданные.Документы.ПриходныйКассовыйОрдер.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты.Сделка.Тип.Типы();
					ТипыДоговоров=Метаданные.Документы.ПриходныйКассовыйОрдер.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты.ДоговорКонтрагента.Тип.Типы();
					Для НомерОснования=1 По СтрЧислоСтрок(Основания) Цикл
						стрДокОснование = рез.Добавить();
						Основание=СтрПолучитьСтроку(Основания,НомерОснования);
						Части=СтрЗаменить(Основание,"_", РазделительСтрок);
						ОснованиеДокумент = СтрПолучитьСтроку(Части,1);
						ОснованиеДоговор = "";
						Если СтрЧислоСтрок(Части)=2 Тогда
							ОснованиеДоговор = СтрПолучитьСтроку(Части,2);
						КонецЕсли;
						стрДокОснование.Документ = Неопределено;
						ИдОсн=Новый УникальныйИдентификатор(ВернутьПробелыGUID(ОснованиеДокумент));
						Для Каждого Тип Из ТипыДокументов Цикл
							ИдТипаДок=Метаданные.НайтиПоТипу(Тип).Имя;
							Ссылка=Документы[ИдТипаДок].ПолучитьСсылку(ИдОсн);
							Если Ссылка.ПолучитьОбъект()=Неопределено Тогда 
								Продолжить; 
							КонецЕсли;
							стрДокОснование.Документ = Ссылка;
							Прервать;
						КонецЦикла;
						Если ЗначениеЗаполнено(стрДокОснование.Документ) Тогда
							Договор = стрДокОснование.Документ.ДоговорКонтрагента;
						КонецЕсли;
						стрДокОснование.Договор = ?(ЗначениеЗаполнено(Договор), Договор,
						?(ПустаяСтрока(ОснованиеДоговор), Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
						Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(ОснованиеДоговор)))));
						стрДокОснование.Организация = ?(стрДокОснование.Договор.Пустая(), 
							Справочники.Организации.ПустаяСсылка(), 
							стрДокОснование.Договор.Организация);
						Если стрДокОснование.Организация.Пустая() Или стрДокОснование.Договор.Пустая() Тогда
							рез.Удалить(стрДокОснование);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				НовСтр.ДокументОснование = Рез;
			ИначеЕсли НомПарам=8 Тогда
				НовСтр.Комментарий = Парам; 
			ИначеЕсли НомПарам=9 Тогда 
				НовСтр.Проводной = Число(Парам);
			ИначеЕсли НомПарам=10 Тогда 
				НовСтр.СуммаПКО = Число(Парам);
			ИначеЕсли НомПарам=11 Тогда 
				НовСтр.ДатаСоздания=ДатаИзСтрокиСКПК(Парам);
			ИначеЕсли НомПарам=12 Тогда 
				НовСтр.ВремяРаботы  = Число(Парам);
			ИначеЕсли НомПарам=13 Тогда 
				НовСтр.ДопРеквизиты = Парам;
			ИначеЕсли НомПарам=14 Тогда 
				НовСтр.Задание = Парам;
			ИначеЕсли НомПарам=15 Тогда 
				НовСтр.Фото = СтрЗаменить(Парам, Символ(31), РазделительСтрок);
			ИначеЕсли НомПарам=16 Тогда
//				ДобавитьВЛогФайл("Неверный формат шапки ПКО",ПараметрыАгента.Агент,0);
//				Возврат Ложь;
			КонецЕсли;
			
			НомПарам=НомПарам+1;
		КонецЦикла;
		//заполнить таблицу категорий
		Н = Н + 1;
		ТекСтр = СтрПолучитьСтроку(ТекстЗапроса,Н);
		Пока ТекСтр<>"" Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр,Таб);
			Если ПозРазд<>0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд-1);
				ТекСтр = Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			НайденныйОбъект = НайтиОбъектКатегория(Парам);
			Если ЗначениеЗаполнено(НайденныйОбъект) Тогда
				НовСтр = ТаблКатегорий.Добавить();
		        НовСтр.ИдДок = ИдДок;
    			НовСтр.Категория = НайденныйОбъект;
			КонецЕсли; 
		КонецЦикла;
		Н=Н+1;
	КонецЦикла;
	// Создаём Приходные кассовые ордера
	ТаблПользователей = ПрочитатьПользователейДляОповещения(ПараметрыАгента.Агент); //это Табл значений
	
	ДобавитьВЛогФайл("Формируются ПКО...", ПараметрыАгента.Агент, 1);
	
	СуммаПлатежаПоСтроке = 0;
	ТекДата = ТекущаяДата();
	НомераИз1С = Ложь;
	
	Для Каждого СтрШапки Из ТаблШапок Цикл
		Если СтрШапки.СуммаПКО <=0 Тогда 
			Продолжить; 
		КонецЕсли;
		УникДок = СформироватьУникальныйКодДокумента("ПКО", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес, Ответ, 0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		НомераИз1С = Ложь;
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			НачатьТранзакцию();
			глПоследняяОшибкаПроведения = "";
			нетОшибок = Истина;
			Попытка
				СуммаПКО = СтрШапки.СуммаПКО;
				Если ПараметрыАгента.ВалютаКПК <> мВалютаРегламентированногоУчета Тогда
					СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
						ДатаИзДатаИВремя(СтрШапки.Дата, ТекущаяДата()), Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
					СуммаПКО = ПересчитатьИзВалютыВВалюту(СтрШапки.СуммаПКО,
						ПараметрыАгента.ВалютаКПК, мВалютаРегламентированногоУчета,
						СтруктураВалютаКПК.Курс, 1,
						СтруктураВалютаКПК.Кратность, 1);
					КонецЕсли;
					
				ТабДок = Новый ТаблицаЗначений;
				ТабДок.Колонки.Добавить("Док", Новый ОписаниеТипов("ДокументОбъект.ПриходныйКассовыйОрдер"));
				Док = Неопределено;
				
				СтрокиНаУдаление = СтрШапки.ДокументОснование.НайтиСтроки(Новый Структура("Договор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка()));
				Для Каждого Стр Из СтрокиНаУдаление Цикл
					СтрШапки.ДокументОснование.Удалить(Стр);
				КонецЦикла;
				тзОрганизации = СтрШапки.ДокументОснование.Скопировать();
				тзОрганизации.Свернуть("Организация");
				Для каждого СтрОрганизация из тзОрганизации Цикл
					ТабОснования = СтрШапки.ДокументОснование.Скопировать(СтрШапки.ДокументОснование.НайтиСтроки(
						Новый Структура("Организация", СтрОрганизация.Организация)));
					Док = СоздатьДокументПКО(Адрес, СтрШапки, СуммаПКО, УникДок, ТаблКатегорий, ТаблПользователей, ТабОснования, НомераИз1С);
					СтрТабДок = ТабДок.Добавить();
					СтрТабДок.Док = Док;
				КонецЦикла;
				//здесь завершена обработка по организациям
				
				//Если осталось невостребованное ПКО, то оформим и его, если указан договор - то на договор иначе на основной по контрагенту								
				Если СуммаПКО > 0 Тогда
					Док = СоздатьДокументПКО(
						Адрес, СтрШапки, СуммаПКО, УникДок, ТаблКатегорий, ТаблПользователей, Новый ТаблицаЗначений(), НомераИз1С);
					Если Док.СуммаДокумента > 0 Тогда
						СтрТабДок = ТабДок.Добавить();
						СтрТабДок.Док = Док;
					КонецЕсли;
				КонецЕсли;
				
				ЗавершитьСобытие(Адрес, Платформа, "ПКО", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				
				Если ПараметрыАгента.ПроводитьПКО Тогда
					Для Каждого Стр Из ТабДок Цикл
						ТекстСтатуса = " (не проведен)";
						Стр.Док.Записать(РежимЗаписиДокумента.Проведение);
						ТекстСтатуса = " (проведен)";
					КонецЦикла;
				КонецЕсли;
				
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ЗафиксироватьТранзакцию();
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
			КонецПопытки;
			Если нетОшибок Тогда
			Иначе
				ОтменитьТранзакцию();
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ ПКО не создан"; 
					Если ПараметрыАгента.ПроводитьПКО Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Для контрагента " + Док.Контрагент + " не найден договор с покупателем";
					СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл("Ошибка создания документа ПКО: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СерверПослатьОтвет(Адрес, РазделительСтрок, 1);
	Возврат истина;
	
КонецФункции

// Создаёт таблицы шапок и строк документов, загружаемых с КПК
// Параметры:
// 		ТелоЗапроса - Строка, текст запроса, поступившего с КПК
// 		НачСтр - Число, номер строки, начиная с которой идут данные о документе
// 		ТаблШапок - ТаблицаЗначений, сюда возвращается таблица со всеми реквизитами шапок
// 			загруженных документов в соответствии с протоколом обмена
// 		ТаблСтрок - ТаблицаЗначений, сюда возвращается таблица со всеми реквизитами строк
// 			загруженных документов в соответствии с протоколом обмена
// 		ТаблКатегорий - ТаблицаЗначений, сюда возвращается таблица со всеми значениями категорий
// 			загруженных документов в соответствии с протоколом обмена
// Возвращаемое значение:
// 		Истина - успешная загрузка
// 		Ложь - ошибка
Функция ПолучитьТаблицыНакладных(ТелоЗапроса, НачСтр, ТаблШапок, ТаблСтрок, ТаблКатегорий)
	ТаблШапок = Новый ТаблицаЗначений;
	ТаблШапок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблШапок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблШапок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблШапок.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблШапок.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблШапок.Колонки.Добавить("Самовывоз", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ТипЦены", Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры"));
	ТаблШапок.Колонки.Добавить("Проводной", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("СуммаПКО", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("ВремяДоставки", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("РН", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	ТаблШапок.Колонки.Добавить("Время", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Форма", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата")); //Дата и время создания документа
	ТаблШапок.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));//время работы с документом в минутах
	ТаблШапок.Колонки.Добавить("Задание", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ИдКонтрагента", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(32, ДопустимаяДлина.Переменная)));
	ТаблШапок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фото", Новый ОписаниеТипов("Строка"));
	
	ТаблСтрок = СоздатьТаблицуСтрокРН();
	//
	ВремТаблСтрок = ТаблСтрок.Скопировать();
	//
	ПолучитьТаблицуКатегорий(ТаблКатегорий);

	Н = НачСтр;
	КолСтр = СтрЧислоСтрок(ТелоЗапроса);
	Пока Н <= КолСтр Цикл
		ТекСтр=СтрПолучитьСтроку(ТелоЗапроса, Н);
		НовСтр	 = ТаблШапок.Добавить();
		ИДДок    = "";
		КолПарам = СтрЧислоВхождений(ТекСтр, Таб) + 1;
		НомПарам = 1;
		Пока НомПарам <= КолПарам Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр, Таб);
			Если ПозРазд <> 0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд - 1);
				ТекСтр = Сред(ТекСтр,ПозРазд + 1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			
			Если НомПарам = 1 Тогда 
				ДатаВремя = ДатаИзСтрокиСКПК(Парам);
				НовСтр.Время = Сред(Парам, 12); 
				НовСтр.Дата  = ДатаВремя;
			ИначеЕсли НомПарам = 2 Тогда 
				ИдДок = Парам;
				НовСтр.ИдДок = Парам; 
			ИначеЕсли НомПарам = 3 Тогда 
				НовСтр.Номер = Прав(Парам, 11); 
			ИначеЕсли НомПарам = 4 Тогда  //организация
				НайденныйОбъект = Справочники.Организации.НайтиПоКоду(Парам);
				Если НайденныйОбъект.Пустая() Тогда
					ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная организация с кодом " + Парам);
				Иначе	
					НовСтр.Организация = НайденныйОбъект;	
				КонецЕсли;
			ИначеЕсли НомПарам = 5 Тогда //контрагент
				НовСтр.ИдКонтрагента = Парам; //уникальный код контрагента для хранения остатков
				мКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
				мАдресДоставки = "";
				
				ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
				Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
					ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
					Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
						Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
							ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;

				ПолучитьКонтрагентаИАдресПоКоду(Парам, мКонтрагент, мАдресДоставки, ПапкаРодителя);
				Если мКонтрагент.Пустая() Тогда
					ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестный контрагент с кодом " + Парам);
				Иначе	
					НовСтр.Контрагент		= мКонтрагент;
					НовСтр.АдресДоставки	= мАдресДоставки;
				КонецЕсли;
			ИначеЕсли НомПарам = 6 Тогда  //договор
				Если ЗначениеЗаполнено(Парам) Тогда
					Договор = ?(ПустаяСтрока(Парам), 
						Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), 
						Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(Парам))));
					Если Договор.Пустая() Тогда
						ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестный договор с кодом " + Парам);
					Иначе	
						НовСтр.Договор = Договор;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НомПарам = 7 Тогда  //Склад
				НайденныйОбъект = ПолучитьСсылкуПоGUID(Парам,"Склады");
				НовСтр.Склад = НайденныйОбъект;
				
			ИначеЕсли НомПарам = 8 Тогда  //Самовывоз
				НовСтр.Самовывоз = ПолучитьЧислоИзСтроки(Парам);
				
			ИначеЕсли НомПарам = 9 Тогда //комментарий
				НовСтр.Комментарий = Парам; 
				
			ИначеЕсли НомПарам = 10 Тогда  //тип цен 
				НайденныйОбъект = ПолучитьСсылкуПоGUID(Парам,"ТипыЦенНоменклатуры");
				Если НайденныйОбъект.Пустая() Тогда
					ДобавитьОшибку(
						"Загрузка накладной "+ИдДок+".Неизвестный тип цен с кодом "+Парам 
						+ ". Будет использован тип цен по умолчанию");
					НовСтр.ТипЦены = ПараметрыАгента.ТипЦенПоУмолчанию;
				Иначе
					НовСтр.ТипЦены = НайденныйОбъект;
				КонецЕсли;
				
			ИначеЕсли НомПарам = 11 Тогда //Проводной
				НовСтр.Проводной = ПолучитьЧислоИзСтроки(Парам);
				
			ИначеЕсли НомПарам = 12 Тогда //СуммаПКО
				НовСтр.СуммаПКО = ПолучитьЧислоИзСтроки(Парам);
				
			ИначеЕсли НомПарам = 13 Тогда  //ВремяДоставки
				Если НЕ ПустаяСтрока(Парам) Тогда
					НовСтр.ВремяДоставки = ДатаИзСтрокиСКПК(Парам);
				КонецЕсли;
			ИначеЕсли НомПарам = 14 Тогда //Скидка
				Если ПустаяСтрока(Парам) = 0 Тогда
					НовСтр.Скидка = Число(Парам);
				Иначе
					НовСтр.Скидка = 0;
				КонецЕсли;
			ИначеЕсли НомПарам = 15 Тогда //Форма
				НовСтр.Форма   = Парам;
			ИначеЕсли НомПарам = 16 Тогда //Ответ
				НовСтр.Ответ   = Парам;
			ИначеЕсли НомПарам = 17 Тогда //Дата создания документа
				НовСтр.ДатаСоздания = ДатаИзСтрокиСКПК(Парам);
			ИначеЕсли НомПарам = 18 Тогда //Время работы с документом
				НовСтр.ВремяРаботы = Окр(Число(Парам)/60,0,РежимОкругления.Окр15как20);
			ИначеЕсли НомПарам = 19 Тогда //Доп реквизиты
				НовСтр.ДопРеквизиты  = Парам;
			ИначеЕсли НомПарам = 20 Тогда //Задание
				НовСтр.Задание  = Парам;
			ИначеЕсли НомПарам = 21 Тогда //Фото
				НовСтр.Фото  = СтрЗаменить(Парам, Символ(31), РазделительСтрок);
			Иначе
				//ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неверный формат шапки накладной");
				//Возврат Ложь;
			КонецЕсли;
			
			НомПарам = НомПарам + 1;
		КонецЦикла;
		
		//заполнить таблицу категорий
		Н = Н + 1;
		ТекСтр = СтрПолучитьСтроку(ТелоЗапроса, Н);
		Пока ТекСтр <> "" Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр, Таб);
			Если ПозРазд <> 0 Тогда
				Парам  = Лев(ТекСтр, ПозРазд - 1);
				ТекСтр = Сред(ТекСтр, ПозРазд + 1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			НайденныйОбъект = НайтиОбъектКатегория(Парам);
			Если ЗначениеЗаполнено(НайденныйОбъект) Тогда
				НовСтр = ТаблКатегорий.Добавить();
		        НовСтр.ИдДок = ИдДок;
    			НовСтр.Категория = НайденныйОбъект;
			КонецЕсли; 
        КонецЦикла;
			
		Пока Истина Цикл
			Н = Н + 1;
			Если Н > КолСтр Тогда 
				Прервать; 
			КонецЕсли;
			
			ТекСтр = СтрПолучитьСтроку(ТелоЗапроса, Н);
			Если ТекСтр = "" Тогда 
				Прервать; 
			КонецЕсли;
			
			НовСтр = ВремТаблСтрок.Добавить();
			НовСтр.ИдДок = ИдДок;
			ТекНоменклатура = "";
			КолПарам = СтрЧислоВхождений(ТекСтр, Таб) + 1;
			НомПарам = 1;
			Пока НомПарам <= КолПарам Цикл

				Парам = "";
				ПозицияТаб = Найти(ТекСтр, Таб);
				Если ПозицияТаб <> 0 Тогда
					Парам  = Лев(ТекСтр, ПозицияТаб - 1);
					ТекСтр = Сред(ТекСтр, ПозицияТаб + 1);
				Иначе
					Парам  = ТекСтр;
					ТекСтр = "";
				КонецЕсли;
				
				Если НомПарам = 1 Тогда   //Номенклатура
					НовСтр.Партия = "";
					Если Конфигурация = "БухБеларусь" Тогда
						ПарамНом = СтрЗаменить(Парам, "#", Символы.ПС);
						спрНом = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(ПарамНом,1), "Номенклатура");
						Если СтрЧислоСтрок(ПарамНом) =2 Тогда
							НовСтр.Партия = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(ПарамНом,2), "Партии");
							Если спрНом = Справочники.Партии.ПустаяСсылка() Тогда
								ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная партия номенклатуры с кодом " + СтрПолучитьСтроку(ПарамНом,2));
							КонецЕсли;
						КонецЕсли;
					Иначе
						спрНом = ПолучитьСсылкуПоGUID(Парам, "Номенклатура");
					КонецЕсли;
					Если спрНом = Справочники.Номенклатура.ПустаяСсылка() Тогда
						ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная номенклатура с кодом " + СтрПолучитьСтроку(ПарамНом,1));
					Иначе	
						НовСтр.Номенклатура = спрНом;
					КонецЕсли;
					ТекНоменклатура = Парам;
				ИначеЕсли НомПарам = 2 Тогда //количество
					НовСтр.Колво = ПолучитьЧислоИзСтроки(Парам);
					
				ИначеЕсли НомПарам = 3 Тогда  //Единица
					НайденныйОбъект = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Парам);
					Если НайденныйОбъект.Пустая() Тогда
						ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная единица номенклатуры " + ТекНоменклатура + " с кодом ");
					Иначе	
						НовСтр.Единица = НайденныйОбъект;
					КонецЕсли;
					
				ИначеЕсли НомПарам = 4 Тогда  //Коэффициент
					НовСтр.Коэффициент = ПолучитьЧислоИзСтроки(Парам);
					
				ИначеЕсли НомПарам = 5 Тогда  //Склад
					НайденныйОбъект = ПолучитьСсылкуПоGUID(Парам,"Склады");
					НовСтр.Склад = НайденныйОбъект;
					
				ИначеЕсли НомПарам = 6 Тогда  //Цена
					НовСтр.Цена = ПолучитьЧислоИзСтроки(Парам);
					
				ИначеЕсли НомПарам = 7 Тогда  //Сумма
					НовСтр.Сумма = ПолучитьЧислоИзСтроки(Парам);
					
				ИначеЕсли НомПарам = 8 Тогда //Остаток
					Если ЗначениеЗаполнено(Парам) Тогда
					     НовСтр.Остаток = ПолучитьЧислоИзСтроки(Парам);
					Иначе
						 НовСтр.Остаток = -1; //не задан остаток 
					КонецЕсли; 
					
				ИначеЕсли НомПарам = 9 Тогда //Форма
					НовСтр.Форма   = Парам;
					
				ИначеЕсли НомПарам = 10 Тогда //Ответ
					НовСтр.Ответ   = Парам;
					
				ИначеЕсли НомПарам = 11 Тогда //Бонус
					НовСтр.Бонус   = Парам;
					
				ИначеЕсли НомПарам = 12 Тогда //Фейсинг
					Если ЗначениеЗаполнено(Парам) Тогда
					     НовСтр.Фейсинг = ПолучитьЧислоИзСтроки(Парам);
					Иначе
						 НовСтр.Фейсинг = -1; //не задан ;
					КонецЕсли; 
				ИначеЕсли НомПарам = 13 Тогда //Реквизиты
					НовСтр.ДопРеквизиты  = Парам;
				Иначе
					//ДобавитьОшибку("Неверный формат таблицы накладной");
					//Возврат Ложь;
				КонецЕсли;
				
				НомПарам = НомПарам + 1;
			КонецЦикла;

		КонецЦикла;
		
		Н = Н + 1;
	КонецЦикла;

	Для Каждого ТекСтр Из ВремТаблСтрок Цикл
		НовСтр = ТаблСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
		//Для бонусов текущую строку разобьем на 2 
		Если (ПараметрыАгента.СпособПредоставленияБонусов <> 2) И (ТекСтр.Бонус <> 0) Тогда
			НовСтр.Бонус = 0;
			НовСтр = ТаблСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
			НовСтр.Колво = ТекСтр.Бонус;
			НовСтр.Форма = "";
			НовСтр.Ответ = "";
			Если ПараметрыАгента.СпособПредоставленияБонусов = 0 Тогда  //по нулевой цене
				НовСтр.Цена = 0;
			КонецЕсли; 
			НовСтр.Сумма = НовСтр.Колво * НовСтр.Цена;
			НовСтр.Остаток = ТекСтр.Остаток;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Н;
КонецФункции

// Разбирает запрос на загрузку накладной и помещает данные в таблицы шапок и строк
// Адрес - идентификатор сессии обмена
// ТелоЗапроса - Текст полученный от КПК 
Функция ЗагрузитьРасходныеНакладные(Адрес, Платформа, ТелоЗапроса, ВидДок)
	ТекстДок = "Счет на оплату покупателю";
	Если ВидДок = 0 Тогда
		ТекстДок = ?(ПараметрыАгента.ТипСоздаваемогоДокумента = 0, "Реализация ТМЗ и услуг", "Акт об оказании производственных услуг");
	КонецЕсли;
	Если НЕ ПорцияОбмена(Адрес, "OK", "Загружается """ + ТекстДок + """...") Тогда
		Возврат ложь;
	КонецЕсли; 
	
	ТаблШапок=""; ТаблСтрок=""; ТаблКатегорий="";
	ПолучитьТаблицыНакладных(ТелоЗапроса, 5, ТаблШапок, ТаблСтрок, ТаблКатегорий);	
	
	//Проверим есть ли Остатки и загрузим их во внешнююБД
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ТаблКонтр.ИдКонтрагента КАК СТРОКА(32)) КАК ИдКонтрагента,
	|	ТаблКонтр.Дата КАК Дата,
	|	ВЫРАЗИТЬ(ТаблКонтр.Время КАК СТРОКА(8)) КАК Время,
	|	ВЫРАЗИТЬ(ТаблКонтр.ИдДок КАК ЧИСЛО(10, 0)) КАК ИдДок
	|ПОМЕСТИТЬ ВремКонтр
	|ИЗ
	|	&ТаблКонтр КАК ТаблКонтр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблНом.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблНом.Остаток * ТаблНом.Коэффициент КАК Остаток,
	|	ТаблНом.Фейсинг * ТаблНом.Коэффициент КАК Фейсинг,
	|	ВЫРАЗИТЬ(ТаблНом.ИдДок КАК ЧИСЛО(10, 0)) КАК ИдДок
	|ПОМЕСТИТЬ ВремНом
	|ИЗ
	|	&ТаблНом КАК ТаблНом
	|ГДЕ
	|	(ТаблНом.Остаток >= 0
	|			ИЛИ ТаблНом.Фейсинг >= 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремКонтр.ИдКонтрагента,
	|	ВремНом.Номенклатура,
	|	ВремКонтр.Дата,
	|	МИНИМУМ(ВремКонтр.Время) КАК Время,
	|	МИНИМУМ(ВремНом.Остаток) КАК Остаток,
	|	МИНИМУМ(ВремНом.Фейсинг) КАК Фейсинг
	|ИЗ
	|	ВремКонтр КАК ВремКонтр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНом КАК ВремНом
	|		ПО ВремКонтр.ИдДок = ВремНом.ИдДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремКонтр.ИдКонтрагента,
	|	ВремНом.Номенклатура,
	|	ВремКонтр.Дата,
	|	ВремКонтр.Время";
	Запрос.УстановитьПараметр("ТаблНом"  ,ТаблСтрок);
	Запрос.УстановитьПараметр("ТаблКонтр",ТаблШапок);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Блокировщик = Неопределено;
		БД = ОткрытьВнешнююБД(Блокировщик, Истина);
		Если БД = Ложь Тогда
			Сообщить(ОшибкаНетДоступаКВнешнейБД, СтатусСообщения.Важное);
		Иначе
			ТекстЗапросаОбновить="
				|Update OSTATKI Set OSTATOK = ?, FACING = ?, AGENT = ?
				|where (KONTRAGENT = ? and NOMENKLATURA = ? and DATA = ?)
				|";
			ПодгЗапросОбновить=БДПодготовитьЗапрос(БД, ТекстЗапросаОбновить);
			
			ТекстЗапросаСчетчик="
				|SELECT changes()";
			ПодгЗапросСчетчик=БДПодготовитьЗапрос(БД, ТекстЗапросаСчетчик);
			
			ТекстЗапросаДобавить="
				|Insert into OSTATKI ([OSTATOK], [FACING], [Agent], [KONTRAGENT], [NOMENKLATURA], [DATA])
				|    Values(?, ?, ?, ?, ?, ?)";
			ПодгЗапросДобавить=БДПодготовитьЗапрос(БД, ТекстЗапросаДобавить);
			
			ИдАгента = СокрЛП(УникИдентификатор(ПараметрыАгента.Агент));			
			БДУстановитьПараметр(ПодгЗапросОбновить, 3, ИдАгента);
			БДУстановитьПараметр( ПодгЗапросДобавить, 3, ИдАгента);
			
			КолвоЗаписей = 0;
			ИдНом = "";
			
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
										
					ТекДата = НачалоДня(Выборка.Дата);
					
					Попытка            
						ИдНом = УникИдентификатор(Выборка.Номенклатура);
						
						БДУстановитьПараметр(ПодгЗапросОбновить, 1, Выборка.Остаток);
						БДУстановитьПараметр(ПодгЗапросОбновить, 2, Выборка.Фейсинг);
						БДУстановитьПараметр(ПодгЗапросОбновить, 4, СокрЛП(Выборка.ИдКонтрагента));
						БДУстановитьПараметр(ПодгЗапросОбновить, 5, ИдНом);
						БДУстановитьПараметр(ПодгЗапросОбновить, 6, ДатаДляSQLite(ТекДата));
						БДСледующаяЗапись(ПодгЗапросОбновить);
						БДСбросПодготовленногоЗапроса(ПодгЗапросОбновить);
						
						БДСледующаяЗапись(ПодгЗапросСчетчик);
						
						Если БДЗначениеВКолонке(ПодгЗапросСчетчик, 0)=0 Тогда //Не обновилось, тогда добавим
							БДУстановитьПараметр(ПодгЗапросДобавить, 1, Выборка.Остаток);
							БДУстановитьПараметр(ПодгЗапросДобавить, 2, Выборка.Фейсинг);
							БДУстановитьПараметр(ПодгЗапросДобавить, 4, СокрЛП(Выборка.ИдКонтрагента));
							БДУстановитьПараметр(ПодгЗапросДобавить, 5, ИдНом);
							БДУстановитьПараметр(ПодгЗапросДобавить, 6, ДатаДляSQLite(ТекДата));
							БДСледующаяЗапись(ПодгЗапросДобавить);
							БДСбросПодготовленногоЗапроса(ПодгЗапросДобавить);
						КонецЕсли; 
						БДСбросПодготовленногоЗапроса(ПодгЗапросСчетчик);

					Исключение
						Ошибка=ОписаниеОшибки();
						ДобавитьВЛогФайл(" Ошибка при записи остатков "+РазделительСтрок+Ошибка,0);
						Если ТехПоддержкаАвтоматическаяОтправка Тогда 
							ОтправитьОшибкуВТехподдержку(ПараметрыАгента.Агент, "Работа с остатками"+ РазделительСтрок + Ошибка); 
						КонецЕсли;
					КонецПопытки;
				КонецЕсли; 
			КонецЦикла; 
			
			БДЗакрытьПодготовленныйЗапрос(ПодгЗапросОбновить);
			БДЗакрытьПодготовленныйЗапрос(ПодгЗапросСчетчик);
			БДЗакрытьПодготовленныйЗапрос(ПодгЗапросДобавить);
			
			ЗакрытьВнешнююБД(БД, Блокировщик);
		КонецЕсли; 
	КонецЕсли; 
	
	ТаблПользователей = ПрочитатьПользователейДляОповещения(ПараметрыАгента.Агент); //это Табл значений
	Если ВидДок = 0 Тогда
		Если ПараметрыАгента.ТипСоздаваемогоДокумента = 0 Тогда
			СоздатьРеализациюТоваровИУслуг(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
		Иначе //Если ПараметрыАгента.ТипСоздаваемогоДокумента = 1 Тогда
			СоздатьАктОбОказанииПроизводственныхУслуг(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
		КонецЕсли;
	Иначе
		СоздатьСчетНаОплату(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Разбирает запрос на загрузку накладной и помещает данные в таблицы шапок и строк
// Адрес - идентификатор сессии обмена
// ТелоЗапроса - Текст полученный от КПК 
Функция ЗагрузитьПриходныеНакладные(Адрес, Платформа, ТелоЗапроса)
	Если НЕ ПорцияОбмена(Адрес,"OK","Загружаются покупки...") Тогда
		возврат ложь;
	КонецЕсли; 
	
	ТаблШапок = Новый ТаблицаЗначений;
	ТаблШапок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблШапок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблШапок.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблШапок.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблШапок.Колонки.Добавить("ТипЦены", Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры"));
	ТаблШапок.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Проводной", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Докум", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
	ТаблШапок.Колонки.Добавить("Время", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));//время работы с документом в минутах	
	ТаблШапок.Колонки.Добавить("Форма", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Задание", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фото", Новый ОписаниеТипов("Строка"));
	
	ТаблСтрок = СоздатьТаблицуСтрокРН();
	
	ТаблКатегорий = Новый ТаблицаЗначений;
	ПолучитьТаблицуКатегорий(ТаблКатегорий);

	Н=5;
	КолСтр=СтрЧислоСтрок(ТелоЗапроса);	
	Пока Н <= КолСтр Цикл
		ТекСтр=СтрПолучитьСтроку(ТелоЗапроса,Н);
		НовСтр	 = ТаблШапок.Добавить();
		ИДДок    = "";
		КолПарам = СтрЧислоВхождений(ТекСтр,Таб)+1;
		НомПарам = 1;
		Пока НомПарам<=КолПарам Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр,Таб);
			Если ПозРазд<>0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд-1);
				ТекСтр = Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			
			Если НомПарам = 1 Тогда  //Дата
				ДатаВремя = ДатаИзСтрокиСКПК(Парам);
				НовСтр.Время = Сред(Парам,12); 
				НовСтр.Дата  = ДатаВремя;
			ИначеЕсли НомПарам = 2 Тогда  //ИдДок-уникальный номер документа
				ИдДок = Парам;
				НовСтр.ИдДок = Парам; 
			ИначеЕсли НомПарам = 3 Тогда   //номерДокумента
				НовСтр.Номер = Прав(Парам,11); 
			ИначеЕсли НомПарам = 4 Тогда  //организация
				НайденныйОбъект = Справочники.Организации.НайтиПоКоду(Парам);
				Если НайденныйОбъект.Пустая() Тогда
					ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная организация с кодом " + Парам);
				Иначе	
					НовСтр.Организация = НайденныйОбъект;	
				КонецЕсли;
			ИначеЕсли НомПарам = 5 Тогда //контрагент
				мКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
				мАдресДоставки = "";
				
				ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
				Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
					ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
					Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
						Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
							ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;

				ПолучитьКонтрагентаИАдресПоКоду(Парам, мКонтрагент, мАдресДоставки, ПапкаРодителя);
				Если мКонтрагент.Пустая() Тогда
					ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестный контрагент с кодом " + Парам);
				Иначе	
					НовСтр.Контрагент = мКонтрагент;	
				КонецЕсли;
			ИначеЕсли НомПарам = 6 Тогда  //договор
				Если ЗначениеЗаполнено(Парам) Тогда
					Договор = ?(ПустаяСтрока(Парам), 
						Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), 
						Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(Парам))));
					Если Договор.Пустая() Тогда
						ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестный договор с кодом " + Парам);
					Иначе	
						НовСтр.Договор = Договор;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НомПарам = 7 Тогда  //Склад
				НайденныйОбъект = ПолучитьСсылкуПоGUID(Парам,"Склады");
				НовСтр.Склад = НайденныйОбъект;
			ИначеЕсли НомПарам = 8 Тогда  //тип цен 
				НайденныйОбъект = ПолучитьСсылкуПоGUID(Парам,"ТипыЦенНоменклатуры");
				Если НайденныйОбъект.Пустая() Тогда
					ДобавитьОшибку(
						"Загрузка накладной " + ИдДок + ".Неизвестный тип цен с кодом " + Парам + ". Будет использован тип цен по умолчанию");
					НовСтр.ТипЦены = ПараметрыАгента.ТипЦенПоУмолчанию;
				Иначе
					НовСтр.ТипЦены = НайденныйОбъект;
				КонецЕсли;
			ИначеЕсли НомПарам = 9 Тогда //комментарий
				НовСтр.Комментарий = Парам; 
			ИначеЕсли НомПарам = 10 Тогда //Проводной
				НовСтр.Проводной = ПолучитьЧислоИзСтроки(Парам);
			ИначеЕсли НомПарам = 11 Тогда
				НовСтр.ДатаСоздания = ДатаИзСтрокиСКПК(Парам);				
			ИначеЕсли НомПарам = 12 Тогда
				НовСтр.ВремяРаботы  = Число(Парам);
			ИначеЕсли НомПарам = 13 Тогда
				Если ПустаяСтрока(Парам)=0 Тогда
					НовСтр.Скидка   = Число(Парам);
				Иначе
					НовСтр.Скидка = 0;
				КонецЕсли;
			ИначеЕсли НомПарам = 14 Тогда
				НовСтр.Форма   = Парам;
			ИначеЕсли НомПарам = 15 Тогда
				НовСтр.Ответ   = Парам;
			ИначеЕсли НомПарам = 16 Тогда
				НовСтр.ДопРеквизиты   = Парам;
			ИначеЕсли НомПарам = 17 Тогда
				НовСтр.Задание = Парам;
			ИначеЕсли НомПарам = 18 Тогда
				НовСтр.Фото = СтрЗаменить(Парам,Символ(31),РазделительСтрок);
			Иначе
//				ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неверный формат шапки накладной");
//				Возврат Ложь;
			КонецЕсли;
			НомПарам = НомПарам + 1;
		КонецЦикла;
		//заполнить таблицу категорий
		Н = Н + 1;
		ТекСтр=СтрПолучитьСтроку(ТелоЗапроса,Н);
		Пока ТекСтр<>"" Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр,Таб);
			Если ПозРазд<>0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд-1);
				ТекСтр = Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			НайденныйОбъект = НайтиОбъектКатегория(Парам);
			Если ЗначениеЗаполнено(НайденныйОбъект) Тогда
				НовСтр = ТаблКатегорий.Добавить();
		        НовСтр.ИдДок = ИдДок;
    			НовСтр.Категория = НайденныйОбъект;
			КонецЕсли; 
		КонецЦикла;
		
		Пока Истина Цикл
			Н = Н + 1;
			Если Н > КолСтр Тогда 
				Прервать; 
			КонецЕсли;
			ТекСтр = СтрПолучитьСтроку(ТелоЗапроса,Н);
			Если ТекСтр = "" Тогда 
				Прервать; 
			КонецЕсли;
			
			НовСтр = ТаблСтрок.Добавить();
			НовСтр.ИдДок = ИдДок;
			ТекНоменклатура = "";
			КолПарам = СтрЧислоВхождений(ТекСтр,Таб)+1;
			НомПарам = 1;
			Пока НомПарам<=КолПарам Цикл
				Парам = "";
				ПозицияТаб = Найти(ТекСтр,Таб);
				Если ПозицияТаб <> 0 Тогда
					Парам  = Лев(ТекСтр,ПозицияТаб-1);
					ТекСтр = Сред(ТекСтр,ПозицияТаб+1);
				Иначе
					Парам  = ТекСтр;
					ТекСтр = "";
				КонецЕсли;
				Если НомПарам = 1 Тогда   //Номенклатура
					НовСтр.Партия = "";
					Если Конфигурация = "БухБеларусь" Тогда
						ПарамНом = СтрЗаменить(Парам, "#", Символы.ПС);
						спрНом = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(ПарамНом,1), "Номенклатура");
						Если СтрЧислоСтрок(ПарамНом) =2 Тогда
							НовСтр.Партия = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(ПарамНом,2), "Партии");
							Если спрНом = Справочники.Партии.ПустаяСсылка() Тогда
								ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная партия номенклатуры с кодом " + Парам);
							КонецЕсли;
						КонецЕсли;
					Иначе
						спрНом = ПолучитьСсылкуПоGUID(Парам, "Номенклатура");
					КонецЕсли;
					Если спрНом = Справочники.Номенклатура.ПустаяСсылка() Тогда
						ДобавитьОшибку("Загрузка накладной " + ИдДок + ".Неизвестная номенклатура с кодом " + Парам);
					Иначе	
						НовСтр.Номенклатура = спрНом;
					КонецЕсли;
					ТекНоменклатура = Парам;
				ИначеЕсли НомПарам = 2 Тогда //количество
					НовСтр.Колво = ПолучитьЧислоИзСтроки(Парам);
				ИначеЕсли НомПарам = 3 Тогда  //Единица
					НайденныйОбъект = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Парам);
					Если НайденныйОбъект.Пустая() Тогда
						ДобавитьОшибку("Загрузка накладной "+ИдДок+". Неизвестная единица номенклатуры "+ТекНоменклатура+" с кодом ");
					Иначе	
						НовСтр.Единица = НайденныйОбъект;
					КонецЕсли;
				ИначеЕсли НомПарам = 4 Тогда  //Коэффициент
					НовСтр.Коэффициент = ПолучитьЧислоИзСтроки(Парам);
				ИначеЕсли НомПарам = 5 Тогда  //Склад
					НайденныйОбъект = ПолучитьСсылкуПоGUID(Парам ,"Склады");
					НовСтр.Склад = НайденныйОбъект;
				ИначеЕсли НомПарам = 6 Тогда  //Цена
					НовСтр.Цена = ПолучитьЧислоИзСтроки(Парам);
				ИначеЕсли НомПарам = 7 Тогда  //Сумма
					НовСтр.Сумма = ПолучитьЧислоИзСтроки(Парам);
				ИначеЕсли НомПарам = 8 Тогда  //ДопРеквизиты
					НовСтр.ДопРеквизиты = Парам;
				Иначе
					//ДобавитьОшибку("Неверный формат таблицы накладной");
					//Возврат Ложь;
				КонецЕсли;
				НомПарам = НомПарам + 1;
			КонецЦикла;
		КонецЦикла;
		Н = Н + 1;
	КонецЦикла;
	
	ТаблПользователей = ПрочитатьПользователейДляОповещения(ПараметрыАгента.Агент); //это Табл значений
	
	Если ПараметрыАгента.ТипСоздаваемогоДокументаПокупка = 0 Тогда //возврат
		СоздатьВозвратОтПокупателя(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
	ИначеЕсли ПараметрыАгента.ТипСоздаваемогоДокументаПокупка = 1 Тогда  //поступление
		СоздатьПоступлениеТоваровУслуг(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий); 		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

// Создаёт новый документ ПоступлениеТоваровУслуг при загрузке из КПК
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		Платформа - идентификатор платформы КПК
// 		ТаблШапок - ТаблицаЗначений, таблица со всеми реквизитами шапок
// 			документов в соответствии с протоколом обмена
// 		ТаблСтрок - ТаблицаЗначений, таблица со всеми реквизитами строк
// 			документов в соответствии с протоколом обмена
// 		ТаблПользователей - ТаблицаЗначений, содержит в колонке "Пользователь" пользователей, которым
// 			отправить оповещение о загрузке документа
// 		ТаблКатегорий - ТаблицаЗначений, таблица со всеми значениями категорий
// 			документов в соответствии с протоколом обмена
Процедура СоздатьПоступлениеТоваровУслуг(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий)
	ДобавитьСообщение("Формируются приходные накладные...");	
	текДата = ТекущаяДата();
	Для Каждого СтрШапки Из ТаблШапок Цикл
		УникДок = СформироватьУникальныйКодДокумента("Поступление", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес,Ответ,0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			НачатьТранзакцию();
			Попытка
				
				Док = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
				Док.Дата						= ДатаИзДатаИВремя(СтрШапки.Дата, текДата);  //Время поставим текущее
		 		Док.НомерВходящегоДокумента		= СтрШапки.Номер;
		        Док.ДатаВходящегоДокумента		= Док.Дата;
				Док.Комментарий					= СтрШапки.Комментарий;
				Док.Склад = ?(ЗначениеЗаполнено(СтрШапки.Склад), СтрШапки.Склад, ПараметрыАгента.Склады[0].Склад);
				
				Если СоответствиеКонтрагента = 0 Тогда //покупатель = грузополучатель
					Док.Контрагент				= СтрШапки.Контрагент;
				Иначе	//холдинг
					Док.Контрагент				= Док.Грузоотправитель.ГоловнойКонтрагент;
				КонецЕсли;
				
				// Заполним ДоговорКонтрагента
				Если ЗначениеЗаполнено(СтрШапки.Договор)
					И (СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
					Или СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее И Конфигурация = "БухКазахстан") Тогда
					Док.ДоговорКонтрагента = СтрШапки.Договор;
				Иначе
					Док.ДоговорКонтрагента = ПолучитьДоговораКонтрагента(СтрШапки, Док);
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
					ВызовемИсключение = 1 / 0;
				КонецЕсли;
				Док.Организация		= Док.ДоговорКонтрагента.Организация; //Организацию берем из Договора
				
				Док.ТипЦен			= ?(ЗначениеЗаполнено(СтрШапки.ТипЦены), СтрШапки.ТипЦены, Док.ДоговорКонтрагента.ТипЦен);
				Док.ВалютаДокумента	= Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			    Док.СуммаВключаетНДС= Док.ТипЦен.ЦенаВключаетНДС;
				Док.УчитыватьНДС	= ОпределитьУчитыватьНДС(Док.Организация, Док.Дата);
				
				КурсВалюты = ПолучитьКурсВалюты(Док.ВалютаДокумента,Док.Дата);
				Док.КурсВзаиморасчетов		= КурсВалюты.Курс;
				Док.КратностьВзаиморасчетов	= КурсВалюты.Кратность;
				Док.Ответственный			= ПараметрыАгента.Агент;
		
				СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентом(Док.Организация, Док.Контрагент, Док.ДоговорКонтрагента, Док.ВалютаДокумента);
				Док.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
				Док.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
		
				Если Конфигурация = "БухКазахстан" Тогда
					//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
					//	Док.Автор = ПараметрыАгента.Агент;
					//КонецЕсли;
					Док.ВидОперации				= Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомисия; // Казахстану можно "комисия" и с 1 буквой "с" писать
					Док.УчитыватьКПН			= ОрганизацияПлательщикКПН(Док.Организация);
					Если Док.УчитыватьКПН Тогда
						Док.ВидУчетаНУ			= Справочники.ВидыУчетаНУ.НУ;
					КонецЕсли;
				ИначеЕсли Конфигурация = "БухБеларусь" Тогда
					Док.ВидОперации				= Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
					Док.Грузополучатель			= Док.Организация;
					Док.Грузоотправитель		= СтрШапки.Контрагент;
					Док.СчетУчетаРасчетовПоТаре	= СчетаУчета.СчетУчетаТарыПокупателя;
					
					ЦенаВРозницеНужна = Ложь;		
					Если (Док.Склад.ВидСклада <> Перечисления.ВидыСкладов.Оптовый)
						И (ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Док.Дата, Ложь, Док.Организация).СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости) Тогда
						ЦенаВРозницеНужна = Истина;
					КонецЕсли;
					БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
					РазделятьПоСтавкамНДС = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);
				Иначе
					Док.ВидОперации				= Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
					Док.Грузополучатель			= Док.Организация;
					Док.Грузоотправитель		= СтрШапки.Контрагент;
					Док.СчетУчетаРасчетовПоТаре	= СчетаУчета.СчетУчетаТарыПокупателя;
					Док.СпособЗачетаАвансов		= Перечисления.СпособыЗачетаАвансов.Автоматически;
					
					ЦенаВРозницеНужна = Ложь;		
					Если (Док.Склад.ВидСклада <> Перечисления.ВидыСкладов.Оптовый)
						И (ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Док.Дата, Ложь, Док.Организация).СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости) Тогда
						ЦенаВРозницеНужна = Истина;
					КонецЕсли;
					БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
					РазделятьПоСтавкамНДС = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);
				КонецЕсли;
				
				СтруктПоиска = Новый Структура;
				СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
				ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска);
				МассивСтрок = ТаблСтрок.НайтиСтроки(СтруктПоиска);
				
				СтруктураВалютаКПК = Неопределено;
				Если ПараметрыАгента.ВалютаКПК <> Док.ВалютаДокумента Тогда
					СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
				КонецЕсли;
				
				Для Каждого СтрСтрок Из МассивСтрок Цикл
					Если СтрСтрок.Колво <= 0 Тогда 
						Продолжить; 
					КонецЕсли;
					Если СтрСтрок.Сумма <= 0 Тогда 
						Продолжить; 
					КонецЕсли;
					
					стрСумма = СтрСтрок.Сумма;
					Если СтруктураВалютаКПК <> Неопределено Тогда
						стрСумма = ПересчитатьИзВалютыВВалюту(СтрСтрок.Сумма,
							ПараметрыАгента.ВалютаКПК, Док.ВалютаДокумента,
							СтруктураВалютаКПК.Курс, Док.КурсВзаиморасчетов,
							СтруктураВалютаКПК.Кратность, Док.КратностьВзаиморасчетов);
					КонецЕсли;
					
					СтрДок = Док.Товары.Добавить();
					Если Док.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
						СтрДок.ЕдиницаИзмерения	= СтрСтрок.Единица;        
						СтрДок.Коэффициент		= СтрСтрок.Коэффициент;
					КонецЕсли;
					СтрДок.Количество		= СтрСтрок.Колво;
					СтрДок.Номенклатура		= СтрСтрок.Номенклатура;
					СтрДок.СтавкаНДС		= СтрДок.Номенклатура.СтавкаНДС;
							 
					СтрДок.СуммаНДС = ?(Док.УчитыватьНДС, СтрСумма - СтрСумма / (1 + ПолучитьСтавкуНДС(СтрДок.СтавкаНДС) / 100), 0);
					СтрДок.Сумма	= ?(Док.СуммаВключаетНДС, СтрСумма, СтрСумма - СтрДок.СуммаНДС);
					СтрДок.Цена		= ?(СтрДок.Количество > 0, СтрДок.Сумма / СтрДок.Количество, 0);
					
					Если Конфигурация = "БухКазахстан" Тогда
						ОбработкаТабличныхЧастей.ЗаполнитьНДСВидОборотаТабЧасти(СтрДок, Док);
						ОбработкаТабличныхЧастей.ЗаполнитьНДСВидПоступленияТабЧасти(СтрДок, Док, глЗначениеПеременной("глТекущийПользователь"));		
						Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрДок, "Товары", Истина, Док.УчитыватьКПН);
					ИначеЕсли Конфигурация = "БухБеларусь" Тогда
						СтрДок.НомерГТД	= СтрДок.Номенклатура.НомерГТД;
						СтрДок.СтранаПроисхождения = СтрДок.Номенклатура.СтранаПроисхождения;
						Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрДок, "Товары", Истина, Истина);
						Если ЦенаВРозницеНужна Тогда
							СтрДок.ЦенаВРознице = ПолучитьЦенуНоменклатуры(СтрДок.Номенклатура, Док.Склад.ТипЦенРозничнойТорговли, Док.Дата, Док.ВалютаДокумента, 1, 1);
							СтрДок.СуммаВРознице = СтрДок.Количество * СтрДок.ЦенаВРознице;
							Если РазделятьПоСтавкамНДС Тогда
								СчетаУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрДок.Номенклатура, Док.Склад, Док.Дата);
								ОтноситсяКДеятельностиЕНВД = ?(глЗначениеПеременной("глСчетаДоходовИРасходовЕНВД").Получить(СчетаУчета.СчетДоходов) = Неопределено, Ложь, Истина);
								СтрДок.СтавкаНДСВРознице = ?(ОтноситсяКДеятельностиЕНВД, Перечисления.СтавкиНДС.БезНДС, СтрДок.Номенклатура.СтавкаНДС);
							КонецЕсли;
						КонецЕсли;
					Иначе
						СтрДок.НомерГТД	= СтрДок.Номенклатура.НомерГТД;
						СтрДок.СтранаПроисхождения = СтрДок.Номенклатура.СтранаПроисхождения;
						//Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрДок, "Товары", Истина);
						ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(Док, СтрДок, "Товары");
						Если ЦенаВРозницеНужна Тогда
							СтрДок.ЦенаВРознице = ПолучитьЦенуНоменклатуры(СтрДок.Номенклатура, Док.Склад.ТипЦенРозничнойТорговли, Док.Дата, Док.ВалютаДокумента, 1, 1);
							СтрДок.СуммаВРознице = СтрДок.Количество * СтрДок.ЦенаВРознице;
							Если РазделятьПоСтавкамНДС Тогда
								СчетаУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрДок.Номенклатура, Док.Склад, Док.Дата);
								ОтноситсяКДеятельностиЕНВД = ?(глЗначениеПеременной("глСчетаДоходовИРасходовЕНВД").Получить(СчетаУчета.СчетДоходов) = Неопределено, Ложь, Истина);
								СтрДок.СтавкаНДСВРознице = ?(ОтноситсяКДеятельностиЕНВД, Перечисления.СтавкиНДС.БезНДС, СтрДок.Номенклатура.СтавкаНДС);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "17", "1");	
				КонецЦикла;
				
				Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
					Док.УстановитьНовыйНомер(Док.Организация.Префикс);
				Иначе
					Док.Номер = СтрШапки.Номер;
				КонецЕсли;
				
				//запускаем обработку дополнительных реквизитов			
				ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "16", "1");
				Док.Записать();
				ЗаписатьУникКодДокумента(Док, УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
				//добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение  = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение  = СтрШапки.ДатаСоздания;
				МенеджерЗаписи.Записать(Истина);
				ЗавершитьСобытие(Адрес, Платформа, "Покупка", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки. Фото, 16);
				Если ПараметрыАгента.ПроводитьПокупка Тогда
					Попытка
						Док.Записать(РежимЗаписиДокумента.Проведение);
						ТекстСтатуса = " (проведен)";
					Исключение
						Док.Записать();
						ТекстСтатуса = " (не проведен)";
					КонецПопытки;
				Иначе
					ТекстСтатуса = " (не проведен)"
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				СерверПослатьОтвет(Адрес,Ответ,0);
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
				ОтменитьТранзакцию();
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ покупка не создан"; 
					Если ПараметрыАгента.ПроводитьПродажа Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Для контрагента " + Док.Контрагент + " не найден договор с покупателем";
					СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл("Ошибка создания документа Покупка: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	

	СерверПослатьОтвет(Адрес, РазделительСтрок, 1);
КонецПроцедуры

// Создаёт новый документ ВозвратТоваровОтПокупателя при загрузке из КПК
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		Платформа - идентификатор платформы КПК
// 		ТаблШапок - ТаблицаЗначений, таблица со всеми реквизитами шапок
// 			документов в соответствии с протоколом обмена
// 		ТаблСтрок - ТаблицаЗначений, таблица со всеми реквизитами строк
// 			документов в соответствии с протоколом обмена
// 		ТаблПользователей - ТаблицаЗначений, содержит в колонке "Пользователь" пользователей, которым
// 			отправить оповещение о загрузке документа
// 		ТаблКатегорий - ТаблицаЗначений, таблица со всеми значениями категорий
// 			документов в соответствии с протоколом обмена
Процедура СоздатьВозвратОтПокупателя(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
	ДобавитьСообщение("Формируются возвраты от покупателя ...");
	
	текдата = ТекущаяДата();
	РасчитыватьЦены1С = ПараметрыАгента.РасчитыватьЦены1С;
	Для Каждого СтрШапки Из ТаблШапок Цикл
		УникДок = СформироватьУникальныйКодДокумента("Возврат",СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		Если СсылкаДок<>Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес,Ответ,0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			нетОшибок = Истина;
			НачатьТранзакцию();
			Попытка		
				Док = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
				Док.Дата			= ДатаИзДатаИВремя(СтрШапки.Дата, текдата);  //Время поставим текущее
				Док.Склад			= ?(ЗначениеЗаполнено(СтрШапки.Склад), СтрШапки.Склад, ПараметрыАгента.Склады[0].Склад);
				Если СоответствиеКонтрагента = 0 Тогда //покупатель = грузополучатель
					Док.Контрагент	= СтрШапки.Контрагент;
				Иначе	//холдинг
					Док.Контрагент	= СтрШапки.Контрагент.ГоловнойКонтрагент;
				КонецЕсли;
				// Заполним ДоговорКонтрагента
				Если ЗначениеЗаполнено(СтрШапки.Договор)
					И (СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
					Или СтрШапки.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее И Конфигурация = "БухКазахстан") Тогда
					Док.ДоговорКонтрагента = СтрШапки.Договор;
				Иначе
					Док.ДоговорКонтрагента = ПолучитьДоговораКонтрагента(СтрШапки, Док);
				КонецЕсли;
				
				Док.Организация		= Док.ДоговорКонтрагента.Организация; //Организацию берем из Договора
				Док.ТипЦен			= ?(РасчитыватьЦены1С, ?(ЗначениеЗаполнено(Док.ДоговорКонтрагента.ТипЦен), Док.ДоговорКонтрагента.ТипЦен, СтрШапки.ТипЦены), СтрШапки.ТипЦены);
				Док.ВалютаДокумента	= Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Док.СуммаВключаетНДС= Док.ТипЦен.ЦенаВключаетНДС;
				Док.УчитыватьНДС	= ОпределитьУчитыватьНДС(Док.Организация, Док.Дата);
				Док.Ответственный	= ПараметрыАгента.Агент;
				Док.Комментарий		= СтрШапки.Комментарий;

				КурсВалюты = ПолучитьКурсВалюты(Док.ВалютаДокумента, Док.Дата);
				Док.КурсВзаиморасчетов		= КурсВалюты.Курс;
				Док.КратностьВзаиморасчетов	= КурсВалюты.Кратность;
				СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентом(Док.Организация, Док.Контрагент, Док.ДоговорКонтрагента, Док.ВалютаДокумента);
				Док.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетовПокупателя;
				
				Если Конфигурация = "БухКазахстан" Тогда
					//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
					//	Док.Автор = ПараметрыАгента.Агент;
					//КонецЕсли;
					Док.УчитыватьКПН					= ОрганизацияПлательщикКПН(Док.Организация);
					Если Док.УчитыватьКПН Тогда
						Док.ВидУчетаНУ					= Справочники.ВидыУчетаНУ.НУ;
					КонецЕсли;
					Док.СуммаВключаетАкциз				= Док.ТипЦен.ЦенаВключаетАкциз;
					Док.СчетУчетаРасчетовПоВозвратам	= СчетаУчета.СчетВозвратовПокупателя;
				Иначе
					Док.ВидОперации						= Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
					Док.СчетУчетаРасчетовПоТаре			= СчетаУчета.СчетУчетаТарыПокупателя;
					Док.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансовПокупателя;
				КонецЕсли;
				
				СтруктураВалютаКПК = Неопределено;
				Если ПараметрыАгента.ВалютаКПК <> Док.ВалютаДокумента Тогда
					СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
				КонецЕсли;
				
				СтруктПоиска = Новый Структура;
				СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
				МассивСтрок = ТаблСтрок.НайтиСтроки(СтруктПоиска);
				ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); 	
				Для Каждого СтрСтрок Из МассивСтрок Цикл
					Если СтрСтрок.Колво <= 0 Тогда 
						Продолжить; 
					КонецЕсли;
					Если СтрСтрок.Сумма <= 0 Тогда 
						Продолжить; 
					КонецЕсли;
					стрСумма = СтрСтрок.Сумма;
					Если СтруктураВалютаКПК <> Неопределено Тогда
						стрСумма = ПересчитатьИзВалютыВВалюту(СтрСтрок.Сумма,
							ПараметрыАгента.ВалютаКПК, Док.ВалютаДокумента,
							СтруктураВалютаКПК.Курс, Док.КурсВзаиморасчетов,
							СтруктураВалютаКПК.Кратность, Док.КратностьВзаиморасчетов);
					КонецЕсли;

					СтрДок = Док.Товары.Добавить();
					СтрДок.Количество	= СтрСтрок.Колво;
					СтрДок.Номенклатура	= СтрСтрок.Номенклатура;
					Если Конфигурация = "БухБеларусь" И СтрСтрок.Партия <> ""  Тогда
						СтрДок.Партия				= СтрСтрок.Партия;
					КонецЕсли;
					СтрДок.СтавкаНДС	= СтрДок.Номенклатура.СтавкаНДС;
					
					Если Конфигурация = "БухКазахстан" Тогда
						СтрДок.НДСВидОперацииРеализации	= Справочники.ВидыРеализации.ВозвратТМЗ;
						Если Док.СуммаВключаетАкциз И Док.УчитыватьАкциз Тогда 
							СтрДок.СтавкаАкциза		= СтрДок.Номенклатура.СтавкаАкциза;
							ОбработкаТабличныхЧастей.РассчитатьСуммуАкцизаТабЧасти(СтрДок, Док);
						КонецЕсли;
					Иначе
						СтрДок.НомерГТД				= СтрДок.Номенклатура.НомерГТД;
						СтрДок.СтранаПроисхождения	= СтрДок.Номенклатура.СтранаПроисхождения;
						СтрДок.Себестоимость		= стрСумма; // в рублях
					КонецЕсли;
					
					Если РасчитыватьЦены1С Тогда
						ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрДок, Док, мВалютаРегламентированногоУчета);
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
					Иначе
						СтавкаНДС		= ПолучитьСтавкуНДС(СтрДок.СтавкаНДС) / 100;
						СтрДок.Цена		= ?(СтрДок.Количество > 0, ?(Док.УчитыватьНДС, ?(Док.СуммаВключаетНДС, СтрСумма, СтрСумма / (1 + СтавкаНДС)), СтрСумма) / СтрДок.Количество, 0);
						СуммаСоСкидкой	= СтрСумма - СтрСумма * СтрШапки.Скидка / 100;
						СтрДок.СуммаНДС = ?(Док.УчитыватьНДС, СуммаСоСкидкой - СуммаСоСкидкой / (1 + СтавкаНДС), 0);
						СтрДок.Сумма	= ?(Док.СуммаВключаетНДС, СуммаСоСкидкой, СуммаСоСкидкой - СтрДок.СуммаНДС);
					КонецЕсли;
					
					Если Конфигурация = "БухКазахстан" Тогда
						Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрДок, "Товары", Истина, Док.УчитыватьКПН);
					ИначеЕсли Конфигурация = "БухБеларусь" Тогда
						Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрДок, "Товары", Истина, Истина);
					Иначе
						//Док.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрДок, "Товары", Истина);
						//СтрДок.СчетУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрДок.Номенклатура, Док.Склад, Док.Дата).СчетУчета;
						ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(Док, СтрДок, "Товары");
					КонецЕсли;
					ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "17", "0");	
					
				КонецЦикла;
				
				Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
					Док.УстановитьНовыйНомер(Док.Организация.Префикс);
				Иначе
					Док.Номер = СтрШапки.Номер;
				КонецЕсли;
			
				//запускаем обработку дополнительных реквизитов			
				ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "16", "0");
				
				Если ПараметрыАгента.ПроводитьПокупка Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
					ТекстСтатуса = " (проведен)";
				Иначе
					Док.Записать();
					ТекстСтатуса = " (не проведен)";
				КонецЕсли;
				
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
			КонецПопытки;
			
			Если нетОшибок Тогда
				ЗаписатьУникКодДокумента(Док, УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
	            //добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение  = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение  = СтрШапки.ДатаСоздания;
				МенеджерЗаписи.Записать(Истина);
				ЗавершитьСобытие(Адрес, Платформа, "Покупка", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки.Фото, 16);
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				ЗафиксироватьТранзакцию();
				СерверПослатьОтвет(Адрес, Ответ, 0);			
			Иначе
				ОтменитьТранзакцию();
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ Возврат не создан"; 
					Если ПараметрыАгента.ПроводитьПокупка Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл("Ошибка создания документа Возврат: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
	
КонецПроцедуры

// Разбирает запрос на загрузку Анкет и помещает данные в таблицу значений
// Адрес - идентификатор сессии обмена
// ТелоЗапроса - Запрос, в том виде, в каком он пришёл от КПК
Функция ЗагрузитьАнкеты(Адрес, Платформа, ТелоЗапроса)
	
	Если НЕ ПорцияОбмена(Адрес, "OK", "Загружаются анкеты...") Тогда
		Возврат ложь;
	КонецЕсли; 
	
	ТаблШапок = Новый ТаблицаЗначений;
	ТаблШапок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Форма", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблШапок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблШапок.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблШапок.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Время", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));//время работы с документом в минутах
	ТаблШапок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Задание", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фото", Новый ОписаниеТипов("Строка"));
	
	ТаблСтрок = Новый ТаблицаЗначений;
	ТаблСтрок.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	ТаблСтрок.Колонки.Добавить("ЗначениеПоля", Новый ОписаниеТипов("Строка"));
	ТаблСтрок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число"));
	
	ТаблКатегорий = Новый ТаблицаЗначений;
	ПолучитьТаблицуКатегорий(ТаблКатегорий);	
	Н = 5;
	КолСтр = СтрЧислоСтрок(ТелоЗапроса);
	Пока Н <= КолСтр Цикл
		ТекСтр = СтрПолучитьСтроку(ТелоЗапроса, Н);
		Если ТекСтр = "" Тогда Прервать; КонецЕсли;
		ТекСтр = СтрЗаменить(ТекСтр,Таб,РазделительСтрок);
		Если СтрЧислоСтрок(ТекСтр) > 13 Тогда
			//ДобавитьОшибку("Неверный формат шапки анкет");
			//Возврат Ложь;
		КонецЕсли;
		
		НовСтр = ТаблШапок.Добавить();
		НовСтр.Время = Сред(СтрПолучитьСтроку(ТекСтр,1),12);
		НовСтр.Дата = ДатаИзСтрокиСКПК(СтрПолучитьСтроку(ТекСтр,1));
		НовСтр.ИдДок = Число(СтрПолучитьСтроку(ТекСтр,2));
		ИДДок = НовСтр.ИдДок;
		НовСтр.Форма = СтрПолучитьСтроку(ТекСтр,3);
		
		Код = СтрПолучитьСтроку(ТекСтр,4);
		Организация = Справочники.Организации.НайтиПоКоду(Код);
		НовСтр.Организация = Организация;
		
		Код = СтрПолучитьСтроку(ТекСтр,5);
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(Код);
		Если Контрагент.Пустая() Тогда
			ОтправитьОшибку(Адрес,Строка(ИдДок)+Таб+"Неизвестный контрагент с кодом "+Код+РазделительСтрок);
			ДобавитьОшибку("Ошибка при загрузке анкеты. Неизвестный контрагент с кодом "+Код);
		КонецЕсли;
		НовСтр.Контрагент = Контрагент;
		
		Код = СтрПолучитьСтроку(ТекСтр,6);
		Если ПустаяСтрока(Код) Тогда
			НовСтр.Договор=Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Иначе
			Договор = ?(ПустаяСтрока(Код), 
			Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), 
			Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(Код))));
			Если Договор.Пустая() Тогда
				ОтправитьОшибку(Адрес,Строка(ИдДок)+Таб+"Неизвестный договор с кодом "+Код+РазделительСтрок);
				ДобавитьОшибку("Ошибка при загрузке анкеты. Неизвестный договор с кодом "+Код);
			КонецЕсли;
			НовСтр.Договор = Договор;
		КонецЕсли;
		
		НовСтр.Комментарий = СтрПолучитьСтроку(ТекСтр,7);
		НовСтр.Ответ = СтрПолучитьСтроку(ТекСтр,8);
		НовСтр.ДатаСоздания = ДатаИзСтрокиСКПК(СтрПолучитьСтроку(ТекСтр,9));
		НовСтр.ВремяРаботы = Число(СтрПолучитьСтроку(ТекСтр,10));
		НовСтр.ДопРеквизиты = СтрПолучитьСтроку(ТекСтр,11);
		НовСтр.Задание = СтрПолучитьСтроку(ТекСтр,12);
		НовСтр.Фото = СтрЗаменить(СтрПолучитьСтроку(ТекСтр,13),Символ(31),РазделительСтрок);
		
		Н=Н+1;
		//заполнить таблицу категорий
		ТекСтр=СтрПолучитьСтроку(ТелоЗапроса,Н);
		Пока ТекСтр<>"" Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр,Таб);
			Если ПозРазд<>0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд-1);
				ТекСтр = Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			НайденныйОбъект = Справочники.КатегорииОбъектов.НайтиПоКоду(Парам);
			Если НайденныйОбъект.Пустая()=Ложь Тогда
				НовСтр = ТаблКатегорий.Добавить();
				НовСтр.ИдДок =  ИдДок;
				НовСтр.Категория = НайденныйОбъект;
			КонецЕсли; 
		КонецЦикла;
		
		Н=Н+1;
	КонецЦикла;
	
	Для Каждого СтрШапок Из ТаблШапок Цикл
		Если СтрШапок.форма = "Типовое задание 1С" Тогда
			
			Ответы = СтрЗаменить(СтрШапок.Ответ, Символ(30), РазделительСтрок);//разделитель вопросов RS 1E заменю на Разделитель Строк 
			
			КолВопросовОтветов = СтрЧислоСтрок(Ответы);
			Контрагент = СтрШапок.Контрагент;
			
			ВопросОтвет = СтрПолучитьСтроку(Ответы,1);
			ВопросОтвет = СтрЗаменить(ВопросОтвет,Символ(31),Символы.ПС);//разделитель вопросов US 1F заменю на Разделитель Строк 			
			ВопросОтвет = СтрЗаменить(СтрПолучитьСтроку(ВопросОтвет, 2), " #", Символы.ПС);
			Исполнитель = ПолучитьАгентаПоКоду(СтрПолучитьСтроку(ВопросОтвет, 2));
			
			ВопросОтвет = СтрПолучитьСтроку(Ответы,2);
			ВопросОтвет = СтрЗаменить(ВопросОтвет,Символ(31),Символы.ПС);//разделитель вопросов US 1F заменю на Разделитель Строк 			
			СрокВыполнения = Число(СтрПолучитьСтроку(ВопросОтвет, 2));
			
			ВопросОтвет = СтрПолучитьСтроку(Ответы,3);
			ВопросОтвет = СтрЗаменить(ВопросОтвет,Символ(31),Символы.ПС);//разделитель вопросов US 1F заменю на Разделитель Строк 			
			ВремяНачала = ДатаИзСтрокиСКПК("01.01.0001 " + СтрПолучитьСтроку(ВопросОтвет, 2) + ":00");
			
			ВопросОтвет = СтрПолучитьСтроку(Ответы,4);			
			ВопросОтвет = СтрЗаменить(ВопросОтвет,Символ(31),Символы.ПС);//разделитель вопросов US 1F заменю на Разделитель Строк 			
			ТипЗадания = СтрПолучитьСтроку(ВопросОтвет, 2);
			
			ВопросОтвет = СтрПолучитьСтроку(Ответы,5);			
			ВопросОтвет = СтрЗаменить(ВопросОтвет,Символ(31),Символы.ПС);//разделитель вопросов US 1F заменю на Разделитель Строк 			
			ВопросОтвет = СтрЗаменить(СтрПолучитьСтроку(ВопросОтвет, 2), " #", Символы.ПС);
			ГруппаЗадания = СтрПолучитьСтроку(ВопросОтвет, 2);
			
			ВопросОтвет = СтрПолучитьСтроку(Ответы,6);			
			ВопросОтвет = СтрЗаменить(ВопросОтвет,Символ(31),Символы.ПС);//разделитель вопросов US 1F заменю на Разделитель Строк 			
			Описание = СтрПолучитьСтроку(ВопросОтвет, 2);
			
			//проверяем наличие задания с такими же параметрами - Агент, Дата, ТипЗадания, ГруппаЗадания
			
			запросПоискЗадания = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ Ссылка ИЗ Документ.Событие
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
			|	И Ответственный = &Ответственный
			|	И ГруппаСобытия = &ГруппаСобытия
			|	И ОписаниеСобытия ПОДОБНО &СодержаниеСобытия
			|	И Контрагент = &Контрагент");
			
			запросПоискЗадания.УстановитьПараметр("Дата", СтрШапок.Дата);
			запросПоискЗадания.УстановитьПараметр("Ответственный", Исполнитель);
			запросПоискЗадания.УстановитьПараметр("ГруппаСобытия", ГруппаЗадания);
			запросПоискЗадания.УстановитьПараметр("СодержаниеСобытия", ТипЗадания);
			запросПоискЗадания.УстановитьПараметр("Контрагент", Контрагент);
			
			существующиеЗадания = запросПоискЗадания.Выполнить().Выгрузить();
			
			Если существующиеЗадания.Количество() > 0 Тогда
				//задание с такими параметрами уже существует. надо что-то изменить
				СерверПослатьОтвет(Адрес, ОтветПоВыгрузкеДокумента("", , "Задание уже существует"), 0);
				ДобавитьОшибку("Задание уже существует");			
			Иначе
				СтатусПроведения = 0;
				Если ТранзакцияАктивна() Тогда
					Ответ = ОтветПоВыгрузкеДокумента(СтрШапок.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
					СерверПослатьОтвет(Адрес,Ответ,0);			
				Иначе		
					НачатьТранзакцию();
					Попытка
						Событие = Документы.Событие.СоздатьДокумент();
						Событие.СостояниеСобытия=Перечисления.СостоянияСобытий.Запланировано;
						Событие.Дата=СтрШапок.Дата;
						Событие.НачалоСобытия=НачалоДня(СтрШапок.Дата)+Час(ВремяНачала)*60*60+Минута(ВремяНачала)*60;
						Событие.ОкончаниеСобытия=Событие.НачалоСобытия+СрокВыполнения*24*60*60 + 60*ПолучитьВремяВыполненияДляЗадания(ТипЗадания);
						Событие.Ответственный=Исполнитель;
						Событие.Контрагент=Контрагент;
						Событие.ОписаниеСобытия=ТипЗадания;
						Событие.СодержаниеСобытия=Описание + Символы.ПС + СтрШапок.Комментарий;
						Событие.ГруппаСобытия=ГруппаЗадания;
						Событие.Записать();
						ЗафиксироватьТранзакцию();
						СтатусПроведения = 1;	
					Исключение				
						глПоследняяОшибкаПроведения = ОписаниеОшибки();
						СтатусПроведения = 0;
						Если ТранзакцияАктивна() Тогда
							ОтменитьТранзакцию();
						КонецЕсли;					
					КонецПопытки;
					
					Если СтатусПроведения = 1 Тогда
						ДобавитьСообщение("Сформировано задание агенту "+Событие.Номер);
						СерверПослатьОтвет(Адрес,ОтветПоВыгрузкеДокумента(СтрШапок.ИдДок, Событие.Ссылка),0)
					Иначе
						Если ПустаяСтрока(глПоследняяОшибкаПроведения)=1 Тогда 
							глПоследняяОшибкаПроведения = "Неизвестная ошибка"; 
						КонецЕсли;
						СерверПослатьОтвет(Адрес,ОтветПоВыгрузкеДокумента(СтрШапок.ИдДок, , глПоследняяОшибкаПроведения),0);
						ДобавитьОшибку("Ошибка при проведении задания агенту");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СерверПослатьОтвет(Адрес, РазделительСтрок, 1);
	
	Возврат Истина;
КонецФункции

// Создаёт таблицы шапок и строк документов, загружаемых с КПК
// Параметры:
// 		ТелоЗапроса - Строка, текст запроса, поступившего с КПК
// 		НачСтр - Число, номер строки, начиная с которой идут данные о документе
// 		ТаблШапок - ТаблицаЗначений, сюда возвращается таблица со всеми реквизитами шапок
// 			загруженных документов в соответствии с протоколом обмена
// 		ТаблСтрок - ТаблицаЗначений, сюда возвращается таблица со всеми реквизитами строк
// 			загруженных документов в соответствии с протоколом обмена
// 		ТаблКатегорий - ТаблицаЗначений, сюда возвращается таблица со всеми значениями категорий
// 			загруженных документов в соответствии с протоколом обмена
// Возвращаемое значение:
// 		Истина - успешная загрузка
// 		Ложь - ошибка
Функция ПолучитьТаблицыИнвентаризаций(ТелоЗапроса, НачСтр, ТаблШапок, ТаблСтрок, ТаблКатегорий)
	
	ТаблШапок = Новый ТаблицаЗначений;
	ТаблШапок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблШапок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фирма", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблШапок.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблШапок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблШапок.Колонки.Добавить("ТипЦен", Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры"));
	ТаблШапок.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Док", Новый ОписаниеТипов("ДокументСсылка.ИнвентаризацияТоваровНаСкладе"));
	ТаблШапок.Колонки.Добавить("Время", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Форма", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));//время работы с документом в минутах
	ТаблШапок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Задание", Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фото", Новый ОписаниеТипов("Строка"));

	ТаблСтрок = Новый Таблицазначений;
	ТаблСтрок.Колонки.Добавить("ИдДок", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблСтрок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблСтрок.Колонки.Добавить("Партия");
	ТаблСтрок.Колонки.Добавить("Колво", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Единица", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблСтрок.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число"));
	ТаблСтрок.Колонки.Добавить("Форма", Новый ОписаниеТипов("Строка"));
	ТаблСтрок.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"));
	ТаблСтрок.Колонки.Добавить("ДопРеквизиты", Новый ОписаниеТипов("Строка"));
	
	ПолучитьТаблицуКатегорий(ТаблКатегорий);
	
	спрНом = Справочники.Номенклатура.ПустаяСсылка();
	
	Н = НачСтр;
	КолСтр = СтрЧислоСтрок(ТелоЗапроса);
	Пока Н <= КолСтр Цикл
		ТекСтр = СтрПолучитьСтроку(ТелоЗапроса,Н);
		Параметры = СтрЗаменить(ТекСтр, Таб, РазделительСтрок);
		НовСтр = ТаблШапок.Добавить();
		
		ДатаВремя=СтрПолучитьСтроку(Параметры,1);
		ИдДок=СтрПолучитьСтроку(Параметры,2);
		НомерДок=СтрПолучитьСтроку(Параметры,3);
		Фирма=СтрПолучитьСтроку(Параметры,4);
		Склад=СтрПолучитьСтроку(Параметры,5);
		Клиент=СтрПолучитьСтроку(Параметры,6);
		ТипЦен=СтрПолучитьСтроку(Параметры,7);
		Комментарий=СтрПолучитьСтроку(Параметры,8);
		Ответ=СтрПолучитьСтроку(Параметры,10);
		ДатаСоздания=ДатаИзСтрокиСКПК(СтрПолучитьСтроку(Параметры,11));
		ВремяРаботы=ДатаИзСтрокиСКПК(СтрПолучитьСтроку(Параметры,12));
		ДопРеквизиты=СтрПолучитьСтроку(Параметры,13);
		Задание=СтрПолучитьСтроку(Параметры,14);
		Фото=СтрПолучитьСтроку(Параметры,15);
		
		дв = ДатаИзСтрокиСКПК(ДатаВремя);
		НовСтр.Время = Сред(ДатаВремя,12); 
		НовСтр.Дата  = дв;
		НовСтр.ИдДок=ИдДок;
		НовСтр.Номер=НомерДок;
		НовСтр.Фирма=Справочники.Организации.НайтиПоКоду(Фирма);
		Если НовСтр.Фирма=Неопределено Тогда 
			НовСтр.Фирма=Справочники.Организации.ПустаяСсылка(); 
		КонецЕсли;

		НовСтр.Склад = ПолучитьСсылкуПоGUID(Склад,"Склады");
		
		мКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		мАдресДоставки = "";
		
		ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
		Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
			ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
			Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
				Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
					ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		
		ПолучитьКонтрагентаИАдресПоКоду(Клиент,мКонтрагент,мАдресДоставки, ПапкаРодителя);
		НовСтр.Контрагент = мКонтрагент;
		НовСтр.ТипЦен = ПолучитьСсылкуПоGUID(ТипЦен,"ТипыЦенНоменклатуры");
		
		НовСтр.Комментарий = Комментарий;
		НовСтр.Ответ = Ответ;
		НовСтр.ВремяРаботы = ВремяРаботы;
		НовСтр.ДатаСоздания = ДатаСоздания;
		НовСтр.ДопРеквизиты = ДопРеквизиты;
		НовСтр.Задание = Задание;
		НовСтр.Фото = СтрЗаменить(Фото,Символ(31),РазделительСтрок);
		
		//заполнить таблицу категорий
		Н = Н + 1;
		ТекСтр = СтрПолучитьСтроку(ТелоЗапроса,Н);
		Пока ТекСтр <> "" Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр,Таб);
			Если ПозРазд <> 0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд-1);
				ТекСтр = Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
			НайденныйОбъект = НайтиОбъектКатегория(Парам);
			Если ЗначениеЗаполнено(НайденныйОбъект) Тогда
				НовСтр = ТаблКатегорий.Добавить();
		        НовСтр.ИдДок = ИдДок;
    			НовСтр.Категория = НайденныйОбъект;
			КонецЕсли; 
        КонецЦикла;
			
		Пока Истина Цикл
			Н = Н + 1;
			Если Н > КолСтр Тогда Прервать; КонецЕсли;
			
			ТекСтр = СтрПолучитьСтроку(ТелоЗапроса,Н);
			Если ТекСтр = "" Тогда Прервать; КонецЕсли;
			
			НовСтр = ТаблСтрок.Добавить();
			НовСтр.ИдДок = ИдДок;
			
			Параметры=СтрЗаменить(ТекСтр,Таб,РазделительСтрок);
			
			Товар=СтрПолучитьСтроку(Параметры,1);
			НовСтр.Партия = "";
			Если Конфигурация = "БухБеларусь" Тогда
				ПарамНом = СтрЗаменить(Товар, "#", Символы.ПС);
				спрНом = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(ПарамНом,1), "Номенклатура");
				Если СтрЧислоСтрок(ПарамНом) =2 Тогда
					НовСтр.Партия = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(ПарамНом,2), "Партии");
					Если спрНом = Справочники.Партии.ПустаяСсылка() Тогда
						ДобавитьОшибку("Загрузка инвентаризации " + ИдДок + ".Неизвестная партия номенклатуры с кодом " + СтрПолучитьСтроку(ПарамНом,2));
					КонецЕсли;
				КонецЕсли;
			Иначе
				спрНом = ПолучитьСсылкуПоGUID(Товар, "Номенклатура");
			КонецЕсли;
			Если спрНом = Справочники.Номенклатура.ПустаяСсылка() Тогда
				ДобавитьОшибку("Загрузка инвентаризации " + ИдДок + ".Неизвестная номенклатура с кодом " + СтрПолучитьСтроку(ПарамНом,1));
			Иначе	
				НовСтр.Номенклатура = спрНом;
			КонецЕсли;
			ТекНоменклатура = Парам;
			Колво=СтрПолучитьСтроку(Параметры,2);
			Единица=СтрПолучитьСтроку(Параметры,3);
			Коэффициент=СтрПолучитьСтроку(Параметры,4);
			Цена=СтрПолучитьСтроку(Параметры,5);
			Ответ=СтрПолучитьСтроку(Параметры,7);
			ДопРеквизиты = ?(СтрЧислоСтрок(Параметры) >= 8, СтрПолучитьСтроку(Параметры,8), "");
			спрНом = ПолучитьСсылкуПоGUID(Товар, "Номенклатура");
			НовСтр.Колво=ПолучитьЧислоИзСтроки(Колво);
			НайденныйОбъект = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Единица);
			Если НайденныйОбъект.Пустая() Тогда
				ДобавитьОшибку(
					"Загрузка инвентаризации "+ИдДок+".Неизвестная единица номенклатуры "+НовСтр.Номенклатура+" с кодом "+Единица);
			Иначе	
				НовСтр.Единица = НайденныйОбъект;
			КонецЕсли;
			НовСтр.Коэффициент=ПолучитьЧислоИзСтроки(Коэффициент);
			НовСтр.Цена=ПолучитьЧислоИзСтроки(Цена);
			НовСтр.Ответ=Ответ;
			НовСтр.ДопРеквизиты=ДопРеквизиты;
		КонецЦикла;
		
		Н = Н + 1;
	КонецЦикла;

	Возврат Н;
КонецФункции

// Заполняет все реквизиты документа ИнвентаризацияТоваровНаСкладе при его загрузке из КПК
// Параметры:
// 		Док - ДокументОбъект, загружаемый документ
// 		СтрШапки - ТаблицаЗначений, содержащая все реквизиты шапки в соответствии с протоколом обмена
// 		ТаблТовары - ТаблицаЗначений, содержащая все реквизиты таблицы документа в соответствии
// 			с протоколом обмена
Процедура ЗаполнитьРеквизитыИнвентаризации(Док, СтрШапки, ТаблТовары)
	Док.Дата			= ДатаИзДатаИВремя(СтрШапки.Дата, ТекущаяДата());  //Время поставим текущее
	Док.Комментарий		= СтрШапки.Комментарий;
	Док.Склад			= ?(ЗначениеЗаполнено(СтрШапки.Склад), СтрШапки.Склад, ПараметрыАгента.Склады[0].Склад);
	Док.Ответственный	= ПараметрыАгента.Агент;
	
	Если ПараметрыАгента.Организации.Количество() > 0 Тогда
		Док.Организация = ПараметрыАгента.Организации[0].Организация;
	Иначе
		Выборка = Справочники.Организации.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления Тогда Продолжить; КонецЕсли;
			Док.Организация = Выборка.Ссылка;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	МассивИсклСчетов = Новый Массив();         
	Если Конфигурация = "БухКазахстан" Тогда
		//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
		//	Док.Автор = ПараметрыАгента.Агент;
		//КонецЕсли;
	Иначе
		МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЦенностиВЭксплуатации);
		МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
	КонецЕсли; 
	
	СтруктураВалютаКПК = Неопределено;
	Если ПараметрыАгента.ВалютаКПК <> мВалютаРегламентированногоУчета Тогда
		СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
	КонецЕсли;
	
	Док.ЗаполнитьПоОстаткамНаСкладе();
	
	Для Каждого СтрСтрок Из Док.Товары Цикл  //по строкам Табличной части
		СтрСтрок.Количество = 0;
		СтрСтрок.Сумма = 0;
	КонецЦикла;
	
	Для Каждого СтрСтрок Из ТаблТовары Цикл  //по строкам Табличной части
		Отбор = Новый Структура();
		Если Конфигурация = "БухБеларусь" Тогда
			Отбор.Вставить("Номенклатура,Партия", СтрСтрок.Номенклатура, СтрСтрок.Партия);
		Иначе
			Отбор.Вставить("Номенклатура", СтрСтрок.Номенклатура);
		КонецЕсли;
		СтрТов = Док.Товары.НайтиСтроки(Отбор);
		Если СтрТов.Количество() = 0 Тогда
			НовСтр = Док.Товары.Добавить();
			НовСтр.Номенклатура	= СтрСтрок.Номенклатура;
			НовСтр.Количество	= СтрСтрок.Колво;
			НовСтр.Цена = СтрСтрок.Цена;
			Если СтруктураВалютаКПК <> Неопределено Тогда
				НовСтр.Цена = ПересчитатьИзВалютыВВалюту(НовСтр.Цена,
				ПараметрыАгента.ВалютаКПК, мВалютаРегламентированногоУчета,
				СтруктураВалютаКПК.Курс, 1,
				СтруктураВалютаКПК.Кратность, 1);
			КонецЕсли;
			НовСтр.Сумма = НовСтр.Количество * НовСтр.Цена;
			Если Конфигурация = "БухКазахстан" Тогда
				НовСтр.ЕдиницаИзмерения	= НовСтр.Номенклатура.БазоваяЕдиницаИзмерения;
			ИначеЕсли Конфигурация = "БухБеларусь" Тогда
				НовСтр.СчетУчетаБУ = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, НовСтр.Номенклатура, Док.Склад, Док.Дата).СчетУчетаБУ;
			Иначе
				НовСтр.СчетУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, НовСтр.Номенклатура, Док.Склад, Док.Дата).СчетУчета;
			КонецЕсли;
			ОбработатьДопРеквизитыСтрокиТЧ(Док, НовСтр, СтрСтрок.ДопРеквизиты, "37", "0");	
			Продолжить;
		КонецЕсли;
		НовСтр = СтрТов[0];
		НовСтр.Количество	= СтрСтрок.Колво;
		НовСтр.Сумма = НовСтр.Количество * СтрСтрок.Цена;
		ОбработатьДопРеквизитыСтрокиТЧ(Док, НовСтр, СтрСтрок.ДопРеквизиты, "37", "0");	
	КонецЦикла;

	Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
		Док.УстановитьНовыйНомер(Док.Организация.Префикс);
	Иначе
		Док.Номер = СтрШапки.Номер;
	КонецЕсли;
	//запускаем обработку дополнительных реквизитов			
	ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "37", "0");
КонецПроцедуры

// Создаёт документ Инвентаризация на основе таблиц шапок и строк
// Параметры
// Адрес - идентификатор сессии обмена
// ТаблШапок - таблица значений с "шапками" документов
// ТаблСтрок - таблица значений с данными для табличной части Товары
// ТаблПользователей - Таблица значений с перечнем пользователей которых нужно оповещать о созданных документах
// ТаблКатегорий - Таблица категорий документа
Процедура СоздатьИнвентаризации(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий)
	
	ДобавитьСообщение("Формируются Инвентаризации...");
	
	ВремТабл = СоздатьТаблицуСтрокРН(); //временная таблица
	Для Каждого СтрШапки Из ТаблШапок Цикл
		СтруктПоиска = Новый Структура;
		СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
		ТаблТовары = ТаблСтрок.Скопировать(СтруктПоиска); //Таблица с товарами в накладной
		ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); //Таблица категорий
		
		УникДок = СформироватьУникальныйКодДокумента("Инвентар.", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес, Ответ, 0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			НачатьТранзакцию();
			Попытка
				Если НЕ ЗначениеЗаполнено(СтрШапки.Склад) Тогда
					ВызовемИсключение = 1 / 0;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ТаблСтрок.Количество() = 0) Тогда
					ВызовемИсключение = 1 / 0;
				КонецЕсли;
				Док = Документы.ИнвентаризацияТоваровНаСкладе.СоздатьДокумент();
				ЗаполнитьРеквизитыИнвентаризации(Док, СтрШапки, ТаблТовары);
					
				//инвентаризации проводить нельзя, просто сохраняем документ
				Док.Записать();
				ЗаписатьУникКодДокумента(Док, УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
				//добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение  = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение  = СтрШапки.ДатаСоздания;
				МенеджерЗаписи.Записать(Истина);

				//событие завершим любым доступным документом
				ЗавершитьСобытие(Адрес, Платформа, "Наличие и цены", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				
				//фотографии запишем
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки.Фото, 37);
				ЗафиксироватьТранзакцию();
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
				ОтменитьТранзакцию();
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ Инвентаризация не создан"; 
					Если ПараметрыАгента.ПроводитьПродажа Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Не выбран склад ИЛИ таблица товаров не заполнена";
					СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл("Ошибка создания документа Инвентаризация: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	СерверПослатьОтвет(Адрес, РазделительСтрок, 1);
КонецПроцедуры                      

// Создаёт новый документ ПеремещениеТоваров при загрузке из КПК
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		Платформа - идентификатор платформы КПК
// 		ТаблШапок - ТаблицаЗначений, таблица со всеми реквизитами шапок
// 			документов в соответствии с протоколом обмена
// 		ТаблСтрок - ТаблицаЗначений, таблица со всеми реквизитами строк
// 			документов в соответствии с протоколом обмена
// 		ТаблПользователей - ТаблицаЗначений, содержит в колонке "Пользователь" пользователей, которым
// 			отправить оповещение о загрузке документа
// 		ТаблКатегорий - ТаблицаЗначений, таблица со всеми значениями категорий
// 			документов в соответствии с протоколом обмена
//		ТипСоздаваемогоДокумента - Строка, наименование документа на КПК, из которого создать перемещение
Процедура СоздатьПеремещениеТоваров(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий)
	ДобавитьСообщение("Формируются перемещение товаров...");
	
	текДата = ТекущаяДата();
	Для Каждого СтрШапки Из ТаблШапок Цикл
		УникДок = СформироватьУникальныйКодДокумента("Перемещение", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		Если СсылкаДок <> Неопределено Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, СсылкаДок);
			СерверПослатьОтвет(Адрес,Ответ,0);
			ДобавитьОшибку("Документ " + УникДок + " уже загружен ранее.");
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Неопределено, ОшибкаВыгрузкаСАктивнойТранзакцией);
			СерверПослатьОтвет(Адрес,Ответ,0);			
		Иначе		
			глПоследняяОшибкаПроведения = "";
			нетОшибок = Истина;
			НачатьТранзакцию();
			Попытка
				Если НЕ ЗначениеЗаполнено(СтрШапки.Склад) Тогда
					ВызовемИсключение = 1 / 0;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ТаблСтрок.Количество() = 0) Тогда
					ВызовемИсключение = 1 / 0;
				КонецЕсли;
				
				Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
				Док.Дата = ДатаИзДатаИВремя(СтрШапки.Дата, текДата);  //Время поставим текущее
				Док.Комментарий = СтрШапки.Комментарий;		
				Док.СкладОтправитель = СтрШапки.Склад;		
				Док.СкладПолучатель = ПараметрыАгента.Склады[0].Склад;
				Док.Организация = ПараметрыАгента.Организации[0].Организация; //Организацию берем первую из настроек агента 
				Док.Ответственный = ПараметрыАгента.Агент;
				Если Конфигурация = "БухБеларусь" Тогда
					Док.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
				КонецЕсли;
				Если Конфигурация = "БухКазахстан" Тогда
					//Если ПараметрыАгента.ЗаполнятьАвтораВДокументах Тогда
					//	Док.Автор = ПараметрыАгента.Агент;
					//КонецЕсли;
					Док.УчитыватьКПН = ОрганизацияПлательщикКПН(Док.Организация);
					Если Док.УчитыватьКПН Тогда
						Док.ВидУчетаНУ = Справочники.ВидыУчетаНУ.НУ;
					КонецЕсли;
				Иначе
					Док.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
				КонецЕсли;
				
				СтруктПоиска = Новый Структура;
				СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
				МассивСтрок = ТаблСтрок.НайтиСтроки(СтруктПоиска);
				ТаблКат = ТаблКатегорий.Скопировать(СтруктПоиска); 	
				
				СтруктураВалютаКПК = Неопределено;
				Если ПараметрыАгента.ВалютаКПК <> мВалютаРегламентированногоУчета Тогда
					СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
				КонецЕсли;
		
				Для Каждого СтрСтрок Из МассивСтрок Цикл
					Если СтрСтрок.Колво <= 0 Тогда 
						Продолжить; 
					КонецЕсли;
					СтрДок = Док.Товары.Добавить();
					СтрДок.Номенклатура		= СтрСтрок.Номенклатура;
					Если Конфигурация = "БухБеларусь" И СтрСтрок.Партия <> ""  Тогда
						СтрДок.Партия				= СтрСтрок.Партия;
					КонецЕсли;
					Если Док.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
						СтрДок.ЕдиницаИзмерения	= СтрСтрок.Единица;
						СтрДок.Коэффициент		= СтрСтрок.Коэффициент;
					КонецЕсли;
					СтрДок.Количество		= СтрСтрок.Колво;
				    СчетаУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрДок.Номенклатура, Док.СкладОтправитель, Док.Дата);
					Если Конфигурация = "БухКазахстан" Тогда
						СтрДок.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
						СтрДок.НовыйСчетУчетаБУ = СтрДок.СчетУчетаБУ;
						УправлениеПроизводством.ЗаполнитьСчетНалоговогоУчетаВСтрокеТабличногоПоля(СтрДок, "СчетУчетаБУ", "СчетУчетаНУ", Док.Дата);	
						СтрДок.НовыйСчетУчетаНУ = СтрДок.СчетУчетаНУ;
					ИначеЕсли Конфигурация = "БухБеларусь" Тогда
						СтрДок.Цена = СтрСтрок.Цена;
						Если СтруктураВалютаКПК <> Неопределено Тогда
							СтрДок.Цена = ПересчитатьИзВалютыВВалюту(СтрДок.Цена,
								ПараметрыАгента.ВалютаКПК, мВалютаРегламентированногоУчета,
								СтруктураВалютаКПК.Курс, 1,
								СтруктураВалютаКПК.Кратность, 1);
						КонецЕсли;
					Иначе
						СтрДок.Цена = СтрСтрок.Цена;
						Если СтруктураВалютаКПК <> Неопределено Тогда
							СтрДок.Цена = ПересчитатьИзВалютыВВалюту(СтрДок.Цена,
								ПараметрыАгента.ВалютаКПК, мВалютаРегламентированногоУчета,
								СтруктураВалютаКПК.Курс, 1,
								СтруктураВалютаКПК.Кратность, 1);
						КонецЕсли;
						СтрДок.СчетУчета = СчетаУчета.СчетУчета;
						СтрДок.НовыйСчетУчета = ПолучитьСчетаУчетаНоменклатуры(Док.Организация, СтрДок.Номенклатура, Док.СкладПолучатель, Док.Дата).СчетУчета;
					КонецЕсли;
					ОбработатьДопРеквизитыСтрокиТЧ(Док, СтрДок, СтрСтрок.ДопРеквизиты, "37", "1");	
					
				КонецЦикла;
				
				Если Конфигурация = "БухБеларусь" Тогда
					//Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
					Док.ЗаполнитьСчетаУчетаВТабЧасти(Док.Товары, "Товары", Истина, Истина);
				КонецЕсли;
				
				Если ПараметрыАгента.СпособНумерацииДокументов = 0 Тогда //Стандартная 
					Док.УстановитьНовыйНомер(Док.Организация.Префикс);
				Иначе
					Док.Номер = СтрШапки.Номер;
				КонецЕсли;
				
				//запускаем обработку дополнительных реквизитов			
				ОбработатьДопРеквизитыДокумента(Док, СтрШапки.ДопРеквизиты, "37", "1");
				
				Если ПараметрыАгента.ПроводитьНаличиеИЦены Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					Док.Записать();
				КонецЕсли;
				
			Исключение
				нетОшибок = Ложь;
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				ИначеЕсли Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
					глПоследняяОшибкаПроведения = "Не выбран склад ИЛИ таблица товаров не заполнена";
				КонецЕсли;
			КонецПопытки;
			
			Если нетОшибок Тогда
				ЗаписатьУникКодДокумента(Док, УникДок);
				//заполнить категории документа
				ЗаполнитьКатегорииДокумента(Док.Ссылка, ТаблКат);
				//добавить свойство Время работы с документом
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУВремяСозданияДокумента;
				МенеджерЗаписи.Значение  = Строка(СтрШапки.ВремяРаботы);
				МенеджерЗаписи.Записать(Истина);
				МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект    = Док.ссылка;
				МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
				МенеджерЗаписи.Значение  = СтрШапки.ДатаСоздания;
				МенеджерЗаписи.Записать(Истина);
				
				ЗавершитьСобытие(Адрес, Платформа, "Наличие и цены", Док.Дата, СтрШапки.Контрагент, Док.Ссылка, УникДок, Строка(СтрШапки.ВремяРаботы), СтрШапки.Задание);
				ЗаписатьФотоДокумента(Док.Ссылка, СтрШапки.Фото, 37);
				ЗафиксироватьТранзакцию();
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, Док.Ссылка);
				СерверПослатьОтвет(Адрес,Ответ,0);
			Иначе
				ОтменитьТранзакцию();
				Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
					глПоследняяОшибкаПроведения="Документ Перемещение не создан"; 
					Если ПараметрыАгента.ПроводитьНаличиеИЦены Тогда
						глПоследняяОшибкаПроведения = "Ошибка при проведении документа. Обратитесь в офис, чтобы узнать подробности";
					КонецЕсли;
				КонецЕсли;
				СообщениеАгентуОбОшибке = глПоследняяОшибкаПроведения;
				Ответ = ОтветПоВыгрузкеДокумента(СтрШапки.ИдДок, , СообщениеАгентуОбОшибке);
				СерверПослатьОтвет(Адрес, Ответ, 0);
				ДобавитьВЛогФайл("Ошибка создания документа Перемещение: " + глПоследняяОшибкаПроведения, ПараметрыАгента.Агент, 0);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;

	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
КонецПроцедуры

// Разбирает запрос на загрузку инвентаризации и помещает данные в таблицы шапок и строк
// Адрес - идентификатор сессии обмена
// ТелоЗапроса - Текст полученный от КПК 
Функция ЗагрузитьИнвентаризации(Адрес, Платформа,ТелоЗапроса)
	ТекстДок = ?(ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация = 0, "инвентаризации", "перемещения товаров");
	Если НЕ ПорцияОбмена(Адрес,"OK","Загружаются " + ТекстДок + "...") Тогда
		возврат ложь;
	КонецЕсли; 
	
	ТаблШапок=""; ТаблСтрок=""; ТаблКатегорий="";
	ПолучитьТаблицыИнвентаризаций(ТелоЗапроса, 5, ТаблШапок, ТаблСтрок, ТаблКатегорий);
	
	ТаблПользователей = ПрочитатьПользователейДляОповещения(ПараметрыАгента.Агент); //это Табл значений
	ТипСоздаваемогоДок = ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация;
	Если ТипСоздаваемогоДок = 0 Тогда
		СоздатьИнвентаризации(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
	ИначеЕсли ТипСоздаваемогоДок = 1 Тогда
		СоздатьПеремещениеТоваров(Адрес, Платформа, ТаблШапок, ТаблСтрок, ТаблПользователей, ТаблКатегорий);
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Выполняет формирование строк, содержащих значения реквизитов документа после коррекции
// в соответствии с протоколом обмена
// Параметры:
// 		Док - ДокументОбъект, претерпевший изменения алгоритмом коррекции
// 		СтрШапки - ТаблицаЗначений, содержит все реквизиты шапок корректируемых документов
// 			в соответствии с протоколом обмена
//		ТаблТовары - ТаблицаЗначений, содержит все реквизиты строк корректируемых документов
// 			в соответствии с протоколом обмена
// 		Ответ - Строка, к которой добавляется ответ для КПК
Процедура ЭкспортироватьНакладную(Док, СтрШапки, ТаблТовары, Ответ)
	КонтрагентКод = СокрЛП(Док.Контрагент.Код);
	кодКонтрагента = КонтрагентКод;
	Если СпособОрганизацииТТ = 1 И НЕ Док.АдресДоставки = "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Вид.Код КАК КодАдресаДоставки
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Контрагент
		|	И КонтактнаяИнформация.Представление ПОДОБНО &АдресДоставки
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КонтактнаяИнформация.Вид В(&ВидыКИ)";		
		Запрос.УстановитьПараметр("Контрагент", Док.Контрагент);
		Запрос.УстановитьПараметр("АдресДоставки", Док.АдресДоставки);
		Запрос.УстановитьПараметр("ВидыКИ", АдресаДляТТ.ВыгрузитьКолонку("АдресДляТТ"));
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			//код составим из кода контрагента и кода адреса
			кодКонтрагента = УпаковатьКодКонтрагентаИКодАдреса(КонтрагентКод, Выборка.КодАдресаДоставки);
		КонецЦикла;
	КонецЕсли;
	
	Шапка=
		ДатаВремяВСтрокуДляКПК(СтрШапки.Дата)+Таб
		+ СтрШапки.ИдДок+Таб
		+ СтрШапки.Номер+Таб
		+ СокрЛП(Док.Организация.Код)+Таб
		+ кодКонтрагента+Таб
		+ УникИдентификатор(Док.ДоговорКонтрагента)+Таб
		+ УникИдентификатор(Док.Склад)+Таб
		+ СтрШапки.Самовывоз+Таб
		+ СтрШапки.Комментарий+Таб
		+ УникИдентификатор(Док.ТипЦен)+Таб
		+ ?(СтрШапки.Проводной,"1","0")+Таб
		+ "0"+Таб
		+ ДатаВремяВСтрокуДляКПК(СтрШапки.ВремяДоставки)+Таб
		+ "0"+Таб
		+ СтрШапки.Форма+Таб
		+ СтрШапки.Ответ+Таб
		+ ДатаВремяВСтрокуДляКПК(СтрШапки.Время)+Таб
		+ СтрШапки.ДопРеквизиты + РазделительСтрок;
	
	ТаблДок = Док.Товары.Выгрузить();
	Для Каждого СтрДок Из Док.Услуги Цикл
		НовСтр=ТаблДок.Добавить();
		НовСтр.Номенклатура=СтрДок.Номенклатура;
		НовСтр.Количество=СтрДок.Количество;
		НовСтр.Цена=СтрДок.Цена;
		НовСтр.Сумма=СтрДок.Сумма;
		Если Док.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
			НовСтр.ЕдиницаИзмерения=СтрДок.Номенклатура.БазоваяЕдиницаИзмерения;
			НовСтр.Коэффициент=НовСтр.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	Строки = "";
	Ссылка = Неопределено;
	Для Каждого СтрТов Из ТаблДок Цикл
		СтрокиТабл = ТаблТовары.НайтиСтроки(Новый Структура("Номенклатура", СтрТов.Номенклатура));
		Если СтрокиТабл.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрТабл = СтрокиТабл[0];
		
		Строки = Строки
			+ УникИдентификатор(СтрТов.Номенклатура)+Таб
			+ КоличествоВСтроку(СтрТов.Количество)+Таб
			+ СокрЛП(СтрТов.ЕдиницаИзмерения.Код)+Таб
			+ КоличествоВСтроку(СтрТов.Коэффициент)+Таб
			+ ""+Таб
			+ СуммаВСтроку(Окр(СтрТов.Сумма / СтрТов.Количество, 2))+Таб
			+ СуммаВСтроку(СтрТов.Сумма)+Таб
			+ ?(СтрТабл = Неопределено,
				"" + Таб
				+ "" + Таб
				+ "" + Таб
				+ "0" + Таб
				+ "" + Таб
				+ "",
				?(СтрТабл.Остаток = -1, 
					"", 
					КоличествоВСтроку(СтрТабл.Остаток)) + Таб
					+ СтрТабл.Форма + Таб
					+ СтрТабл.Ответ + Таб
					+ "0" + Таб
					+ ?(СтрТабл.Фейсинг = -1, 
						"", 
						КоличествоВСтроку(СтрТабл.Фейсинг)) + Таб
					+ СтрТабл.ДопРеквизиты) + РазделительСтрок;						
	КонецЦикла;
	
	//добавим из исходного документа товары для которых не указано количество, а собраны только остатки
	ТолькоОстатки = ТаблТовары.НайтиСтроки(новый Структура("Колво",0));
	отбор = новый Структура("Номенклатура");
	для каждого ост из ТолькоОстатки Цикл
		//если в табличной части документа нет данных по этой строке, то надо её выгрузить
		отбор.Номенклатура = ост.Номенклатура;
		Если ТаблДок.НайтиСтроки(отбор).Количество() = 0 Тогда
			Строки=Строки
				+ УникИдентификатор(ост.Номенклатура)+Таб
				+ КоличествоВСтроку(ост.Колво)+Таб
				+ СокрЛП(ост.Единица.Код)+Таб
				+ КоличествоВСтроку(ост.Коэффициент)+Таб
				+ СуммаВСтроку(ост.Цена)+Таб
				+ СуммаВСтроку(ост.Сумма)+Таб
				+ ?(ост.Остаток = -1, "", КоличествоВСтроку(ост.Остаток)) + Таб
				+ ост.Форма + Таб
				+ ост.Ответ + Таб
				+ "0" + Таб
				+ ?(ост.Фейсинг = -1, "", КоличествоВСтроку(ост.Фейсинг)) + Таб
				+ ост.ДопРеквизиты + РазделительСтрок;			
		КонецЕсли;
	КонецЦикла;
	
	Ответ=Ответ+Шапка+Строки+РазделительСтрок;
КонецПроцедуры

// Выполняет загрузку реквизитов документа, коррекцию, подготовку отчёта об изменениях
// 		и отправку ответа КПК
// Параметры:
// 		ТелоЗапроса - Строка, запрос с КПК
// 		Табл - ТабличныйДокумент, в который формируется отчёт об изменениях
// 		Макет - Макет, на основе которого формируется отчёт об изменениях
// 		НомСтр - Число, номер строки, начиная с которой в запросе идёт информация о документе
// 		Ответ - Строка, в которую помещается ответ для КПК
// Возвращаемое значение:
// 		Число, номер строки, до которой выполнен разбор запроса
Функция СкорректироватьНакладную(ТелоЗапроса, Табл, Макет, НомСтр, Ответ)
	ТаблШапок=""; ТаблСтрок=""; ТаблКатегорий="";
	НомСтр = ПолучитьТаблицыНакладных(ТелоЗапроса, НомСтр + 1, ТаблШапок, ТаблСтрок, ТаблКатегорий);
	глПоследняяОшибкаПроведения = "";
	
	Для Каждого СтрШапки Из ТаблШапок Цикл
		Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		СтруктПоиска = Новый Структура;
		СтруктПоиска.Вставить("ИдДок", СтрШапки.ИдДок);
		ТаблТовары = ТаблСтрок.Скопировать(СтруктПоиска); //Таблица с товарами в накладной
		Попытка
			ЗаполнитьРеализациюТоваровИУслуг(Док, СтрШапки, ТаблТовары);
		Исключение
			нетОшибок = Ложь;
			Если ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда 
				глПоследняяОшибкаПроведения = ОписаниеОшибки();
			КонецЕсли;
			Если Найти(глПоследняяОшибкаПроведения, "Деление на 0") > 0 Тогда
				глПоследняяОшибкаПроведения = "Для контрагента " + Док.Контрагент + " не найден договор с покупателем";
			КонецЕсли;
		КонецПопытки;
		
		//при свертке теряются данные по распределению строк документа по складам, 
		//проблема - неясно как отрабатывать ситуацию когда строка разбивается на несколько 
		//различными складами
		Док.Товары.Свернуть("Номенклатура, ЕдиницаИзмерения, Коэффициент", "Количество, Сумма, СуммаНДС");
		
		ОтчетОбИзмененииДокумента(Табл, Макет, Док, СтрШапки, ТаблТовары, глПоследняяОшибкаПроведения);
		ЭкспортироватьНакладную(Док, СтрШапки, ТаблТовары, Ответ);
	КонецЦикла;
	
	Возврат НомСтр;
КонецФункции

// Выполняет загрузку реквизитов документа, коррекцию, подготовку отчёта об изменениях
// 		и отправку ответа КПК
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		ТелоЗапроса - Строка, запрос с КПК
// Возвращаемое значение:
// 		Истина, всегда
Функция СкорректироватьДокументы(Адрес, ТелоЗапроса)
	
	Табл = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ИзмененияДокумента");
	
	Ответ = "";
	ТекНомерСтр = 5;
	СтрокВЗапросе = СтрЧислоСтрок(ТелоЗапроса);
	Пока ТекНомерСтр <= СтрокВЗапросе Цикл
		ВидДок = СтрПолучитьСтроку(ТелоЗапроса,ТекНомерСтр);
		Если ВидДок = "Invoice" Или ВидДок = "Request" Тогда
			ТекНомерСтр = СкорректироватьНакладную(ТелоЗапроса, Табл, Макет, ТекНомерСтр, Ответ);
		Иначе
			Ответ = "CorrectionNotImplemented" + РазделительСтрок;
			Прервать;
		КонецЕсли;
		
		ТекНомерСтр = ТекНомерСтр + 1;
	КонецЦикла;
	
	СерверПослатьОтвет(Адрес, Ответ, 0);
	Ответ = "";
	
	Если Табл.ВысотаТаблицы=0 Тогда
		Секция = Макет.ПолучитьОбласть("НетИзменений");
		Секция.Параметры.Реквизит = "Никаких изменений НЕ предлагается";
		Табл.Вывести(Секция);
	КонецЕсли;
	
	ВремФайл = ПолучитьИмяВременногоФайла(".htm");
	//Табл.Показать();
	Табл.Записать(ВремФайл,ТипФайлаТабличногоДокумента[ПараметрыАгента.HTML]);
	Файл=Новый ЧтениеТекста;
	Файл.Открыть(ВремФайл,КодировкаТекста.UTF8);
	Ответ="";
	Счетчик=0;
	Пока Истина Цикл
		Стр=Файл.ПрочитатьСтроку();
		Если Стр=Неопределено Тогда 
			Прервать; 
		КонецЕсли;
		
		Ответ=Ответ +Стр+РазделительСтрок;
		
		Счетчик=Счетчик+1;
		Если Счетчик%100=0 Тогда
			СерверПослатьОтвет(Адрес,Ответ,0);
			Ответ="";
		КонецЕсли;
	КонецЦикла;
	Если Счетчик > 0 Тогда
		СерверПослатьОтвет(Адрес,Ответ,0);
		Ответ="";
	КонецЕсли;
	СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,1);
		
	Возврат Истина;
КонецФункции

//Формирует HTML-ку - отчет по последним трём продажам за последние 2 месяца
//Адрес - идентификатор сессии обмена
//Контрагенты - параметры, переданные КПК. На сегодня - код Контрагента
Процедура ОтчетПродажи(табДок, Контрагент, Договор, ДатаНачала, ДатаОкончания)	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Продажи.Ссылка КАК Документ,
	|	Продажи.Номенклатура КАК Номенклатура,
	|	СУММА(Продажи.Количество) КАК Колво
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Продажи
	|ГДЕ
	|	Продажи.Ссылка.Дата >= &ДатаНачала
	|	И Продажи.Ссылка.Дата <= &ДатаКонца
	|	И Продажи.Ссылка.Проведен" + ?(Договор.Пустая(), "", "
	|	И (Продажи.Ссылка.ДоговорКонтрагента = &Договор)") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Ссылка,
	|	Продажи.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продажи.Ссылка.Дата УБЫВ";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Если СпособОрганизацииТТ = 0 Тогда  //по холдингам
		Запрос.УстановитьПараметр("Контрагент", Контрагент.ГоловнойКонтрагент);
	Иначе
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли; 
	Запрос.УстановитьПараметр("Договор"		, Договор);
	Запрос.УстановитьПараметр("ДатаНачала"	, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца"	, ДатаОкончания);
	продажа = Запрос.Выполнить().Выбрать();
	
	ТекДок = Неопределено;
	
	отчет = ПолучитьМакет("ОтчетПродажи");
	область = отчет.ПолучитьОбласть("ШапкаОтчета");
	область.Параметры.Период = "с " + Формат(ДатаНачала, "ДЛФ=D") + " по " + Формат(ДатаОкончания, "ДЛФ=D");
	область.Параметры.КонтаргентДоговор = "Контрагента " + Строка(Контрагент) + " по договору " + Строка(Договор);	
	табДок.Вывести(область);
	
	Пока продажа.Следующий() Цикл
		Если ТекДок <> продажа.Документ Тогда
			область = отчет.ПолучитьОбласть("СтрокаДокумент");
			область.Параметры.Документ = Строка(продажа.Документ);
			табДок.Вывести(область);
			ТекДок = продажа.Документ;
		КонецЕсли;	
		область = отчет.ПолучитьОбласть("СтрокаНоменклатура");
		область.Параметры.Номенклатура = 
			продажа.Номенклатура.Наименование + ", " + продажа.Номенклатура.БазоваяЕдиницаИзмерения;
		область.Параметры.Количество = Формат(продажа.Колво, "ЧДЦ=3");
		табДок.Вывести(область);		
	КонецЦикла;	
КонецПроцедуры

// Формирует отчёт, построенный на базе Системы компоновки данных
// Параметры
// Табл - Табличный документ, в эту переменную будет помещен результат отчета
// стрОтчет - Строка таблицы СписокОтчетов
// 			из таблицы закладки Отчёты настроек агента
// ПарамАгент - агент для которого формируется отчет
// ПарамКонтрагент - контрагент для которого формируется Отчет
// ПарамДоговор - договор для которого формируется Отчет
// ПарамНоменклатура - номенклатура для которого формируется Отчет
// ПарамОтветственный - Агент для которого формируется Отчет
// НачальнаяДата - дата начала для отчета
// КонечнаяДата - дата окончания для отчета
Функция СформироватьОтчетСКД(
		Табл,
		Отчет,
		СохраненнаяНастройка,
		стрОтчет,
		ПарамКонтрагент=Неопределено,
		ПарамДоговор=Неопределено,
		ПарамНоменклатура=Неопределено,
		ПарамОтветственный=Неопределено,
		НачальнаяДата=Неопределено,
		КонечнаяДата=Неопределено)
	Если Отчет.СхемаКомпоновкиДанных=Неопределено Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Если СохраненнаяНастройка=Неопределено Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		Попытка
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ЗначениеИзСтрокиВнутр(СохраненнаяНастройка));
		Исключение
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		КонецПопытки;
	КонецЕсли;
	Отчет.КомпоновщикНастроек.Восстановить();
	
	Если стрОтчет.ПараметрыИзКПК=Истина Тогда
		ЭлемКонтрагент = Неопределено;
		ЭлемДоговор    = Неопределено;
		ЭлемОтветственный 	= Неопределено;
		ЭлемНоменклатура    = Неопределено;
		
		Отбор=Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		Для каждого ЭлемОтбора Из Отбор Цикл
			Если Строка(ЭлемОтбора.ЛевоеЗначение)=стрОтчет.ОтборПоКонтрагенту Тогда
				ЭлемКонтрагент = ЭлемОтбора;
			ИначеЕсли Строка(ЭлемОтбора.ЛевоеЗначение)=стрОтчет.ОтборПоДоговору Тогда
				ЭлемДоговор = ЭлемОтбора;
			ИначеЕсли Строка(ЭлемОтбора.ЛевоеЗначение) = стрОтчет.ОтборПоОтветственному Тогда
				ЭлемОтветственный = ЭлемОтбора;
			ИначеЕсли Строка(ЭлемОтбора.ЛевоеЗначение) = стрОтчет.ОтборПоНоменклатуре Тогда
				ЭлемНоменклатура = ЭлемОтбора;
			КонецЕсли; 
		КонецЦикла;
		
		// Если в настройках отчета нет отбора по полю контрагента, а контрагент выбран на КПК, - добавим отбор.
		// Если контрагент на КПК не выбран, отбор не устанавливается и отчет формируется по всем контрагентам
		Если ЗначениеЗаполнено(ПарамКонтрагент) И (ЭлемКонтрагент = Неопределено) Тогда
			ЭлемКонтрагент = ДобавитьЭлементОтбораПоПолю(
				Отчет.КомпоновщикНастроек.Настройки.Отбор, стрОтчет.ОтборПоКонтрагенту, Отчет.СхемаКомпоновкиДанных);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПарамКонтрагент) и (ЭлемКонтрагент  <> Неопределено) Тогда
			ЭлемКонтрагент.ПравоеЗначение	 = ПарамКонтрагент;
			ЭлемКонтрагент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлемКонтрагент.Использование  = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПарамДоговор) И (ЭлемДоговор <> Неопределено) Тогда
			ЭлемДоговор.ПравоеЗначение	= ПарамДоговор;
			ЭлемДоговор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
			ЭлемДоговор.Использование	= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПарамОтветственный) И (ЭлемОтветственный <> Неопределено) Тогда
			ЭлемОтветственный.ПравоеЗначение = ПарамОтветственный;
			ЭлемОтветственный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлемОтветственный.Использование  = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПарамНоменклатура) И (ЭлемНоменклатура <> Неопределено) Тогда
			ЭлемНоменклатура.ПравоеЗначение	= ПарамНоменклатура;
			ЭлемНоменклатура.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлемНоменклатура.Использование  = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Период=Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
	Новый параметрКомпоновкиДанных("Период"));
	Если Период<>Неопределено Тогда
		Попытка
			Период.Значение.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод;
			Период.Использование = Истина;
			//Если ((НачальнаяДата=Неопределено) ИЛИ (КонечнаяДата=Неопределено)) ИЛИ НЕ стрОтчет.ЗапрашиватьПериод Тогда
			//	ДатаНач=ТекущаяДата();
			//	ДатаКон=ТекущаяДата();
			//	ПолучитьИнтервалОтчета(стрОтчет,ДатаНач,ДатаКон);
			//	Период.Значение.ДатаНачала=НачалоДня(ДатаНач);
			//	Период.Значение.ДатаОкончания=КонецДня(ДатаКон);
			//Иначе
			//	Период.Значение.ДатаНачала=НачалоДня(НачальнаяДата);
			//	Период.Значение.ДатаОкончания=КонецДня(КонечнаяДата);
			//КонецЕсли;
			Период.Значение.ДатаНачала=НачалоДня(НачальнаяДата);
			Период.Значение.ДатаОкончания=КонецДня(КонечнаяДата);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Попытка		
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(НачальнаяДата));
	Исключение
	КонецПопытки;
	
	Попытка		
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонечнаяДата));
	Исключение
	КонецПопытки;

	
	
	Попытка
		Если ПараметрыАгента <> Неопределено Тогда
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Склад", ПараметрыАгента.Склады);
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПоВсемСкладам", (ПараметрыАгента.Склады.Количество()=0));
		Иначе
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПоВсемСкладам", Истина);
		КонецЕсли;
		
		
	Исключение
	КонецПопытки;
	
	
	ПараметрАгент = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый параметрКомпоновкиДанных("Ответственный"));
	Если ПараметрАгент <> Неопределено Тогда
		ПараметрАгент.Значение = ТекущийАгент;
		ПараметрАгент.Использование = Истина;
	КонецЕсли;
	
	Отчет.СформироватьОтчет(Табл);
КонецФункции

// Добавляет в отбор настроек отчета элемент отбора по полю, заданному в настройках отчета для КПК
// Параметры
//	Отбор - ОтборКомпоновкиДанных, отбор настроек отчета
//	ИмяПоля - Строка, путь к полю отчета или его заголовок
//	Схема - СхемаКомпоновкиДанных отчета, используется, если компоновщик настроек отчета не инициализирован
// Возвращаемое значение
//	ЭлементОтбораКомпоновкиДанных - добавленный элемент отбора, 
//	Неопределено - если поле не найдено среди доступных полей отбора
//
Функция ДобавитьЭлементОтбораПоПолю(Отбор, ИмяПоля, Схема = Неопределено)
	Если ПустаяСтрока(ИмяПоля) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДоступноеПоле = Неопределено;
	Попытка
		ДоступноеПоле = Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
	Исключение
	КонецПопытки;
	
	Если ДоступноеПоле = Неопределено Тогда
		// в настройках могло быть сохранено не имя поля, а его заголовок
		Для Каждого Поле Из Отбор.ДоступныеПоляОтбора.Элементы Цикл
			Если НЕ Поле.Папка И Поле.Заголовок = ИмяПоля Тогда
				ДоступноеПоле = Поле;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДоступноеПоле <> Неопределено Тогда
		ПолеОтбора = ДоступноеПоле.Поле;
	Иначе
		// компоновщик настроек отчета может быть не инициализирован схемой (например, во внешних отчетах
		// инициализация выполняется только при открытии формы), тогда ищем поле в наборах данных схемы
		ПутьКДанным = НайтиПутьКПолюВСхеме(Схема, ИмяПоля);
		Если ПутьКДанным = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		ПолеОтбора = Новый ПолеКомпоновкиДанных(ПутьКДанным);
	КонецЕсли;
	
	ЭлемОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлемОтбора.ЛевоеЗначение = ПолеОтбора;
	ЭлемОтбора.Использование = Ложь;
	Возврат ЭлемОтбора;
КонецФункции

// Ищет поле в наборах данных схемы компоновки по пути к данным или заголовку
// Параметры
//	Схема - СхемаКомпоновкиДанных
//	ИмяПоля - Строка, путь к полю или его заголовок
// Возвращаемое значение
//	Строка - путь к данным найденного поля, Неопределено - если поле не найдено
//
Функция НайтиПутьКПолюВСхеме(Схема, ИмяПоля)
	Если Схема = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Для Каждого НаборДанных Из Схема.НаборыДанных Цикл
		Для Каждого Поле Из НаборДанных.Поля Цикл
			Попытка
				Если Поле.ПутьКДанным = ИмяПоля ИЛИ Поле.Заголовок = ИмяПоля Тогда
					Возврат Поле.ПутьКДанным;
				КонецЕсли;
			Исключение
				// папки полей не содержат пути к данным
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Формирует Табличный документ с отчетом для передачи в КПК  
// Параметры
// Табл - Табличный документ, в эту переменную будет помещен результат отчета
// стрОтчет - Строка таблицы СписокОтчетов
// ПарамАгент - агент для которого формируется отчет
// ПарамКонтрагент - контрагент для которого формируется Отчет
// ПарамДоговор - договор для которого формируется Отчет
// ПарамНоменклатура - номенклатура для которого формируется Отчет
// ПарамОтветственный - Агент для которого формируется Отчет
// НачальнаяДата - дата начала для отчета
// КонечнаяДата - дата окончания для отчета
Процедура СформироватьОтчет(
		Табл,
		Агент,
		стрОтчет,
		ПарамКонтрагент=Неопределено,
		ПарамДоговор=Неопределено,
		ПарамНоменклатура=Неопределено,
		НачальнаяДата=Неопределено,
		КонечнаяДата=Неопределено) Экспорт
		
	Если стрОтчет.ТипОтчета = "Встроенный" Тогда
		ОтчетПродажи(Табл, ПарамКонтрагент, ПарамДоговор, НачальнаяДата, КонечнаяДата);		
	Иначе	
		Если НЕ ЗначениеЗаполнено(стрОтчет.ИмяОтчета) Тогда
			Сообщить("Не задано поле 'ИмяОтчета' для отчета "+стрОтчет.НазваниеОтчета);
		КонецЕсли;
		Если стрОтчет.ТипОтчета="Из конфигурации" Тогда //из конфигурации
			Попытка
				Отчет=Отчеты[стрОтчет.ИмяОтчета].Создать();  //попробуем создать отчет
			Исключение
				Сообщить("Не удалось найти в конфигурации отчет "+стрОтчет.ИмяОтчета);
				Возврат;
			КонецПопытки; 
		ИначеЕсли стрОтчет.ТипОтчета="Внешний отчет" Тогда //внешний 
			Попытка
				Отчет = ВнешниеОтчеты.Создать(стрОтчет.ИмяОтчета);
			Исключение
				Сообщить("Не удалось найти отчет "+стрОтчет.ИмяОтчета);
				Возврат;
			КонецПопытки; 
		КонецЕсли;
		
		текДата = ТекущаяДата();
		Если НачальнаяДата = Неопределено ИЛИ КонечнаяДата = Неопределено Тогда
			Если НЕ стрОтчет.ЗапрашиватьПериод Тогда
				НачальнаяДата=текДата;
				КонечнаяДата=текДата;
				ПолучитьИнтервалОтчета(стрОтчет,НачальнаяДата,КонечнаяДата);
			Иначе
				НачальнаяДата = НачалоДня(ДобавитьМесяц(текДата, -2));
				КонечнаяДата = КонецДня(текДата)
			КонецЕсли;
		КонецЕсли;
		
		//читаем настройки для этого отчета
		СохраненнаяНастройка = ПрочитатьИзРегистраСохраненныеНастройки(Агент, стрОтчет.КодОтчета);
		СформироватьОтчетСКД(
			Табл,
			Отчет,
			СохраненнаяНастройка,
			стрОтчет,
			ПарамКонтрагент,
			ПарамДоговор,
			ПарамНоменклатура, 
			Агент, 
			НачальнаяДата, 
			КонечнаяДата);
	КонецЕсли;
КонецПроцедуры

// Рассчитывает дату начала и окончания периода для формирования отчёта
// Параметры:
// 		стрОтчет - строка Таблицы значений, содержит параметры отчёта
// 			из таблицы закладки Отчёты настроек агента
// 		ДатаНач - Дата, сюда возвращается дата начала
// 		ДатаКон - Дата, сюда возвращается дата конца
Процедура ПолучитьИнтервалОтчета(стрОтчет,ДатаНач,ДатаКон);
	
	Если СокрЛП(стрОтчет.ЗначениеКонечнойДаты)="Сегодня" Тогда
		ДатаКон=ТекущаяДата();
	ИначеЕсли СокрЛП(стрОтчет.ЗначениеКонечнойДаты)="Конец пред.месяца" Тогда
		ДатаКон=ТекущаяДата();
        ДатаКон=ДобавитьМесяц(ДатаКон,-1);
		ДатаКон=КонецМесяца(ДатаКон);
	Иначе //не заполнен параметр	 
		ДатаКон=ТекущаяДата();
	КонецЕсли; 
	
	Если СокрЛП(стрОтчет.ТипСмещенияНачальнойДаты)="Месяц" Тогда
		ДатаНач=ДобавитьМесяц(ДатаКон,-1*стрОтчет.СмещениеНачальнойДаты);
		
	ИначеЕсли СокрЛП(стрОтчет.ТипСмещенияНачальнойДаты)="С начала месяца" Тогда
		ДатаНач=ДобавитьМесяц(ДатаКон,-1*стрОтчет.СмещениеНачальнойДаты);
		ДатаНач=НачалоМесяца(ДатаНач);

	ИначеЕсли СокрЛП(стрОтчет.ТипСмещенияНачальнойДаты)="День" Тогда
		ДатаНач=НачалоДня(ДатаКон - стрОтчет.СмещениеНачальнойДаты*24*60*60);
		
	Иначе // НЕ задан тип смещения берем 2 месяца назад
		ДатаНач=ДобавитьМесяц(ДатаКон,-2);
	КонецЕсли; 
	
	ДатаНач = НачалоДня(ДатаНач);
	ДатаКон = КонецДня(ДатаКон);
	
КонецПроцедуры

// Прочитать таблицу с отчетами
// Если таблицы НЕ существует то создаем новую и грузим текущее содержимое Табличной части Отчеты
Функция ПрочитатьОтчеты(Агент)
	ТЗ = ПрочитатьИзРегистраСохраненныеНастройки(Агент,"Отчеты"); //это Табл значений
	Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
		ТЗ = Новый ТаблицаЗначений;
	КонецЕсли;
	Если ТЗ.Колонки.Найти("КодОтчета")= Неопределено Тогда
		ТЗ.Колонки.Добавить("КодОтчета", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная)));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("ТипОтчета")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ТипОтчета", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная)));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("ИмяОтчета")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ИмяОтчета", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	КонецЕсли; 	 
    Если ТЗ.Колонки.Найти("НазваниеОтчета")= Неопределено Тогда
		 ТЗ.Колонки.Добавить("НазваниеОтчета", 
		 	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("ТипСмещенияНачальнойДаты")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ТипСмещенияНачальнойДаты", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("ЗначениеКонечнойДаты")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ЗначениеКонечнойДаты", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("Загружать")= Неопределено Тогда
		ТЗ.Колонки.Добавить("Загружать", 
			Новый ОписаниеТипов("Булево"));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("ПараметрыИзКПК")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ПараметрыИзКПК", 
			Новый ОписаниеТипов("Булево"));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("ЗапрашиватьПериод")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ЗапрашиватьПериод", 
			Новый ОписаниеТипов("Булево"));
	КонецЕсли; 	 
	Если ТЗ.Колонки.Найти("СмещениеНачальнойДаты")= Неопределено Тогда
		ТЗ.Колонки.Добавить("СмещениеНачальнойДаты",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный))); 
	КонецЕсли;
	Если ТЗ.Колонки.Найти("ОтборПоКонтрагенту")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ОтборПоКонтрагенту", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	КонецЕсли;  
	Если ТЗ.Колонки.Найти("ОтборПоДоговору")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ОтборПоДоговору", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	КонецЕсли;      
	Если ТЗ.Колонки.Найти("ОтборПоНоменклатуре")= Неопределено Тогда
		ТЗ.Колонки.Добавить("ОтборПоНоменклатуре", 
			Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	КонецЕсли;      
	Если ТЗ.Колонки.Найти("ОтборПоОтветственному")= Неопределено Тогда
		 ТЗ.Колонки.Добавить("ОтборПоОтветственному", 
		 	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	КонецЕсли;      
	Если ТипЗнЧ(ТЗ) = Тип(Новый ТаблицаЗначений) Тогда
		Для каждого стрТЗ Из ТЗ Цикл
			Если НЕ ЗначениеЗаполнено(стрТЗ.ТипСмещенияНачальнойДаты) Тогда
				стрТЗ.ПараметрыИзКПК=Истина;
				стрТЗ.ЗапрашиватьПериод=Истина;
				стрТЗ.СмещениеНачальнойДаты=2;
				стрТЗ.ТипСмещенияНачальнойДаты="Месяц";
				стрТЗ.ЗначениеКонечнойДаты="Сегодня";
			КонецЕсли; 
		КонецЦикла; 
		возврат ТЗ
	Иначе  //Отчетов нет 
	КонецЕсли; 
	возврат ТЗ;
КонецФункции //

// Новые версии Моби-С будут присылать отчёты об ошибках с описанием ошибки и дампом стека
// НачСтр - строка Запроса, с которой начинается отчёт
// Адрес - идентификатор сессии обмена
// Агент - для кого выгружаем
Функция ЗагрузитьОтчетОбОшибках(Адрес,Запрос)
	ДобавитьВЛогФайл("Загружается отчёт об ошибках",ПараметрыАгента.Агент,1);
	
	Буфер=Запрос;
	Для Н=1 По 4 Цикл
		Поз=Найти(Буфер,Символы.ПС);
		Если Поз=0 Тогда Прервать; КонецЕсли;
		
		Буфер=Сред(Буфер,Поз+1);
	КонецЦикла;
	
	Текст=Новый ЗаписьТекста;
	Текст.Открыть(ПолучитьКаталог("Logs") 
		+ "\ErrorLog_"+СокрЛП(УдалитьЗапрещенныеСимволыИмени(ПараметрыАгента.Агент.Код))+".txt",,,Истина);
	Текст.Записать(Буфер);
	Текст.Закрыть();	
		
	КолвоЗаписей = СтрЧислоСтрок(Запрос);
	Дата = Неопределено;
	Если КолвоЗаписей >= 5 Тогда
		Блокировщик = Неопределено;
		БД = ОткрытьВнешнююБД(Блокировщик, Истина);
		
		БДЗапросБезРезультата(БД, "PRAGMA journal_mode=MEMORY");
		БДЗапросБезРезультата(БД, "PRAGMA synchronous=OFF");		
		
		Если БД = Ложь Тогда
			Сообщить("Не удалось получить доступ к файлу внешней базы данных mobi_s.sqlite3!", СтатусСообщения.Важное);
			Возврат Ложь;
		КонецЕсли;			
		Попытка
			ТекстЗапроса="
				|CREATE TABLE IF NOT EXISTS Log (
				|    [Agent] TEXT PRIMARY KEY,
				|    [DateTime] DateTime PRIMARY KEY,
				|    [Sequence] Intege4 PRIMARY KEY,
				|    [Level] Integer4,
				|    [Message] Text,
				|    Primary Key([Agent],[DateTime],[Sequence]))
				|";

			БДЗапросБезРезультата(БД, ТекстЗапроса);
		Исключение
			ОписаниеОшибки=ОписаниеОшибки();
			ДобавитьВЛогФайл(ОписаниеОшибки,ПараметрыАгента.Агент);
		КонецПопытки;
		
		ПодгЗапрос=БДПодготовитьЗапрос(БД, "INSERT OR IGNORE INTO Log([Agent],[DateTime],[Sequence],[Level],[Message]) VALUES(?,?,?,?,?)");
		
		БДУстановитьПараметр(ПодгЗапрос, 1, Строка(ПараметрыАгента.Агент.ФизЛицо.Код));
		
		ОшибкаОтправки = "";
		
		Для Н=5 По КолвоЗаписей Цикл
			Запись = СтрЗаменить(СтрПолучитьСтроку(Запрос, Н), Таб, РазделительСтрок);
			Если СтрЧислоСтрок(Запись) = 4 Тогда
				Попытка //При повторной загрузке вылетит Primary Key
					Попытка
						ДатаВремя = ДатаИзСтрокиСКПК(СтрПолучитьСтроку(Запись,1));
					Исключение
						ДатаВремя = ТекущаяДатаСуточнаяКоррекция();
					КонецПопытки;
					Индекс=СтрокуВЧисло(СтрПолучитьСтроку(Запись,2));
					Уровень=СтрокуВЧисло(СтрПолучитьСтроку(Запись,3));
					Сообщение=СтрПолучитьСтроку(Запись,4);
					Сообщение=СтрЗаменить(Сообщение,Символ(14),Таб);
					Сообщение=СтрЗаменить(Сообщение,Символ(15),РазделительСтрок);
					
					БДУстановитьПараметр(ПодгЗапрос, 2, ДатаДляSQLite(ДатаВремя));
					БДУстановитьПараметр(ПодгЗапрос, 3, Индекс);
					БДУстановитьПараметр(ПодгЗапрос, 4, Уровень);
					БДУстановитьПараметр(ПодгЗапрос, 5, Сообщение);
					БДСледующаяЗапись(ПодгЗапрос);
					БДСбросПодготовленногоЗапроса(ПодгЗапрос);
				Исключение
					ОшибкаОтправки = ОшибкаОтправки + "Ошибка при записи лога агента "+РазделительСтрок
									  + ОписаниеОшибки() + РазделительСтрок
									  + "Агент = " + ПараметрыАгента.Агент + РазделительСтрок
									  + "ДатаВремя = " + ДатаВремяВСтрокуДляКПК(ДатаВремя) + РазделительСтрок
									  + "Индекс = " + Индекс + РазделительСтрок
									  + "Уровень = " + Уровень + РазделительСтрок
									  + "Сообщение = " + Сообщение + РазделительСтрок;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если ОшибкаОтправки = "" Тогда
		Иначе
			ДобавитьВЛогФайл(ОшибкаОтправки, ПараметрыАгента.Агент);
			//Если ТехПоддержкаАвтоматическаяОтправка Тогда 
			//	ОтправитьОшибкуВТехподдержку(ПараметрыАгента.Агент, "Запись лога агента" + РазделительСтрок + ОшибкаОтправки); 
			//КонецЕсли;
		КонецЕсли;		
		
		БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);
		
		БДЗапросБезРезультата(БД, "PRAGMA journal_mode=DELETE");
		БДЗапросБезРезультата(БД, "PRAGMA synchronous=FULL");
		
		ЗакрытьВнешнююБД(БД, Блокировщик);
	КонецЕсли;	
		
	СерверПослатьОтвет(Адрес,"OK"+РазделительСтрок,1);
	
	Возврат Истина;
КонецФункции

// Находит событие для заданного документа, устанавливает у события статус завершения
// 		и связывает событие с документом
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		Платформа - Строка, идентификатор платформы КПК
// 		ВидСобытия - Строка, указывает вид задания (Заказ, Продажа, ПКО и др.)
// 		Дата - Дата, дата документа
// 		Контрагент - ссылка на элем. спр. Контрагенты, контрагент, по которому завершать событие
// 		Документ - ДокументСсылка, документ, который был загружен
// 		УникДок - Строка, уникальный код документа, сформированный
// 			функцией СформироватьУникальныйКодДокумента
// 		ВремяОформления - Число, время, затраченное агентом на оформление документа на КПК
// Возвращаемое значение:
// 		Истина, всегда
Функция ЗавершитьСобытие(Адрес, Платформа, ВидСобытия, Дата, Контрагент, Документ, УникДок, ВремяОформления, КодЗадания)
	Если ЗаданияВозможны Тогда
		стрGUID = ВернутьПробелыGUID(КодЗадания); //вернем на место символы "-" (минус)
		Попытка
			GUID = Новый УникальныйИдентификатор(стрGUID); //получили уникальный код объекта
		Исключение
			Возврат Истина;
		КонецПопытки;		
		Событие = Документы.Событие.ПолучитьСсылку(GUID);
		Если Не ЗначениеЗаполнено(Событие) Тогда 
			Возврат Истина; 
		КонецЕсли;
		Событие = Событие.ПолучитьОбъект();
		
		Если Событие = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		Если Событие.Контрагент <> Контрагент Тогда
			Возврат Истина;
		КонецЕсли;
		
		Событие.СостояниеСобытия = Перечисления.СостоянияСобытий.Завершено;
		Событие.Записать();
		
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект = Документ;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Задание");
		Запись.Значение = Событие.Номер;
		Запись.Записать();
		
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект    = Событие.Ссылка;
		Запись.Свойство  = ПВХУникКодДокумента;
		Запись.Значение  = УникДок;
		Запись.Записать(Истина);
		
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект    = Событие.Ссылка;
		Запись.Свойство  = ПВХУВремяСозданияДокумента;
		Запись.Значение  = ВремяОформления;
		Запись.Записать(Истина);
		
		МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект    = событие.ссылка;
		МенеджерЗаписи.Свойство  = ПВХУДатаСозданияДокумента;
		МенеджерЗаписи.Значение  = Событие.Дата;
		МенеджерЗаписи.Записать(Истина);
		
		ДобавитьВЛогФайл("Завершено событие " + Событие.Номер, ПараметрыАгента.Агент, 0);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Выполняет загрузку отчёта о выполнении произвольного задания с КПК
// Параметры:
// Адрес - Строка, адрес КПК
// Запрос - Строка, запрос с КПК, в соответствии с протоколом обмена
// Возвращаемое значение:
// 		Истина, всегда
Функция ЗагрузитьОтчетОВыполнении(Адрес,Запрос)
	ДобавитьВЛогФайл("Загружаются отчёты о выполнении",ПараметрыАгента.Агент,1);
	
	СерверПослатьОтвет(Адрес,"OK"+РазделительСтрок,0);
	
	Для НомерСтрокиЗапроса=5 По СтрЧислоСтрок(Запрос) Цикл
		Попытка
			НачатьТранзакцию();
				
			СтрокаДок=СтрПолучитьСтроку(Запрос,НомерСтрокиЗапроса);
			
			Параметры=СтрЗаменить(СтрокаДок,Таб,РазделительСтрок);
			ДатаДок=ДатаИзСтрокиСКПК(СтрПолучитьСтроку(Параметры,1));
			ВремяДок = Сред(СтрПолучитьСтроку(Параметры,1),12); 
			ИдДок=СтрПолучитьСтроку(Параметры,2);
			ИдСобытия=СтрПолучитьСтроку(Параметры,4);
			Статус=СтрПолучитьСтроку(Параметры,5);
			Отчет=СтрПолучитьСтроку(Параметры,6);
			Фото=СтрЗаменить(СтрПолучитьСтроку(Параметры,7),Символ(31),РазделительСтрок);
			ДатаСоздания=ДатаИзСтрокиСКПК(СтрПолучитьСтроку(Параметры,8));
			ВремяРаботы=Число(СтрПолучитьСтроку(Параметры,9));
			
			ИдСобытия=ВернутьПробелыGUID(ИдСобытия);
			Событие=Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдСобытия));
			Если Событие.Пустая() Тогда
				ДобавитьВЛогФайл("Событие с Ид "+ИдСобытия+" НЕ найдено",ПараметрыАгента.Агент,1);
				
				Ответ=Строка(ИдДок)+таб+таб+РазделительСтрок;
				СерверПослатьОтвет(Адрес,Ответ,0);
				
				Продолжить;
			КонецЕсли;
			
			Событие=Событие.ПолучитьОбъект();
			Если Событие = Неопределено Тогда
				ДобавитьВЛогФайл("Событие с Ид "+ИдСобытия+" не найдено",ПараметрыАгента.Агент,1);
				
				Ответ=Строка(ИдДок)+таб+таб+РазделительСтрок;
				СерверПослатьОтвет(Адрес,Ответ,0);
				
				Продолжить;
			КонецЕсли;
			Событие.СостояниеСобытия=?(Статус="1",
				Перечисления.СостоянияСобытий.Завершено,
				Перечисления.СостоянияСобытий.Отменено);
			Событие.Комментарий=Отчет;
			Если НЕ ПустаяСтрока(Фото) Тогда
				Событие.Комментарий=Событие.Комментарий+" Фото:"+Фото;
			КонецЕсли;
			Событие.Записать();
			
			СтрШапки=Новый Структура("ИдДок,Дата,Время",ИдДок,ДатаДок,ВремяДок);
			УникДок = СформироватьУникальныйКодДокумента("Событие",СтрШапки);
			ЗаписатьУникКодДокумента(Событие,УникДок);
			
			МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Событие.Ссылка;
			МенеджерЗаписи.Свойство = ПВХУДатаСозданияДокумента;
			МенеджерЗаписи.Значение = Строка(ДатаСоздания);
			МенеджерЗаписи.Записать(Истина);
			
			МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Событие.Ссылка;
			МенеджерЗаписи.Свойство = ПВХУВремяСозданияДокумента;
			МенеджерЗаписи.Значение = Строка(ВремяРаботы);
			МенеджерЗаписи.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			Ответ=Строка(ИдДок)+Таб+Таб+РазделительСтрок;
			СерверПослатьОтвет(Адрес, Ответ, 0);
			
			ДобавитьВЛогФайл("Завершено событие "+Событие.Номер,ПараметрыАгента.Агент,0);				
			
			ЗаписатьФотоДокумента(Событие.Ссылка, Фото, 35);
		Исключение
			ОтменитьТранзакцию();
			Ответ = Строка(ИдДок) + Таб + Таб + УбратьСпецСимволы(ОписаниеОшибки()) + РазделительСтрок;
			СерверПослатьОтвет(Адрес,Ответ,0);
			ДобавитьВЛогФайл("Ошибка выгрузки события " + ИдДок + " - " + ОписаниеОшибки(), ПараметрыАгента.Агент, 0);				
			
		КонецПопытки;
	КонецЦикла;
	
	СерверПослатьОтвет(Адрес,РазделительСтрок,1);
	Возврат Истина;
КонецФункции

// Формирует отчёт об изменении документа алгоритмом коррекции путём
// сравнения того, что было с тем, что стало
// Параметры:
// 		Табл - ТабличныйДокумент, таблица отчёта об изменениях
// 		Макет - Макет, по которому формируется отчёт
// 		Док - ДокументОбъект, претерпевший изменения алгоритмом коррекции
// 		СтрШапки - ТаблицаЗначений, содержит все реквизиты шапок корректируемых документов
// 			в соответствии с протоколом обмена
//		ТаблТовары - ТаблицаЗначений, содержит все реквизиты строк корректируемых документов
// 			в соответствии с протоколом обмена
Процедура ОтчетОбИзмененииДокумента(Табл, Макет, Док, СтрШапки, ТаблТовары, глПоследняяОшибкаПроведения)
	
	Если Не ПустаяСтрока(глПоследняяОшибкаПроведения) Тогда
		Секция = Макет.ПолучитьОбласть("НетИзменений");
		Секция.Параметры.Реквизит = глПоследняяОшибкаПроведения;
		Табл.Вывести(Секция);
		Секция.Параметры.Реквизит = "Нажмите ОТКЛОНИТЬ ИЗМЕНЕНИЯ!";
		Табл.Вывести(Секция);
		Возврат;
	КонецЕсли;
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Организация","Организация","Организация"));
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Контрагент","Контрагент","Контрагент"));
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Договор","ДоговорКонтрагента","Договор"));
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Тип цены","ТипЦен","ТипЦены"));
	
	ВывелиШапкуШапки = Ложь;
	Для Каждого Рекв Из Реквизиты Цикл
		ЗначРеквТабл = СтрШапки[Рекв.РеквизитТабл];
		ЗначРеквДок = Док[Рекв.РеквизитДок];
		
		Если ЗначРеквТабл = ЗначРеквДок Тогда Продолжить; КонецЕсли;
		
		Если НЕ ВывелиШапкуШапки Тогда
			Секция = Макет.ПолучитьОбласть("РеквизитыШапки");
			Табл.Вывести(Секция);
			ВывелиШапкуШапки = Истина;
		КонецЕсли;
		Секция = Макет.ПолучитьОбласть("Изменение");
		Секция.Параметры.Реквизит = Рекв.Наименование;
		Секция.Параметры.СтароеЗначение = ЗначРеквТабл;
		Секция.Параметры.НовоеЗначение = ЗначРеквДок;
		Табл.Вывести(Секция);
	КонецЦикла;
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Количество","Количество","Колво"));
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Бонус","Бонус","Бонус"));
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Цена","Цена","Цена"));
	Реквизиты.Добавить(Новый Структура("Наименование,РеквизитДок,РеквизитТабл", "Сумма","Сумма","Сумма"));
	
	Док.Товары.Свернуть("Номенклатура, ЕдиницаИзмерения, Коэффициент", "Количество, Сумма, СуммаНДС");
	Если Док.УчитыватьНДС И Не Док.СуммаВключаетНДС Тогда
		Для Каждого СтрДок Из Док.Товары Цикл
			СтрДок.Сумма = Окр((СтрДок.Сумма + СтрДок.СуммаНДС) / СтрДок.Количество, 2) * СтрДок.Количество;
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыАгента.ВалютаКПК <> Док.ВалютаДокумента Тогда
		СтруктураВалютаКПК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Док.Дата, Новый Структура("Валюта", ПараметрыАгента.ВалютаКПК));
		Для Каждого СтрДок Из Док.Товары Цикл
			СтрДок.Сумма = ПересчитатьИзВалютыВВалюту(СтрДок.Сумма,
				Док.ВалютаДокумента, ПараметрыАгента.ВалютаКПК,
				Док.КурсВзаиморасчетов, СтруктураВалютаКПК.Курс,
				Док.КратностьВзаиморасчетов, СтруктураВалютаКПК.Кратность);
		КонецЦикла;
		Для Каждого СтрДок Из Док.Услуги Цикл
			СтрДок.Сумма = ПересчитатьИзВалютыВВалюту(СтрДок.Сумма,
				Док.ВалютаДокумента, ПараметрыАгента.ВалютаКПК,
				Док.КурсВзаиморасчетов, СтруктураВалютаКПК.Курс,
				Док.КратностьВзаиморасчетов, СтруктураВалютаКПК.Кратность);
		КонецЦикла;
	КонецЕсли;
	
	ТаблДок = Док.Товары.Выгрузить();
	
	Для Каждого СтрДок Из Док.Услуги Цикл
		НовСтр = ТаблДок.Добавить();
		НовСтр.Номенклатура=СтрДок.Номенклатура;
		НовСтр.Количество=СтрДок.Количество;
		НовСтр.Цена=СтрДок.Цена;
		НовСтр.Сумма=СтрДок.Сумма;
		НовСтр.ЕдиницаИзмерения=СтрДок.Номенклатура.БазоваяЕдиницаИзмерения;
		НовСтр.Коэффициент=НовСтр.ЕдиницаИзмерения.Коэффициент;
	КонецЦикла;
		
	ЦенаВключаетНДС = Док.ТипЦен.ЦенаВключаетНДС;
	
	Для Каждого СтрДок Из ТаблДок Цикл
		ТекТовар = "";
		СтрокиТабл = ТаблТовары.НайтиСтроки(Новый Структура("Номенклатура", СтрДок.Номенклатура));
		Если СтрокиТабл.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрТабл = СтрокиТабл[0];
		
		Для Каждого Рекв Из Реквизиты Цикл
			Если Рекв.Наименование = "Бонус" Тогда
				ЗначРеквТабл = СтрТабл[Рекв.РеквизитТабл];
				ЗначРеквДок = 0;
			ИначеЕсли Рекв.Наименование = "Цена" Тогда
				ЗначРеквТабл = СтрТабл[Рекв.РеквизитТабл];
				ЗначРеквДок = Окр(СтрДок.Сумма / СтрДок.Количество, 2);
			ИначеЕсли Рекв.Наименование = "Сумма" Тогда
				ЗначРеквТабл = Окр(СтрТабл[Рекв.РеквизитТабл], 2);
				ЗначРеквДок = СтрДок.Сумма;
			Иначе
				ЗначРеквТабл = СтрТабл[Рекв.РеквизитТабл];
				ЗначРеквДок = СтрДок[Рекв.РеквизитДок];
			КонецЕсли;
			Если ЗначРеквТабл <> ЗначРеквДок Тогда
				Если ТекТовар <> СтрДок.Номенклатура Тогда
					Секция = Макет.ПолучитьОбласть("РеквизитыСтроки");
					Секция.Параметры.ИдСтроки = СтрДок.Номенклатура;
					Табл.Вывести(Секция);
					ТекТовар = СтрДок.Номенклатура;
				КонецЕсли;
				Секция = Макет.ПолучитьОбласть("Изменение");
				Секция.Параметры.Реквизит = Рекв.Наименование;
				Секция.Параметры.СтароеЗначение = ЗначРеквТабл;
				Секция.Параметры.НовоеЗначение = ЗначРеквДок;
				Табл.Вывести(Секция);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Табл.ВысотаТаблицы = 0 Тогда
		Секция = Макет.ПолучитьОбласть("НетИзменений");
		Секция.Параметры.Реквизит = "Никаких изменений НЕ предлагается";
		Табл.Вывести(Секция);
	КонецЕсли;
КонецПроцедуры

// Выполняет расчёт маршрута между двумя клиентами и отправку ответа КПК
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		ТелоЗапроса - Строка, запрос с КПК
// Возвращаемое значение:
// 		Истина, всегда
Функция СформироватьМаршрут(Адрес, ТелоЗапроса)
	КонтрагентОткуда=Справочники.Контрагенты.ПустаяСсылка();
	КонтрагентКуда=Справочники.Контрагенты.ПустаяСсылка();
	мАдресДоставки= "";
	НачШирота=0; НачДолгота=0;
	
	Точки=СтрЗаменить(СтрПолучитьСтроку(ТелоЗапроса,5),Таб,РазделительСтрок);
	НачШирота=Число(СтрПолучитьСтроку(Точки,1));
	НачДолгота=Число(СтрПолучитьСтроку(Точки,2));
	
	Точки=СтрЗаменить(СтрПолучитьСтроку(ТелоЗапроса,6),Таб,РазделительСтрок);
	
	ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
	Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
		ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
		Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
			Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
				ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	
	ПолучитьКонтрагентаИАдресПоКоду(СтрПолучитьСтроку(Точки,1),КонтрагентОткуда,мАдресДоставки, ПапкаРодителя);
	ПолучитьКонтрагентаИАдресПоКоду(СтрПолучитьСтроку(Точки,2),КонтрагентКуда,мАдресДоставки, ПапкаРодителя);
	
	Форма=ПолучитьФорму("ПрокладкаМаршрутов",ЭтаФорма);
	
	Широты=""; Долготы=""; ДлинаПути=0; ВремяПути=0;
	КонШирота=0;КонДолгота=0;
	Статус=Форма.ПроложитьПуть(
		ПараметрыАгента.Агент, 
		КонтрагентОткуда, 
		КонтрагентКуда,
		НачШирота,
		НачДолгота,
		КонШирота,
		КонДолгота, 
		Широты, 
		Долготы,
		ДлинаПути,
		ВремяПути);
	Если Статус<>"" Тогда
		Ответ=Статус+РазделительСтрок;
		СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,1);
		
		Возврат Истина;
	КонецЕсли;
	
	Ответ = "OK"+РазделительСтрок 
		+ КоординатаВСтроку(НачШирота) + Таб 
		+ КоординатаВСтроку(НачДолгота) + Таб 
		+ КоординатаВСтроку(КонШирота) + Таб
		+ КоординатаВСтроку(КонДолгота) + РазделительСтрок;
	КолТочек=Широты.Количество();
	Для Н=0 По КолТочек-1 Цикл
		Ответ=Ответ
			+КоординатаВСтроку(Широты[Н])+Таб
			+КоординатаВСтроку(Долготы[Н])+РазделительСтрок;
	КонецЦикла;
	
	СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,1);
	
	Возврат Истина;
КонецФункции

//Отправляет на мобильное устройство параметры связи с учётной системой
Функция ВыгрузитьНастройкиУстройства(Адрес, ТелоЗапроса)
	Ответ="OK"+РазделительСтрок;
	
	КодыУстройства=Новый Массив;
	Для Н=5 По СтрЧислоСтрок(ТелоЗапроса) Цикл
		Стр=СтрПолучитьСтроку(ТелоЗапроса,Н);
		
		Если Лев(Стр,15)="КодыУстройства"+Таб Тогда
			СтрКоды=СтрЗаменить(Сред(Стр,16),Таб,РазделительСтрок);
			Для НомерКода=1 По СтрЧислоСтрок(СтрКоды) Цикл
				КодыУстройства.Добавить(СтрПолучитьСтроку(СтрКоды,НомерКода));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Ответ=Ответ
		+"Название"+Таб
		+ИмяКомпьютера()+": "+ПолучитьЗаголовокСистемы()+" - "+ИмяПользователя()+РазделительСтрок
		+"Версия"+Таб
		+ВерсияПротокола+РазделительСтрок
		+"КодАгента"+Таб
		+СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код)+РазделительСтрок
		+"ИмяАгента"+Таб
		+УбратьСпецСимволы(Строка(ПараметрыАгента.Агент))+РазделительСтрок;
	НайденныйКод="";
	ВозможенДемоРежим=Истина;
	Если СтрЧислоСтрок(КодыУстройства)>0 Тогда
		ТаблКлючей=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"СписокКПК");
		Для Каждого СтрКлюч Из ТаблКлючей Цикл
			Если НЕ ПустаяСтрока(НайденныйКод) Тогда Прервать; КонецЕсли;
			
			ВозможенДемоРежим=Ложь;
			Для Каждого КодУстройства Из КодыУстройства Цикл
				Если СокрЛП(СтрКлюч.КодКПК)<>СокрЛП(КодУстройства) Тогда Продолжить; КонецЕсли;
				
				НайденныйКод=КодУстройства;
				ДобавитьВЛогФайл(
					"Для активации устройства будет использован следующий ключ активации с привязкой к устройству с кодом: " 
					+ СтрКлюч.КодКПК,ПараметрыАгента.Агент,0);
				Прервать;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если НайденныйКод="" Тогда
		ФормаКлючи=ПолучитьФорму("Ключи");
		ТаблКлючей=Новый ТаблицаЗначений;
		ТаблКлючей.Колонки.Добавить("КодАктивации");
		ТаблКлючей.Колонки.Добавить("Агент");
		ТаблКлючей.Колонки.Добавить("Ключ");
		ТаблКлючей.Колонки.Добавить("Активация");
		ТаблКлючей.Колонки.Добавить("Версия");
		ТаблКлючей.Колонки.Добавить("Комментарий");
		ТаблКлючей.Колонки.Добавить("КодАгента");
		ТаблКлючей.Колонки.Добавить("КодВерсии");
		ФормаКлючи.ЗаполнитьТаблицуКлючейИзФайла(ТаблКлючей);
		ИсхТаблКлючей=ТаблКлючей.Скопировать();
		ЕстьСвободныйИнтернетКлюч=Ложь;
		Для Каждого Стр Из ТаблКлючей Цикл
			ВозможенДемоРежим=Ложь;
			Если ПустаяСтрока(Стр.КодАгента) Тогда
				ЕстьСвободныйИнтернетКлюч=Истина;
			КонецЕсли;
			Если СокрЛП(Стр.КодАгента)=СокрЛП(ПараметрыАгента.Агент.ФизЛицо.Код) Тогда
				НайденныйКод="АктивацияЧерезИнтернет";
				ДобавитьВЛогФайл(
					"Для активации устройства будет использован следующий ключ активации через Интернет: "+Стр.КодАктивации,
					ПараметрыАгента.Агент,0);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ПустаяСтрока(НайденныйКод) И ЕстьСвободныйИнтернетКлюч Тогда
			Для Каждого Стр Из ТаблКлючей Цикл
				Если НЕ ПустаяСтрока(Стр.КодАгента) Тогда Продолжить; КонецЕсли;
				
				Стр.Агент=ПараметрыАгента.Агент;
				Стр.КодАгента=ПараметрыАгента.Агент.ФизЛицо.Код;
				Если ФормаКлючи.СохранитьOnLineКлючи(ИсхТаблКлючей,ТаблКлючей) Тогда
					ДобавитьВЛогФайл(
						"Для активации устройства будет использован следующий ключ активации через Интернет: "+Стр.КодАктивации,
						ПараметрыАгента.Агент,0);
					НайденныйКод="АктивацияЧерезИнтернет";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ВозможенДемоРежим Тогда
		ДобавитьВЛогФайл("Мобильное устройство будет работать в Демо-режиме",ПараметрыАгента.Агент,0);
		Ответ=Ответ
			+"КодУстройства"+Таб
			+"Демо"+РазделительСтрок;
	ИначеЕсли НЕ ПустаяСтрока(НайденныйКод) Тогда
		Ответ=Ответ
			+"КодУстройства"+Таб
			+НайденныйКод+РазделительСтрок;
	Иначе
		ДобавитьВЛогФайл("Не удалось найти свободный ключ активации для устройства",ПараметрыАгента.Агент,0);
	КонецЕсли;
	
	ИспользоватьСерверМобиС=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"ИспользоватьСерверМобиС");
	Если ЗначениеЗаполнено(НастройкиУстройстваЛокальныйАдрес) Тогда
		Ответ=Ответ
			+"Сервер"+Таб
			+"Внутри офиса"+Таб
			+НастройкиУстройстваЛокальныйАдрес+Таб
			+ЧислоВСтроку(Порт)+РазделительСтрок;
	КонецЕсли;
	Если ЗначениеЗаполнено(НастройкиУстройстваВнешнийАдрес) Тогда
		Ответ=Ответ
			+"Сервер"+Таб
			+"Внешний"+Таб
			+НастройкиУстройстваВнешнийАдрес+Таб
			+ЧислоВСтроку(Порт)+РазделительСтрок;
	КонецЕсли;
	Если ИспользоватьСерверМобиС=Истина Тогда
		КодУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"КодУчетнойСистемы");
		ПарольУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"ПарольУчетнойСистемы");
		Ответ=Ответ
			+"ОблачныйСервер"+Таб
			+КодУчетнойСистемы+Таб
			+ПарольУчетнойСистемы+РазделительСтрок;
	КонецЕсли;
	
	СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,1);
	
	Возврат Истина;
КонецФункции

//устанавливает признак необходимости обновить ключи на других обработках
Процедура УстановитьПризнакНеобходимостиОбновленияКлючейДляСервера() Экспорт
	актОбработки = ПолучитьАктивныеОбработкиСуществующихСеансов();	
	Для каждого обработка из актОбработки Цикл
		Если обработка.ГУИД = ГУИДЭкземпляра Тогда
		//на себя обновления не регистрируем	
		Иначе
			Попытка
				стрОбновитьКлючи = РегистрыСведений.СохраненныеНастройки.СоздатьМенеджерЗаписи();		
				стрОбновитьКлючи.Пользователь = МобиС;
				стрОбновитьКлючи.ИмяОбъекта = обработка.ГУИД;
				стрОбновитьКлючи.НаименованиеНастройки = "ОбновитьКлючи";
				стрОбновитьКлючи.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Определяет вид запроса и вызывает соответствующий обработчик
// Адрес - идентификатор сессии обмена
// ПараметрыАгента - Структура, со всеми параметрами агента 
// ИмяЗапроса - Строка, имя полученного запроса
// ТелоСообщения - Строка, текст полученного запроса
Процедура ОбработкаЗапроса(Адрес, ИмяЗапроса, ТелоЗапроса, Платформа)
	
	Статус = Ложь;
	
	//Отчёт*******************************************************************************
	Если ИмяЗапроса = "Report" Тогда
		СерверПослатьОтвет(Адрес,"OK"+РазделительСтрок,0);
		
		тзОтчеты = ПрочитатьОтчеты(ПараметрыАгента.Агент); //прочитаем все отчеты 
		
		КодОтчета=СокрП(СтрПолучитьСтроку(ТелоЗапроса,5));
		СтрПарам=СокрП(СтрПолучитьСтроку(ТелоЗапроса,6));
		//параметры передаются с 6 строки в виде КодКонтрагента +Таб+ КодДоговора
		КолСтр = СтрЧислоСтрок(ТелоЗапроса);
		КодКонтрагента = "";
		КодДоговора = "";
		Для Н = 6 По КолСтр Цикл
			ТекСтр=СтрПолучитьСтроку(ТелоЗапроса,Н);
			СтрПарам=СтрЗаменить(ТекСтр,Таб,РазделительСтрок);
			//получить Контрагента, АдресДоставки, Договор и Номенклатуру
			//контрагент
			КодКонтрагента = СокрЛП(СтрПолучитьСтроку(СтрПарам,1));   
			Контрагент  = Справочники.Контрагенты.ПустаяСсылка();
			АдресДоставки="";
			
			ПапкаРодителя = Справочники.Контрагенты.ПустаяСсылка();
			Если ПараметрыАгента.ОтборПапокКлиентов.Количество() > 0 Тогда
				ЗнПапкаРодителя = ПараметрыАгента.ОтборПапокКлиентов.Получить(0);
				Если ТипЗнч(ЗнПапкаРодителя.Значение) = Тип("СписокЗначений") Тогда
					Если ЗнПапкаРодителя.Значение.Количество() > 0 Тогда
						ПапкаРодителя = ЗнПапкаРодителя.Значение[0].Значение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			
			ПолучитьКонтрагентаИАдресПоКоду(КодКонтрагента,Контрагент,АдресДоставки, ПапкаРодителя);
			//Договор
			КодДоговора = СокрЛП(СтрПолучитьСтроку(СтрПарам,2));    
			Договор = ?(ПустаяСтрока(КодДоговора), 
					Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), 
					Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВернутьПробелыGUID(КодДоговора))));
			// номенклатура
			//КодНоменклатуры = СокрЛП(СтрПолучитьСтроку(СтрПарам,3));
			КодыНоменклатуры = СтрПолучитьСтроку(СтрПарам,3);
			Номенклатура = Новый Массив;
			СтрокиКодовНоменклатуры=СтрЗаменить(КодыНоменклатуры,Символ(30),РазделительСтрок);
			Если ПустаяСтрока(СтрокиКодовНоменклатуры) Тогда
			Иначе
				КолвоКодов=СтрЧислоСтрок(СтрокиКодовНоменклатуры);
				Для НомерКода=1 По КолвоКодов Цикл
					спрНом = ПолучитьСсылкуПоGUID(СтрПолучитьСтроку(СтрокиКодовНоменклатуры,НомерКода), "Номенклатура");
					Номенклатура.Добавить(спрНом);
				КонецЦикла;
			КонецЕсли;
				
			стрОтчет = тзОтчеты.Найти(КодОтчета,"КодОтчета");
			Если стрОтчет <> Неопределено Тогда //Нашел отчет
				//доработка - задание периода отчета на КПК
				НачальнаяДата = ТекущаяДата();
				КонечнаяДата = НачальнаяДата;
				Если стрОтчет.ЗапрашиватьПериод 
					И СокрЛП(СтрПолучитьСтроку(СтрПарам,4))<>"" 
					И СокрЛП(СтрПолучитьСтроку(СтрПарам,5))<>"" Тогда
					НачальнаяДата = НачалоДня(ДатаИзСтрокиСКПК(СтрПолучитьСтроку(СтрПарам,4))); 
					КонечнаяДата =  КонецДня(ДатаИзСтрокиСКПК(СтрПолучитьСтроку(СтрПарам,5))); 
				Иначе
					ПолучитьИнтервалОтчета(стрОтчет,НачальнаяДата,КонечнаяДата);
				КонецЕсли;
				//доработка - задание периода отчета на КПК				
				Если НачальнаяДата <= КонечнаяДата Тогда
					ДобавитьВЛогФайл(
						"Выполняется запрос 'Отчет' " + стрОтчет.НазваниеОтчета + "(" + КодОтчета + ") по контрагенту "
						+ Контрагент + "(" + КодКонтрагента + ")", ПараметрыАгента.Агент, 0);
					ВремФайл = ПолучитьИмяВременногоФайла(".htm");
					Табл = новый ТабличныйДокумент;
					//заполнить таблицу отчета
					СформироватьОтчет(
						Табл, ПараметрыАгента.Агент, стрОтчет, Контрагент, Договор, Номенклатура, НачальнаяДата, КонечнаяДата);
					//сохранить таблицу с данными отчета в файл
					Табл.Записать(ВремФайл,ТипФайлаТабличногоДокумента[ПараметрыАгента.HTML]);
					//отослать на КПК параметры отчета
					СерверПослатьОтвет(Адрес,СокрЛП(КодКонтрагента)+Таб+КодДоговора+Таб+"UTF8"+РазделительСтрок,0);
					//отослать на КПК тело запроса
					Файл=Новый ЧтениеТекста;
					Файл.Открыть(ВремФайл,КодировкаТекста.UTF8);
					Ответ="";
					Счетчик=0;
					Пока Истина Цикл
						Стр=Файл.ПрочитатьСтроку();
						Если Стр=Неопределено Тогда 
							Прервать; 
						КонецЕсли;							
						Ответ=Ответ
							+Стр+РазделительСтрок;							
						Счетчик=Счетчик+1;
						Если Счетчик%100=0 Тогда
							СерверПослатьОтвет(Адрес,Ответ,0);
							Ответ="";
						КонецЕсли;
					КонецЦикла;
					Если Счетчик > 0 Тогда
						СерверПослатьОтвет(Адрес,Ответ,0);
						Ответ="";
					КонецЕсли;
					СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,0);
				Иначе
					СерверПослатьОтвет(Адрес,СокрЛП(КодКонтрагента)+Таб+КодДоговора+Таб+"Windows-1251"+РазделительСтрок,0);					
					Ответ=
					"<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Transitional//EN"" ""http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"">
					|<html xmlns=""http://www.w3.org/1999/xhtml"">
					|<head>
					|  <title>Неизвестный отчёт</title>
					|  <meta http-equiv=""Content-Type"" content=""text/html; charset=Windows-1251"" />
					|</head>
					|<body style=""font-family:Arial;"">
					|  <p style=""text-align: center"">
					|    Запрошен отчёт на некорректный период.
					|  </p>
					|</body>
					|</html>";					
					СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,0);
				КонецЕсли;
			Иначе  //нет такого отчета
				СерверПослатьОтвет(Адрес,СокрЛП(КодКонтрагента)+Таб+КодДоговора+Таб+"Windows-1251"+РазделительСтрок,0);
				
				Ответ=
				"<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Transitional//EN"" ""http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"">
				|<html xmlns=""http://www.w3.org/1999/xhtml"">
				|<head>
				|  <title>Неизвестный отчёт</title>
				|  <meta http-equiv=""Content-Type"" content=""text/html; charset=Windows-1251"" />
				|</head>
				|<body style=""font-family:Arial;"">
				|  <p style=""text-align: center"">
				|    Запрошен неизвестный вид отчёта '" + КодОтчета + "'.<br/>
				|	Обратитесь к ответственному за настройку Моби-С в Вашей организации.<br/>
				|	После произведите Полный обмен!
				|  </p>
				|</body>
				|</html>";
				
				СерверПослатьОтвет(Адрес,Ответ+РазделительСтрок,0);
			КонецЕсли;
			
		КонецЦикла;
		СерверПослатьОтвет(Адрес,РазделительСтрок,1);
		ДобавитьВЛогФайл("Запрос '"+ИмяЗапроса+"' успешно обработан",ПараметрыАгента.Агент,0);
		Сервер.ЗапросОбработан();
		
		//Загрузка файла (обновление программы)******************************************
	ИначеЕсли ИмяЗапроса="FileLoad" Тогда
		Попытка
			ИмяФайла=СтрПолучитьСтроку(ТелоЗапроса,СтрЧислоСтрок(ТелоЗапроса));
			Статус=ВыгрузитьФайл(Адрес,ИмяФайла,Платформа);
		Исключение
			Ошибка=ОписаниеОшибки();
			Сообщить(Ошибка);
			ДобавитьВЛогФайл(
				"Исключительная ситуация при обработке FileLoad " + ИмяФайла + " " + Ошибка + Символы.ПС 
				+ "Принятые с КПК данные" + Символы.ПС 
				+ ТелоЗапроса,ПараметрыАгента.Агент,0);
			ПерезапускСервера();
			Если ТехПоддержкаАвтоматическаяОтправка Тогда 
				ОтправитьОшибкуВТехподдержку(ПараметрыАгента.Агент, ИмяЗапроса + РазделительСтрок + Ошибка); 
			КонецЕсли;
		КонецПопытки;
		
		ЗапросОбработан(ПараметрыАгента.Агент,ИмяЗапроса,Статус);
		
	Иначе
		Попытка
			//Полная загрузка*********************************************************************
			Если ИмяЗапроса="FullLoad" Тогда
				Статус = ВыгрузитьДанные(Адрес, Платформа);
			//Загрузка Документов Продажа в компьютер ********************************************
			ИначеЕсли ИмяЗапроса="Invoice" Тогда
				Статус = ЗагрузитьРасходныеНакладные(Адрес, Платформа, ТелоЗапроса, 0);
			//Загрузка Документов Заявка в компьютер *********************************************
			ИначеЕсли ИмяЗапроса="Request" Тогда
				Статус = ЗагрузитьРасходныеНакладные(Адрес, Платформа, ТелоЗапроса, 1);
			//Загрузка Документов Инвентаризация
			ИначеЕсли ИмяЗапроса="Inventory" Тогда
				Статус = ЗагрузитьИнвентаризации(Адрес, Платформа, ТелоЗапроса);
			//Загрузка Документов Покупка в компьютер ********************************************
			ИначеЕсли ИмяЗапроса="ReceiptInvoice" Тогда
				Статус = ЗагрузитьПриходныеНакладные(Адрес, Платформа, ТелоЗапроса);
			//Загрузка данных о новом клиенте ****************************************************
			ИначеЕсли ИмяЗапроса="NewClient" Тогда
				Статус = ЗагрузитьНовыхКлиентов(Адрес, ТелоЗапроса);
			//Загрузка лога событий произошедших на КПК ******************************************
			ИначеЕсли ИмяЗапроса="ErrorLog" Тогда 
				Статус = ЗагрузитьОтчетОбОшибках(Адрес, ТелоЗапроса);
			//Обновить остатки********************************************************************
			ИначеЕсли ИмяЗапроса="Rests" Тогда
				Статус = ВыгрузитьОстатки(Адрес, Платформа);
			//Быстрые остатки*********************************************************************
			ИначеЕсли ИмяЗапроса="FastRests" Тогда
				Статус = ВыгрузитьБыстрыеОстатки(Адрес);
				СерверПослатьОтвет(Адрес,"",1); //передаем пустую строку		
			//Подсказки по продажам **************************************************************
			ИначеЕсли ИмяЗапроса="SalesHelp" Тогда
				Статус = ВыгрузитьПодсказкиПродажПоЗапросу(Адрес, ТелоЗапроса,5);
			//Документ ПКО************************************************************************
			ИначеЕсли ИмяЗапроса="PKO" Тогда
				Статус = ЗагрузитьПКО(Адрес, Платформа, ТелоЗапроса);
			//Документ Анкета*********************************************************************
			ИначеЕсли ИмяЗапроса="Anketa" Тогда
				Статус = ЗагрузитьАнкеты(Адрес, Платформа, ТелоЗапроса);
			//GPS-координаты агента **************************************************************
			ИначеЕсли ИмяЗапроса="GPS" Тогда
				Статус = ЗагрузитьКоординаты(Адрес, ТелоЗапроса);
			//GPS-координаты Контрагентов*********************************************************
			ИначеЕсли ИмяЗапроса="GPSClient" Тогда
				Статус = ЗагрузитьКоординатыКонтрагентов(Адрес, ТелоЗапроса);
			//обновление программы****************************************************************
			ИначеЕсли ИмяЗапроса="GetUpdate" Тогда
				Статус = ВыгрузитьСписокФайловДляОбновления(Адрес, Платформа);
			//Изменение статуса сообщения*********************************************************
			ИначеЕсли ИмяЗапроса="MSGStatus" Тогда
				Статус = ИзменитьСтатусСообщений(Адрес, ТелоЗапроса);
			//Запрос на загрузку сообщений********************************************************
			ИначеЕсли ИмяЗапроса="Messages" Тогда
				Статус = ВыгрузитьСообщенияПоЗапросу(Адрес, "1,2,3");	
			//Выгрузка отчета о выполнении заданий************************************************
			ИначеЕсли ИмяЗапроса="TaskReport" Тогда
				Статус = ЗагрузитьОтчетОВыполнении(Адрес, ТелоЗапроса);
			//Запрос на выгрузку данных о маршруте агента ****************************************
			ИначеЕсли ИмяЗапроса="FastTasks" Тогда
				Статус = ВыгрузитьМаршруты(Адрес, Платформа, ПараметрыАгента.ВыгружатьМаршруты, Ложь, Неопределено);
			//Запрос на коррекцию документа ******************************************************
			ИначеЕсли ИмяЗапроса="ImproveDocuments" Тогда
				Статус = СкорректироватьДокументы(Адрес, ТелоЗапроса);
			ИначеЕсли ИмяЗапроса="Route" Тогда
				Статус = СформироватьМаршрут(Адрес, ТелоЗапроса);
			ИначеЕсли ИмяЗапроса="GetDeviceSettings" Тогда
				Статус = ВыгрузитьНастройкиУстройства(Адрес, ТелоЗапроса);
			ИначеЕсли ИмяЗапроса="ClientPrices" Тогда
				Статус = ВыгрузитьЦеныКонтрагента(Адрес, ТелоЗапроса);
			Иначе
			//Кто-то чужой к нам лезет************************************************************
				ДобавитьВЛогФайл("Неизвестный запрос '"+ИмяЗапроса+"'",ПараметрыАгента.Агент,0);
				ОтправитьОшибку(Адрес,"FORMAT_ERROR");
				Сервер.ЗапросОбработан();
				Возврат;
			КонецЕсли;
		Исключение
			Ошибка=ОписаниеОшибки();
			Сообщить(Ошибка);
			Ошибка=Ошибка+РазделительСтрок+"Тело запроса:"+РазделительСтрок+ТелоЗапроса;
			ДобавитьВЛогФайл("Исключительная ситуация при обработке "+ИмяЗапроса+" "+Ошибка,ПараметрыАгента.Агент,0);
			ПерезапускСервера();
			Если ТехПоддержкаАвтоматическаяОтправка Тогда 
				ОтправитьОшибкуВТехподдержку(ПараметрыАгента.Агент, ИмяЗапроса + РазделительСтрок + Ошибка); 
			КонецЕсли;			
		КонецПопытки;
		
		ЗапросОбработан(ПараметрыАгента.Агент,ИмяЗапроса,Статус);
		
		//если это был запрос настроек с КПК, то необходимо обновить файл ключей
		Если ИмяЗапроса = "GetDeviceSettings" Тогда
			ПутьКФайлуКлючей=КаталогЛогФайлов+"\lickeys_utf8.txt";
			файлКлючи = новый Файл(ПутьКФайлуКлючей);
			Если файлКлючи.Существует() Тогда
				Состояние("Обновление лицензионных ключей");
				
				Статус = Сервер.ОбновитьФайлКлючей();
				Если Не ПустаяСтрока(Статус) Тогда
					Если Найти(Статус, "Ошибка запроса к серверу активации") > 0 Тогда
						ЗапуститьПриложение("https://mobi-c.ru/help/error7.htm");
					КонецЕсли;						
					Предупреждение(Статус);	
				КонецЕсли;				
				
				УстановитьПризнакНеобходимостиОбновленияКлючейДляСервера();
				
				Состояние("");
			Иначе
				Сообщить("Файл ключей не найден.");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаСобытияPocketServer(Источник, Заголовок, ТелоСообщения)
	Если РежимОтладки Тогда
		ДобавитьВЛогФайл(ТелоСообщения);
	КонецЕсли;
	
	Адрес = Заголовок;
	
	КолСтрок=СтрЧислоСтрок(ТелоСообщения);
	Если КолСтрок < 3 Тогда  //Тело сообщения должно содержать минимум 3 строки
		Сообщить(Адрес+": неверный формат запроса");
		ОтправитьОшибку(Адрес,"Неверный формат запроса");
		ДобавитьВЛогФайл("Неверный формат запроса "+ТелоСообщения);
		Сервер.ЗапросОбработан();
		Возврат;
	КонецЕсли;	
	
	Версия=ПолучитьСтрокуБез13(ТелоСообщения,1);
	Платформа =ПолучитьСтрокуБез13(ТелоСообщения,2);
	ИмяЗапроса = "";
	Если Найти("|Android|WM|HTML|","|"+Платформа+"|")=0 Тогда
		//Версия 4.8 или ранее
		КодАгента=ПолучитьСтрокуБез13(ТелоСообщения,2);
		ИмяЗапроса=ПолучитьСтрокуБез13(ТелоСообщения,3);
		Если НЕ ИмяЗапроса="CurrentPosition" Тогда
			Платформа="WM";
		КонецЕсли;
	Иначе
		//Версия 4.9 или позднее
		ИмяЗапроса=ПолучитьСтрокуБез13(ТелоСообщения,4);
		Если ИмяЗапроса="GetDeviceSettings" Тогда
			КодАгента=НастройкиУстройстваКодАгента;
			Если ПустаяСтрока(КодАгента) Тогда
				//СерверПослатьОтвет(Адрес, "Сначала нужно в обработке обмена данными в 1С зайти в настройки агента и нажать кнопку 'Настроить устройство'"+РазделительСтрок+РазделительСтрок,1);
				СерверПослатьОтвет(Адрес, 
					"На мобильном устройстве активировано 'Подключение к учетной системе'.
					|Для загрузки настроек Агента в устройство, откройте в модуле интеграции Моби-С 
					|Справочники / Агенты, в настройках Агента нажмите кнопку 'Настроить мобильное устройство'"
					+ РазделительСтрок + РазделительСтрок,1);
				Возврат;
			КонецЕсли;
		Иначе
			КодАгента=ПолучитьСтрокуБез13(ТелоСообщения,3);
		КонецЕсли;
	КонецЕсли;
	
	КодАгента = СтрЗаменить(КодАгента, Символ(30), РазделительСтрок);
	ПарольНаОбменДанными = "";
	Если СтрЧислоСтрок(КодАгента)>=2 Тогда
		ПарольНаОбменДанными=СтрПолучитьСтроку(КодАгента, 2);
	КонецЕсли;
	КодАгента = СтрПолучитьСтроку(КодАгента, 1);
	агент = ПолучитьАгентаПоКоду(КодАгента);
	ЗаписатьВРегистрСохраненныеНастройки(агент, ТекущаяДата(), "ПоследнийОткликАгента");
		
	ДобавитьВЛогФайл("Получен запрос: "+Версия+Таб+КодАгента+Таб+Платформа+Таб+ИмяЗапроса);
	
	Если ИмяЗапроса="CurrentPosition" Тогда
		Если КодАгента<>"" Тогда
			Сообщить(Адрес+": неверный формат запроса");
			ОтправитьОшибку(Адрес,"Неверный формат запроса");
			ДобавитьВЛогФайл("Неверный формат запроса "+ТелоСообщения);
			Сервер.ЗапросОбработан();
			Возврат;
		КонецЕсли;
		
		СохранитьТекущиеКоординатыАгентов(ТелоСообщения);
		Сервер.ЗапросОбработан();
		Возврат;
	КонецЕсли;

	Если (Версия<>ВерсияПротокола) 
		И (ИмяЗапроса<>"FileLoad") 
		И (ИмяЗапроса<>"GetUpdate") 
		И (ИмяЗапроса<>"GetDeviceSettings") 
		Тогда  
		//Пора обновлять программу на КПК
		ДобавитьВЛогФайл("Версия  ("+Версия+") НЕ поддерживается",,,СтатусСообщения.Важное);
		ОтправитьОшибку(Адрес,"INCORRECT_VERSION" + РазделительСтрок);
		Сервер.ЗапросОбработан();
		Возврат;
	КонецЕсли;
	
	//ПараметраАгента - структура со всеми персональными настройками агента 
	//(отбор Номенклатуры, Контрагентов, склад и др.)
	ПараметрыАгента = ПолучитьВсеНастройкиАгента(КодАгента);
	Если (ПараметрыАгента = Неопределено)  или (ПараметрыАгента.Агент = Неопределено) Тогда
		ДобавитьВЛогФайл("Агент с кодом '"+КодАгента+"' НЕ найден в справочнике пользователей",,,СтатусСообщения.Важное);
		ОтправитьОшибку(Адрес,"Агент с кодом '"+КодАгента+"' НЕ найден в справочнике пользователей");
		Сервер.ЗапросОбработан();
		Возврат;
	КонецЕсли;
	ТекущийАгент = ПараметрыАгента.Агент;
	
	ОбработкаЗапроса(Адрес,ИмяЗапроса,ТелоСообщения,Платформа);
КонецПроцедуры

Процедура ОбработкаСобытияSkyServer(Источник, Заголовок, ТелоСообщения)
	ТребуетсяПерезапускСервера = Ложь;
	Если Заголовок = "Ping" Тогда
		Сервер.Pong();
	Иначе
		Если ТелоСообщения="SKY_SERVER_DISCONNECTED" Тогда
			ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Истина;
			ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Ложь;
			ИспользоватьСерверМобиС=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ИспользоватьСерверМобиС");
			Если ИспользоватьСерверМобиС Тогда
				ВывестиСтатусОблачногоСервера(				
					"Потеряна связь с сервером Моби-С <br>
					|1. Проверьте соединение с интернет<br>
					|2. Перезапустите модуль интеграции");
				ДобавитьВЛогФайл("Потеряна связь с сервером Моби-С");
			Иначе
				Сообщение = "Облачный сервер не подключен";
				ВывестиСтатусОблачногоСервера(Сообщение);
				ДобавитьВЛогФайл(Сообщение);
			КонецЕсли;
		ИначеЕсли ТелоСообщения="SKY_SERVER_CONNECTED" Тогда
			ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Истина;
			ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Ложь;
			ДобавитьВЛогФайл("Установлено соединение с сервером Моби-С");
			ОбновитьСтатусУчетнойСистемы();		
		ИначеЕсли ТелоСообщения="UNKNOWN_ACC_SYSTEM" Тогда
			ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Истина;
			Сообщение = "Ошибка соединения с облачным сервером Моби-С. В настройках Модуля интеграции указан неверный код базы";
			ВывестиСтатусОблачногоСервера(Сообщение);
			ДобавитьВЛогФайл(Сообщение);
		//ИначеЕсли Лев(ТелоСообщения,37)="ACC_SYSTEM_CONNECTION_LIMIT_EXCEEDED"+Таб Тогда
		//	ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Ложь;
		//	ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Ложь;
		//	ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Истина;
		//	ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Ложь;
		//	Сообщение=
		//		"Превышено разрешённое количество подключений к серверу Моби-С.
		//		|Список уже установленных соединений:";
		//	Строки=СтрЗаменить(ТелоСообщения,Таб,РазделительСтрок);
		//	Для Н=2 По СтрЧислоСтрок(Строки) Цикл
		//		Сообщение=Сообщение+РазделительСтрок+СтрПолучитьСтроку(Строки,Н);
		//	КонецЦикла;
		//	ДобавитьВЛогФайл(Сообщение);
		//ИначеЕсли ТелоСообщения="ERROR_DEVICE_COUNT_LIMIT_EXCEEDED" Тогда
		//	ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Ложь;
		//	ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Ложь;
		//	ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Истина;
		//	ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Ложь;
		//	Сообщение = "Превышено разрешённое количество подключений к серверу Моби-С.";
		//	ВывестиСтатусОблачногоСервера(Сообщение);
		//	ДобавитьВЛогФайл(Сообщение);		
		Иначе
			ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Истина;
			Сообщение = "Ошибка обмена с облачным сервером: "+ТелоСообщения;
			ВывестиСтатусОблачногоСервера(Сообщение);
			ДобавитьВЛогФайл(Сообщение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Реагирует на поступление запроса от КПК
// Параметры
// Источник - строка, содержит слово "PocketServer", для проверки, что это событие вызвано именно КПК
// Заголовок - строка, содержит адрес сессии обмена
// ТелоСообщения - строка, сам полученный запрос 
Процедура ОбработкаВнешнегоСобытия(Источник, Заголовок, ТелоСообщения)
	Если Источник="PocketServer" Тогда 
		ОбработкаСобытияPocketServer(Источник,Заголовок,ТелоСообщения);
	ИначеЕсли Источник="SkyServer" Тогда 
		ОбработкаСобытияSkyServer(Источник,Заголовок,ТелоСообщения);
	Иначе
		Возврат; 
	КонецЕсли;
КонецПроцедуры

//Проверка блокировки порта
Функция ПроверитьБлокировкуПорта(ПутьКФайлБлокировки)
	ФС = Новый Файл(ПутьКФайлБлокировки);
	Если ФС.Существует() Тогда
		Попытка
			УдалитьФайлы(ПутьКФайлБлокировки); 
		Исключение
		КонецПопытки;
		ФС = Новый Файл(ПутьКФайлБлокировки);
		Если ФС.Существует()  Тогда
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;	
	Иначе	
		Возврат Ложь; //Файла нет значит, порт НЕ заблокирован	
	КонецЕсли; 
	
КонецФункции
 
/////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Вызывается перед открытием формы
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	врФайлПинг4 = ПолучитьИмяВременногоФайла();
	врФайлПинг8 = ПолучитьИмяВременногоФайла();
	Если Не ПустаяСтрока(ОшибкиПриЗапуске) Тогда
		Если Вопрос(ОшибкиПриЗапуске + Символы.ПС + "Продолжить запуск Моби-С?", 
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Если Вопрос("Обработку рекомендуется запускать от имени пользователя с ПОЛНЫМИ ПРАВАМИ. 
					|Под текущим пользователем возможны ошибки при обмене с КПК. Продолжить?", 
					РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет  Тогда
		    Отказ = Истина;
			Возврат; 
		КонецЕсли;     
	КонецЕсли; 
КонецПроцедуры

// Выполняет различные проверки структур и форматов баз данных, таблиц и прочего на
// 		предмет устаревания или отсутствия и приводит их к формату текущей версии обработки
Функция ПроверкаСтруктурСохраненныхЗначений(ТекПользователь, МобиСПользователиСервер)
	//Получаем папку Мои документы
	Shell=Новый COMОбъект("WScript.Shell");
	ПапкаПоУмолчанию=Shell.SpecialFolders.Item("MyDocuments")+"\MobiS";
	КаталогЛогФайлов  = ПолучитьНастройку(МобиС,"КаталогЛогФайлов",""); //папка где хранятся ЛОГ-файлы
	Если НЕ ЗначениеЗаполнено(КаталогЛогФайлов) Тогда
		КаталогЛогФайлов = ПапкаПоУмолчанию;
		Форма = ПолучитьФорму("ФормаВыбораКаталога");
		Форма.ОткрытьМодально();
		ЗаписатьВРегистрСохраненныеНастройки(МобиС,КаталогЛогФайлов,"КаталогЛогФайлов");
	КонецЕсли; 
	
	Попытка
		СоздатьКаталог(КаталогЛогФайлов);
	Исключение
		Предупредить(
			"Не удалось создать каталог " + Символы.ПС 
			+ Символы.ПС 
			+ КаталогЛогФайлов + Символы.ПС 
			+ Символы.ПС 
			+ "Значение будет заполнено по умолчанию.");
		КаталогЛогФайлов = ПапкаПоУмолчанию;
		СоздатьКаталог(КаталогЛогФайлов);
	КонецПопытки; 
	
	ФС = Новый Файл(КаталогЛогФайлов); 
	Если ФС.ПолучитьТолькоЧтение() Тогда
		Предупреждение("Отсутствуют права на запись в каталог "+КаталогЛогФайлов);
	КонецЕсли; 
	Попытка
		ВремФайл = КаталогЛогФайлов+"\ВремФайл.Txt";
		ВремФайл = Новый ЗаписьТекста(КаталогЛогФайлов+"\ВремФайл.Txt", КодировкаТекста.ANSI,,Истина);
		ВремФайл.ЗаписатьСтроку("Проверка записи");
		ВремФайл.Закрыть();
		УдалитьФайлы(ВремФайл);
	Исключение
		Предупреждение("Нет доступа на запись в каталог "+КаталогЛогФайлов);
	КонецПопытки; 
	
	ТабличноеПолеРегДанные = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "СписокКПК");
	Изменено = Ложь;
	Если ТипЗнЧ(ТабличноеПолеРегДанные) <> Тип("ТаблицаЗначений") Тогда
		ТабличноеПолеРегДанные = Новый ТаблицаЗначений;
		Изменено = Истина;
	КонецЕсли; 
	Если ТабличноеПолеРегДанные.Колонки.Найти("КодКПК") = Неопределено Тогда
		ТабличноеПолеРегДанные.Колонки.Добавить("КодКПК", Новый ОписаниеТипов("Строка"));
		Изменено = Истина;
	КонецЕсли; 	 
	Если ТабличноеПолеРегДанные.Колонки.Найти("Ключ") = Неопределено Тогда
		ТабличноеПолеРегДанные.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
		Изменено = Истина;
	КонецЕсли; 	 
	Если ТабличноеПолеРегДанные.Колонки.Найти("Рег") = Неопределено Тогда
		ТабличноеПолеРегДанные.Колонки.Добавить("Рег", Новый ОписаниеТипов("Строка"));
		Изменено = Истина;
	КонецЕсли;
	Если ТабличноеПолеРегДанные.Колонки.Найти("Комментарий") = Неопределено Тогда
		ТабличноеПолеРегДанные.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
		Изменено = Истина;
	КонецЕсли;
	Если Изменено Тогда
		ЗаписатьВРегистрСохраненныеНастройки(МобиС,ТабличноеПолеРегДанные,"СписокКПК");
	КонецЕсли;
	
	Каналы = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "КаналыСбыта");
	Изменено = Ложь;
	Если ТипЗнЧ(Каналы) <> Тип("ТаблицаЗначений") Тогда
		Каналы = Новый ТаблицаЗначений;
		Изменено = Истина;
	КонецЕсли; 
	Если Каналы.Колонки.Найти("Наименование") = Неопределено Тогда
		Каналы.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
		Изменено = Истина;
	КонецЕсли;
	Если Каналы.Колонки.Найти("КаналСбытаКонтрагенты") = Неопределено Тогда
		Каналы.Колонки.Добавить("КаналСбытаКонтрагенты", Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
		Изменено = Истина;
	КонецЕсли;
	Если Каналы.Колонки.Найти("КаналСбытаНоменклатура") = Неопределено Тогда
		Если Конфигурация = "БухКазахстан" Тогда		
			Каналы.Колонки.Добавить("КаналСбытаНоменклатура", Новый ОписаниеТипов("СправочникСсылка.КатегорииОбъектов"));
		Иначе
			Каналы.Колонки.Добавить("КаналСбытаНоменклатура", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СвойстваОбъектов"));
		КонецЕсли;
		Изменено = Истина;
	КонецЕсли;
	Если Изменено Тогда
		ЗаписатьВРегистрСохраненныеНастройки(МобиС, Каналы, "КаналыСбыта");
	КонецЕсли;
// Исключено SQLite

//
	ТаблАгентов = ПолучитьТаблицуАгентов();
	Для Каждого Стр Из ТаблАгентов Цикл
		ТекАгент = Стр.Агент;
		Значение = ПрочитатьИзРегистраСохраненныеНастройки(ТекАгент,"КонтролироватьСозданиеДокументаПродажа");
		Если Значение <> Неопределено Тогда Прервать; КонецЕсли;
		КонтрольПоGPS = ПолучитьНастройку(ТекАгент,"КонтролироватьСозданиеДокументов", Ложь);
		
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеДокументаПродажа");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеДокументаЗаказ");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеДокументаПокупка");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеДокументаПКО");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеДокументаАнкета");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеДокументаИнвентаризация");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьСозданиеФотографий");
		ЗаписатьВРегистрСохраненныеНастройки(ТекАгент, КонтрольПоGPS, "КонтролироватьМестоВыполненияЗаданий");
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ПолучитьPIDПроцесса()
	PID = -1;
	
	Попытка
		WSS=Новый COMОбъект("WScript.Shell");
		oExec=WSS.Exec("rundll32.exe kernel32,Sleep");
		PID=ПолучитьCOMОбъект(
			"winmgmts:{impersonationLevel=impersonate}!\\.\root\CIMV2:Win32_Process.Handle='"
			+ Формат(oExec.ProcessID,"ЧГ=0")+"'").ParentProcessID;
		oExec.Terminate();		
	Исключение
	КонецПопытки;	
	
	Возврат PID;
КонецФункции

Функция ПолучитьИдентификаторОбработки(начЗнч = -1)
	начальноеЗначение = начЗнч;
	Если начальноеЗначение = -1 Тогда
		ГУИД = Строка(новый УникальныйИдентификатор());
		ГУИД = СтрЗаменить(ГУИД, "-", "");
		начальноеЗначение = 0;
		для й = 1 по 32 Цикл
			начальноеЗначение = начальноеЗначение + КодСимвола(Сред(ГУИД, й, 1));
		КонецЦикла;
	КонецЕсли;	
	ГСЧ = Новый ГенераторСлучайныхЧисел(начальноеЗначение);
	Возврат Формат(ГСЧ.СлучайноеЧисло(0, 999999), "ЧЦ=6; ЧН=; ЧВН=; ЧГ=0");
КонецФункции

// Проверяет есть ли ПВХ.СвойстваОбъектов с указанным названием 
// Если такого нет, то создает его. 
// Возвращает ссылку на эту настройку
// Параметры
//	Наименование - Наименование искомого объекта
//	ТипЗнач - Тип значения характеристики (значения какого типа может принимать данное свойство)
//	НазначениеСвойства - Вид объекта к которому относится свойство
//
Функция ИнициализироватьСвойствоОбъекта(Наименование, ТипЗнач, НазначениеСвойства)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ ПланВидовХарактеристик.СвойстваОбъектов 
	|ГДЕ Наименование = &Наименование И НазначениеСвойства = &НазначениеСвойства");
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("НазначениеСвойства",НазначениеСвойства);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПВХ = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		ПВХ.НазначениеСвойства	= НазначениеСвойства;
		ПВХ.Наименование		= Наименование;
		//ПВХ.ТипЗначения			= ТипЗнач;
		Если ТипЗнач = Тип("Булево") Тогда
			ПВХ.Категория = Истина;
		КонецЕсли;
		ПВХ.Записать();
		Сообщить("Создан элемент плана видов характеристик ""СвойстваОбъектов"" с наименованием '" + Наименование + "' назначение " + НазначениеСвойства);
		возврат ПВХ.Ссылка;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		возврат Выборка.Ссылка;
	КонецЕсли; 
КонецФункции //

Функция ОбновитьИнформациюПоКлючамДляСервера()
	
	//процедура загрузки регистрационных ключей
	ПутьКФайлуКлючей=КаталогЛогФайлов+"\lickeys_utf8.txt";
	Ф=Новый Файл(ПутьКФайлуКлючей);
	Если не ф.Существует() Тогда
		зт = новый ЗаписьТекста(ПутьКФайлуКлючей, КодировкаТекста.UTF8);
		зт.Записать("# Редактирование этого файла вручную запрещено." + Символы.ПС);
		зт.Закрыть();			
	КонецЕсли;		
	Если Ф.Существует() Тогда
		Сервер.УстановитьФайлКлючей(ПутьКФайлуКлючей);
	КонецЕсли;
	
	Статус = Сервер.ОбновитьФайлКлючей();
	Если Не ПустаяСтрока(Статус) Тогда
		Если Найти(Статус, "Ошибка запроса к серверу активации") > 0 Тогда
			ЗапуститьПриложение("https://mobi-c.ru/help/error7.htm");
		КонецЕсли;						
		Предупреждение(Статус);	
	КонецЕсли;
	
	ПутьКФайлуЧС=КаталогЛогФайлов+"\blacklist.bin";
	Статус=Сервер.УстановитьФайлЧерногоСписка(ПутьКФайлуЧС);
	Если Статус<>"" Тогда
		ДобавитьВЛогФайл(
			"Ошибка при проверке подлинности ключей: " + Статус + РазделительСтрок 
			+ "Обмен данными возможен только в Демо-режиме с одним КПК.",
			,
			0,
			СтатусСообщения.Важное);
	КонецЕсли;		
	
	Ключи=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"СписокКПК");
	Если Ключи <> Неопределено Тогда
		Для Каждого СтрТабл Из Ключи Цикл
			СтрТабл.Рег = Сервер.ЗарегистрироватьКПК(СтрТабл.КодКПК, СтрТабл.Ключ);
		КонецЦикла;	
	КонецЕсли;	
	
КонецФункции

// Обработчик открытия формы
Процедура ПриОткрытии()
	
	ТребуетсяПерезапускСервера = Ложь;
	
	ВывестиСтатусОблачногоСервера();
	АвтономныйРежим = Истина;
	РежимРабочееМесто = Ложь;
	Модифицированность = Ложь;
	
	ЭлементыФормы.НадписьКонфигурация.Значение = "Конфигурация """ + Метаданные.Имя + """";

	ЗагрузитьАгентов();
	
	РежимОтладки = ПолучитьНастройку(МобиС, "РежимОтладки", Ложь);
	PID = -1;
	Если РежимОтладки Тогда
		PID = ПолучитьPIDПроцесса();
	КонецЕсли;
	ИдентификаторОбработки = ПолучитьИдентификаторОбработки();
	
	ПВХКаналаСбытаКонтрагента	= ИнициализироватьСвойствоОбъекта("Канал сбыта",
		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)),
		ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	ПВХУникКодДокумента        	= ИнициализироватьСвойствоОбъекта("Уник.код документа",
		Новый ОписаниеТипов("Строка"),
		ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
	ПВХУВремяСозданияДокумента	= ИнициализироватьСвойствоОбъекта("Время затраченное на создание документа в КПК(мин)",
		Новый ОписаниеТипов("Строка"),
		ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
	ПВХУДатаСозданияДокумента	= ИнициализироватьСвойствоОбъекта("Дата создания документа",
		Новый ОписаниеТипов("Дата"),
		ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
	ПВХУЗадание=ИнициализироватьСвойствоОбъекта("Задание",
		Новый ОписаниеТипов("Строка"),
		ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
	ПВХФотоДокумента=ИнициализироватьСвойствоОбъекта("Фото",
		Новый ОписаниеТипов("Строка"),
		ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		
	//настроим интерфейс
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	МобиСПользователиСервер = ПолучитьСписокПользователейДляРежимСервера();		
		
	Если ПроверкаСтруктурСохраненныхЗначений(ТекПользователь, МобиСПользователиСервер) = Ложь Тогда
		ПредупреждениеПриЗакрытии = Ложь;
		Закрыть();
		Возврат;	
	КонецЕсли;
		
	//ПроверкаСтруктурСохраненныхЗначений();
	ПрочитатьПараметрыПрограммы();
	ПроверитьВерсиюОбработки(); //м.б. нужно изменить структуру
	
	////ДобавитьВЛогФайл(
	////	"Запуск Моби-С " + ВерсияДистрибутива + ", обработка " + ВерсияОбработки 
	////	+ " на конфигурации " + Метаданные.ПодробнаяИнформация + " версия " + Метаданные.Версия);	
	
	ПользовательСервер=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"ПользовательСервер");
	Если ЗначениеЗаполнено(ПользовательСервер) Тогда
		Если ТекПользователь<>ПользовательСервер Тогда
			ЭлементыФормы.ПанельЗакладок.ТекущаяСтраница=ЭлементыФормы.ПанельЗакладок.Страницы.РабочееМесто;
			РежимРабочееМесто=Истина;
		КонецЕсли;
	КонецЕсли;

	//ДатаПоследнегоСжатияMDB = ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"ДатаПоследнегоСжатияMDB");
	//начДн = НачалоДня(ТекущаяДата());
	//Если ДатаПоследнегоСжатияMDB <> начДн Тогда
	//	ДатаПоследнегоСжатияMDB = начДн;
	//	ЗаписатьВРегистрСохраненныеНастройки(МобиС, ДатаПоследнегоСжатияMDB, "ДатаПоследнегоСжатияMDB");
	//	//СжатьMDB();
	//КонецЕсли;
	
	ИнициализироватьПостроительЗапросаНоменклатура();
	
	ИнициализироватьПостроительЗапросаКонтрагенты();
	
	ЭлементыФормы.НадписьВерсияМобиС.Заголовок = "Обслуживается Моби-С версии "+ВерсияПротокола+ " Порт: ";
	

	//ДеньНедели = ДеньНедели(ТекущаяДата());  //день недели сегодня
	//ЭлементыФормы.НадписьСегодня.Заголовок = ""+Перечисления.ДниНедели[ДеньНедели-1];
	
	ТекстОшибки = "";
	Попытка
		СИ = Новый СистемнаяИнформация();
		версияОС = СИ.ВерсияОС;
		версияОС = СтрПолучитьСтроку(СтрЗаменить(СтрПолучитьСтроку(СтрЗаменить(версияОС, "version ", Символы.ПС), 2), " ", Символы.ПС), 1);
		версия = Число(версияОС);
		ЭтоСтараяСистема = версия <= 6.0;
	Исключение
		ЭтоСтараяСистема = Ложь;
	КонецПопытки;
	
	ЭтоСистема64 = Ложь;
	Попытка
		Выполнить("ЭтоСистема64 = СИ.ТипПлатформы = ТипПлатформы.Windows_x86_64;");
	Исключение
	КонецПопытки;
//	
	ДобавитьВЛогФайл(
		"Запуск Моби-С " + ВерсияДистрибутива + ", обработка " + ВерсияОбработки + ?(ЭтоСистема64, " x64", " x86")
		+ " на конфигурации " + Метаданные.ПодробнаяИнформация + " версия " + Метаданные.Версия);	
	ЭтаФорма.Заголовок = "Мобильная торговля Моби-С (" + ВерсияДистрибутива + ")" + ?(ЭтоСистема64, " x64", " x86");	
		
	Если ЭтоСистема64 Тогда	
		Если ЭтоСтараяСистема Тогда
			Попытка
			//подключаем по старой схеме
				ЗагрузитьВнешнююКомпоненту(СервернаяКомпонента64);
				АвтономныйРежим = Ложь;		
			Исключение
				ТекстОшибки=
					"Ошибка загрузки библиотеки работы с КПК .
					|Возможно отсутствует файл " + СервернаяКомпонента64 + "
					| в папке "+КаталогПрограммы();
				АвтономныйРежим = Истина;
			КонецПопытки;	
		Иначе		
			Попытка
				ЭлементыФормы.НадписьКаталогPocketServer.Гиперссылка = Ложь;			
				СервернаяКомпонента64 = ПолучитьИмяВременногоФайла();
				макет = ПолучитьМакет("PocketServer64");
				макет.Записать(СервернаяКомпонента64);
				ИмяКомпоненты = "Сервер";
				//пробуем подключить внешнюю компоненту, 
				//если не получилось - устанавливаем и снова подключаем
				Выполнить("
				|Если ПодключитьВнешнююКомпоненту(СервернаяКомпонента64, ИмяКомпоненты, ТипВнешнейКомпоненты.Native) Тогда
				|	АвтономныйРежим = Ложь;			
				|Иначе
				|	а = 5 / 0;
				|КонецЕсли;");
			Исключение
				ТекстОшибки="Ошибка загрузки библиотеки " + СервернаяКомпонента64;
				АвтономныйРежим = Истина;
			КонецПопытки;	
		КонецЕсли;
		
		Попытка
			Если ЭтоСтараяСистема Тогда
				Сервер=Новый(ИмяСервераСтараяСистема64);
			Иначе
				Сервер=Новый(ИмяСервера64);
			КонецЕсли;
			ДобавитьВЛогФайл("Внешняя компонента выгружена в " + Сервер.ПолучитьПутьМодуля());
		Исключение
			ТекстОшибки=
				"Ошибка загрузки библиотеки работы с КПК.
				|Возможно отсутствует файл " + СервернаяКомпонента64 + "
				|в каталоге "+КаталогПрограммы();
			АвтономныйРежим = Истина;
		КонецПопытки;
		
		Если НЕ АвтономныйРежим Тогда
			Попытка
				Если Сервер.Версия() <> ВерсияPocketServer Тогда
					ТекстОшибки = 
						"Используется версия " + СервернаяКомпонента64 + " v." + Сервер.Версия() 
						+ ". Для обработки требуется v." + ВерсияPocketServer;
					АвтономныйРежим = Истина;
				КонецЕсли;
			Исключение  //если возникло исключение то функции версия в DLL нет, она устаревшая
				ТекстОшибки = 
					"Используется версия " + СервернаяКомпонента64 + " v." + Сервер.Версия() 
					+ ". Для обработки требуется v." + ВерсияPocketServer;
				АвтономныйРежим = Истина;			
			КонецПопытки;
		КонецЕсли;		
	Иначе
		Если ЭтоСтараяСистема Тогда
			Попытка
			//подключаем по старой схеме
				ЗагрузитьВнешнююКомпоненту(СервернаяКомпонента);
				АвтономныйРежим = Ложь;		
			Исключение
				ТекстОшибки=
					"Ошибка загрузки библиотеки работы с КПК .
					|Возможно отсутствует файл " + СервернаяКомпонента + "
					| в папке "+КаталогПрограммы();
				АвтономныйРежим = Истина;
			КонецПопытки;	
		Иначе		
			Попытка
				ЭлементыФормы.НадписьКаталогPocketServer.Гиперссылка = Ложь;			
				СервернаяКомпонента = ПолучитьИмяВременногоФайла();
				макет = ПолучитьМакет("PocketServer");
				макет.Записать(СервернаяКомпонента);
				ИмяКомпоненты = "Сервер";
				//пробуем подключить внешнюю компоненту, 
				//если не получилось - устанавливаем и снова подключаем
				Выполнить("
					|Если ПодключитьВнешнююКомпоненту(СервернаяКомпонента, ИмяКомпоненты, ТипВнешнейКомпоненты.Native) Тогда
					|	АвтономныйРежим = Ложь;			
					|Иначе
					|	а = 5 / 0;
					|КонецЕсли;");
			Исключение
				ТекстОшибки="Ошибка загрузки библиотеки " + СервернаяКомпонента;
				АвтономныйРежим = Истина;
			КонецПопытки;				
		КонецЕсли;
		
		Попытка
			Если ЭтоСтараяСистема Тогда
				Сервер=Новый(ИмяСервераСтараяСистема);
			Иначе
				Сервер=Новый(ИмяСервера);
			КонецЕсли;
			ДобавитьВЛогФайл("Внешняя компонента выгружена в " + Сервер.ПолучитьПутьМодуля());
		Исключение
			ТекстОшибки=
				"Ошибка загрузки библиотеки работы с КПК.
				|Возможно отсутствует файл " + СервернаяКомпонента + "
				|в каталоге "+КаталогПрограммы();
			АвтономныйРежим = Истина;
		КонецПопытки;
		
		Если НЕ АвтономныйРежим Тогда
			Попытка
				Если Сервер.Версия() <> ВерсияPocketServer Тогда
					ТекстОшибки = 
						"Используется версия " + СервернаяКомпонента + " v." + Сервер.Версия() 
						+ ". Для обработки требуется v." + ВерсияPocketServer;
					АвтономныйРежим = Истина;
				КонецЕсли;
			Исключение  //если возникло исключение то функции версия в DLL нет, она устаревшая
				ТекстОшибки = 
					"Используется версия " + СервернаяКомпонента + " v." + Сервер.Версия() 
					+ ". Для обработки требуется v." + ВерсияPocketServer;
				АвтономныйРежим = Истина;			
			КонецПопытки;
		КонецЕсли;		
	КонецЕсли;
//	
	ПроверитьВнешнююБД();	
	
	ДобавитьВЛогФайл(
		"Начало работы:"
		+ ?(АвтономныйРежим ИЛИ РежимРабочееМесто, 
			"", 
			" порт - " + ЦелоеВСтроку(Порт) + ";")
		+ ?(РежимОтладки, 
			" PID - " + ЦелоеВСтроку(PID) + ";", 
			"") 
		+ " обработка - " + ПолучитьРасположениеОбработки());
	
	////Если НЕ АвтономныйРежим Тогда
	////	Сервер=Новый(ИмяСервера);
	////	Попытка
	////		Если Сервер.Версия() <> ВерсияPocketServer Тогда
	////			ТекстОшибки = 
	////				"Используется версия " + СервернаяКомпонента + " v." + Сервер.Версия() 
	////				+ ". Для обработки требуется v." + ВерсияPocketServer;
	////			АвтономныйРежим = Истина;
	////		КонецЕсли;
	////	Исключение  //если возникло исключение то функции версия в DLL нет, она устаревшая
	////		ТекстОшибки = 
	////			"Используется версия " + СервернаяКомпонента + " v." + Сервер.Версия() 
	////			+ ". Для обработки требуется v." + ВерсияPocketServer;
	////		АвтономныйРежим = Истина;			
	////	КонецПопытки;
	////КонецЕсли;
	
	ПутьКФайлуКлючей = КаталогЛогФайлов + "\lickeys.txt";
	ПутьКФайлуКлючейUTF8 = КаталогЛогФайлов + "\lickeys_utf8.txt";
	Ф = Новый Файл(ПутьКФайлуКлючей);
	фUTF = Новый Файл(ПутьКФайлуКлючейUTF8);
	Если фUTF.Существует() Тогда
	//ничего не делаем, ключи не объединяем
	Иначе				
		Если ф.Существует() Тогда
		//преобразуем в utf-8	
			файлКлючей = Новый ТекстовыйДокумент();
			файлКлючей.Прочитать(ПутьКФайлуКлючей);
			ФайлКлючей.Записать(ПутьКФайлуКлючейUTF8, КодировкаТекста.UTF8);	
		Иначе					
			ФайлКлючей = Новый ТекстовыйДокумент();
			ФайлКлючей.УстановитьТекст("# Редактирование этого файла вручную запрещено.");
			ФайлКлючей.Записать(ПутьКФайлуКлючейUTF8, КодировкаТекста.UTF8);
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ РежимРабочееМесто Тогда
		Если НЕ АвтономныйРежим Тогда
			///
			//проверить блокировку обработки на текущем порте
			ПутьКФайлБлокировки = ПолучитьКаталог("") + Формат(Порт,"ЧГ=") + ".txt";
			Если  ПроверитьБлокировкуПорта(ПутьКФайлБлокировки)  Тогда 
				//порт блокирован
				АвтономныйРежим = Истина;
				ТекстОшибки ="Порт блокирован. Возможно, обработка для этого порта уже запущена.";
			Иначе
				//порт свободен
				Если Сервер.Инициализация(Порт)=0 Тогда
					АвтономныйРежим = Истина;
					ТекстОшибки ="Порт блокирован. Возможно, обработка для этого порта уже запущена.";
				Иначе
					//процедура загрузки регистрационных ключей
					//ПутьКФайлуКлючей=КаталогЛогФайлов+"\lickeys.txt";
					//Ф=Новый Файл(ПутьКФайлуКлючей);
					//Если не ф.Существует() Тогда
					//	зт = новый ЗаписьТекста(ПутьКФайлуКлючей, "windows-1251");
					//	зт.Записать("# Редактирование этого файла вручную запрещено." + Символы.ПС);
					//	зт.Закрыть();			
					//КонецЕсли;		
					//Если Ф.Существует() Тогда
					//	Сервер.УстановитьФайлКлючей(ПутьКФайлуКлючей);
					//КонецЕсли;
					//
					//Статус = Сервер.ОбновитьФайлКлючей();
					//Если Не ПустаяСтрока(Статус) Тогда
					//	Если Найти(Статус, "Ошибка запроса к серверу активации") > 0 Тогда
					//		ЗапуститьПриложение("https://mobi-c.ru/help/error7.htm");
					//	КонецЕсли;						
					//	Предупреждение(Статус);	
					//КонецЕсли;
					
					//ПутьКФайлуЧС=КаталогЛогФайлов+"\blacklist.bin";
					//Статус=Сервер.УстановитьФайлЧерногоСписка(ПутьКФайлуЧС);
					//Если Статус<>"" Тогда
					//	Предупреждение(
					//		"Ошибка при проверке подлинности ключей: " + Статус + "
					//		|Обмен данными возможен только в Демо-режиме с одним КПК.");
					//КонецЕсли;
					ОбновитьИнформациюПоКлючамДляСервера();
					
					ИспользоватьСерверМобиС=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ИспользоватьСерверМобиС");
					Если ИспользоватьСерверМобиС=Истина Тогда
						ЭлементыФормы.ПанельОблако.Видимость=Истина;
						ЭтаФорма.ПодключитьОбработчикОжидания("ОбновитьСтатусУчетнойСистемы",60*60,Ложь);
						//ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьСвязьССервером",60,Ложь);
						Если ПерезапускСервераМинут > 0 Тогда
							ПодключитьОбработчикОжидания("ПерезапускСервера",ПерезапускСервераМинут * 60, Истина);
						КонецЕсли;
						ОбновитьСтатусУчетнойСистемы();
						КодУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "КодУчетнойСистемы");
						ПарольУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ПарольУчетнойСистемы");
						Сервер.СоединениеСОблаком(КодУчетнойСистемы, ПарольУчетнойСистемы, ИмяКомпьютера()+"-"+ИмяПользователя(), "WebSocket");
					Иначе
						ВывестиСтатусОблачногоСервера("Облачный сервер не подключен");
					КонецЕсли;
					
					//поставить блокировку
					ФайлБлокировки = Новый ЗаписьТекста(ПутьКФайлБлокировки, КодировкаТекста.ANSI,,Истина);
					ФайлБлокировки.ЗаписатьСтроку(Порт);
				КонецЕсли;
			КонецЕсли;
			ДобавитьВЛогФайл("",Сервер.ПолучитьСтатусСервера(),1);
			
		КонецЕсли;
		
		Если АвтономныйРежим Тогда
			ЭлементыФормы.НадписьИнфо1.Заголовок=
				"Программа работает в автономном режиме. Функционал обработки, кроме обмена с КПК, доступен в полном объеме";
			ЭлементыФормы.НадписьИнфо1.ЦветТекста= WebЦвета.Зеленый;
			ЭлементыФормы.НадписьИнфо1.ЦветФона  = WebЦвета.Золотой;

			ЭлементыФормы.НадписьОшибка.Заголовок=""+ТекстОшибки;
		ИначеЕсли Не РежимРабочееМесто Тогда
			ПробросПорта=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ПробросПортаUPnP");
			//сравнение = Истина необходимо, тк если настройка ПробросПорта не задана, то
			//ПрочитатьИзРегистраСохраненныеНастройки возвращает Неопределено
			Если ПробросПорта = Истина Тогда
				АдресСервераПробросаПорта=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "АдресСервераПробросаПорта");
				Статус=Сервер.ПроброситьПорт(АдресСервераПробросаПорта);
				Если Статус<>"" Тогда
					Предупреждение(Статус);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементыФормы.НадписьПорт.Заголовок=Строка(Порт);
		ЭлементыФормы.НадписьВерсияДистирибутива.Заголовок=ВерсияДистрибутива;

		ТаблАгентов=ПолучитьТаблицуАгентов();
		Для Каждого Стр Из ТаблАгентов Цикл
			ЗадатьПапкиНаСервере(Стр.Код);
		КонецЦикла;
	КонецЕсли;
	
	ЭлементыФормы.КоманднаяПанель1.Кнопки.Сервис.Кнопки.ОбновитьСтруктуруВнешнейБД.Доступность = РежимОтладки;
	
	ДобавитьВАктивныеОбработки();
КонецПроцедуры

// Выполняет обновление данных при переходе на новую версию обработки
Процедура ПроверитьВерсиюОбработки()
	НомерВерсии = ПолучитьНастройку(МобиС, "НомерВерсии", 0);
	ТекВерсия = Число(СтрЗаменить(ВерсияОбработки, ".", "")); //уберем точки из номера версии
	Если НомерВерсии < 461 Тогда //Нужно перенести Координаты 
		Сообщить("Переход на версию 4.6.1...");
		//маршруты агентов
		Сообщить("Преобразуем маршруты агентов...");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СохраненныеНастройки.Пользователь,
		|	СохраненныеНастройки.ИмяОбъекта,
		|	СохраненныеНастройки.НаименованиеНастройки,
		|	СохраненныеНастройки.СохраненнаяНастройка
		|ИЗ
		|	РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
		|ГДЕ
		|	СохраненныеНастройки.НаименованиеНастройки ПОДОБНО ""%Маршрут.%""";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		     КонтрагентыМаршрута = ПрочитатьИзРегистраСохраненныеНастройки(Выборка.Пользователь, Выборка.НаименованиеНастройки); //это Табл значений
			 Если ТипЗнЧ(КонтрагентыМаршрута) <> Тип(Новый ТаблицаЗначений) Тогда
				 КонтрагентыМаршрута = Новый ТаблицаЗначений;
			 КонецЕсли; 
			 ЕстьКолонкаКлиент = (КонтрагентыМаршрута.Колонки.Найти("Клиент") <> Неопределено);
				 
			 Если КонтрагентыМаршрута.Колонки.Найти("Контрагент") = Неопределено Тогда
				 КонтрагентыМаршрута.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
			 КонецЕсли; 	 
			 Если КонтрагентыМаршрута.Колонки.Найти("Код") = Неопределено Тогда
				 КонтрагентыМаршрута.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
			 КонецЕсли; 	 
			 Если КонтрагентыМаршрута.Колонки.Найти("Наименование") = Неопределено Тогда
				 КонтрагентыМаршрута.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
			 КонецЕсли; 	 
			 Если КонтрагентыМаршрута.Колонки.Найти("Широта") = Неопределено Тогда
				 КонтрагентыМаршрута.Колонки.Добавить("Широта", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 8)));
			 КонецЕсли; 	 			 
			 Если КонтрагентыМаршрута.Колонки.Найти("Долгота") = Неопределено Тогда
				 КонтрагентыМаршрута.Колонки.Добавить("Долгота", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 8)));
			 КонецЕсли; 	 
			 Для каждого стрТЗ Из КонтрагентыМаршрута Цикл
				 Если НЕ ЗначениеЗаполнено(СтрТЗ.Код) Тогда  //когда код НЕ задан
					 Если НЕ ЗначениеЗаполнено(СтрТЗ.Контрагент) И ЕстьКолонкаКлиент Тогда //когда контрагент НЕ заполнен но есть колонка Клиент (старое название)
						 СтрТЗ.Контрагент = СтрТЗ.Клиент;  
					 КонецЕсли; 
					 СтрТЗ.Наименование = СтрТЗ.Контрагент.Наименование;
					 СтрТЗ.Код          = СтрТЗ.Контрагент.Код;
				 КонецЕсли; 
			 КонецЦикла; 
			 ЗаписатьВРегистрСохраненныеНастройки(Выборка.Пользователь, КонтрагентыМаршрута, Выборка.НаименованиеНастройки);
		КонецЦикла;
		Сообщить("Переход на версию 4.6.1 завершен.");
	КонецЕсли; 
	
	Если НомерВерсии < 500 Тогда 
		ТаблКоординаты = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "КоординатыКонтрагентов");
		Если ТаблКоординаты <> Неопределено Тогда
			Для Каждого Стр Из ТаблКоординаты Цикл
				Контрагент = Справочники.Контрагенты.НайтиПоКоду(Стр.Код);
				Если Контрагент.Пустая() Тогда Продолжить; КонецЕсли;
				УстановитьКоординатыКонтрагента(Контрагент, Стр.Широта, Стр.Долгота);
			КонецЦикла;
		КонецЕсли;
		Сообщить("Переход на версию 5.0 завершен.");
	КонецЕсли;

	Если НомерВерсии < 553 Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ Пользователь, СохраненнаяНастройка
		|ИЗ РегистрСведений.СохраненныеНастройки
		|ГДЕ НаименованиеНастройки = ""ПроводитьДокументы""";
		Запрос = Новый Запрос(ТекстЗапроса);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Пользователь) Тогда
				ПроводитьДокументы = ПолучитьНастройку(Выборка.Пользователь, "ПроводитьДокументы", Ложь);
				ЗаписатьВРегистрСохраненныеНастройки(Выборка.Пользователь,
					(ПроводитьДокументы И ПолучитьНастройку(Выборка.Пользователь, "РазрешитьПродажу", Истина)), "ПроводитьПродажа");
				ЗаписатьВРегистрСохраненныеНастройки(Выборка.Пользователь,
					(ПроводитьДокументы И ПолучитьНастройку(Выборка.Пользователь, "РазрешитьЗаявку", Истина)), "ПроводитьЗаказ");
				ЗаписатьВРегистрСохраненныеНастройки(Выборка.Пользователь,
					(ПроводитьДокументы И ПолучитьНастройку(Выборка.Пользователь, "РазрешитьПокупку", Истина)), "ПроводитьПокупка");
				ЗаписатьВРегистрСохраненныеНастройки(Выборка.Пользователь,
					(ПроводитьДокументы И ПолучитьНастройку(Выборка.Пользователь, "РазрешитьПКО", Истина)), "ПроводитьПКО");
				ЗаписатьВРегистрСохраненныеНастройки(Выборка.Пользователь,
					(ПроводитьДокументы И ПолучитьНастройку(Выборка.Пользователь, "РазрешитьИнвентаризацию", Истина)), "ПроводитьНаличиеИЦены");
			КонецЕсли;
		КонецЦикла;
		Сообщить("Переход на версию 5.5.3 завершен.");
	КонецЕсли;
	
	Если НомерВерсии < 5514 Тогда
		
		массивАгентов = ПолучитьТаблицуАгентов();
		поУмолчанию = Неопределено;
		Если Конфигурация = "БухКазахстан" Тогда
			поУмолчанию	= Справочники.КатегорииОбъектов.ПустаяСсылка();
		Иначе
			поУмолчанию	= ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
		КонецЕсли;	
		флаг = Ложь;
		
		Для каждого стрАгент из массивАгентов Цикл			
			флаг = ЗначениеЗаполнено(ПолучитьНастройку(стрАгент.Агент,"ВыбКатИзмЦен", поУмолчанию));			
			ЗаписатьВРегистрСохраненныеНастройки(
				стрАгент.Агент, флаг, "РедактироватьЦену");
			ЗаписатьВРегистрСохраненныеНастройки(
				стрАгент.Агент, флаг, "ВыбиратьТипЦены");
			ЗаписатьВРегистрСохраненныеНастройки(
				стрАгент.Агент, флаг, "ВыбиратьТипСкидки");						
		КонецЦикла;
		
		Сообщить("Переход на версию 5.5.14 завершен.");
	КонецЕсли;	
	
	Если ТекВерсия > НомерВерсии Тогда
   		ЗаписатьВРегистрСохраненныеНастройки(МобиС, ТекВерсия, "НомерВерсии");
	КонецЕсли;
	
	Если ТекВерсия<>НомерВерсии Тогда
		ИспользоватьВстроенныеМакетыКарт = Истина;
   		ЗаписатьВРегистрСохраненныеНастройки(МобиС,ИспользоватьВстроенныеМакетыКарт,"ИспользоватьВстроенныеМакетыКарт");
	Иначе
		ИспользоватьВстроенныеМакетыКарт = ПолучитьНастройку(МобиС, "ИспользоватьВстроенныеМакетыКарт", Истина);
	КонецЕсли
	
КонецПроцедуры
 
// Обработчик закрытия формы
Процедура ПриЗакрытии()
	текстСообщения = "Завершение работы:";
	Если НЕ АвтономныйРежим И НЕ РежимРабочееМесто Тогда		
		текстСообщения = текстСообщения + " порт - " + ЦелоеВСтроку(Порт) + ";";
		Если Сервер<>Неопределено Тогда
			ДобавитьВЛогФайл("Входящий трафик (" + ЦелоеВСтроку(Порт) + "): "+Окр(Сервер.ВходящийТрафик()/1024,0)+" Кбайт");
			ДобавитьВЛогФайл("Исходящий трафик (" + ЦелоеВСтроку(Порт) + "): "+Окр(Сервер.ИсходящийТрафик()/1024,0)+" Кбайт");
			Сервер.Завершить();
			АдресСервераПробросаПорта=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "АдресСервераПробросаПорта");
			Если ЗначениеЗаполнено(АдресСервераПробросаПорта) Тогда
				Сервер.ОтменитьПробросПорта();
			КонецЕсли;
			Сервер="";
		КонецЕсли; 
	КонецЕсли;
	ДобавитьВЛогФайл(текстСообщения + " обработка - " + ПолучитьРасположениеОбработки() + РазделительСтрок);
	
	УдалитьИзАктивныеОбработки();
КонецПроцедуры

// Вызывается перед закрытием формы
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если НЕ АвтономныйРежим И НЕ РежимРабочееМесто Тогда
		Если Вопрос("Если Вы закроете эту обработку, то прервётся связь с КПК. Закрыть обработку?", РежимДиалогаВопрос.ДаНет)
			= КодВозвратаДиалога.Нет  Тогда
			Отказ = Истина;
			СтандартнаяОбработка =ЛОЖЬ;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// Считывает глобальные настройки обработки обмена
Процедура ПрочитатьПараметрыПрограммы()
	
	РасстояниеОтКонтрагента     = ПолучитьНастройку(МобиС, "РасстояниеОтКонтрагента", 200);
	ВремяПребыванияУКонтрагента = ПолучитьНастройку(МобиС, "ВремяПребыванияУКонтрагента", 120);
	СпособОрганизацииТТ     	= ПолучитьНастройку(МобиС, "СпособОрганизацииТТ", 0);    //как обычно
	СоответствиеКонтрагента		= ПолучитьНастройку(МобиС, "СоответствиеКонтрагента", 0);    //покупатель
		
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ТехПоддержкаКонтактноеЛицо = ПолучитьНастройку(МобиС, "ТехПоддержкаКонтактноеЛицо", "");  
	Если НЕ ЗначениеЗаполнено(ТехПоддержкаКонтактноеЛицо) Тогда
	     ТехПоддержкаКонтактноеЛицо = "" + ТекПользователь;
		 ЗаписатьВРегистрСохраненныеНастройки(МобиС, ТехПоддержкаКонтактноеЛицо, "ТехПоддержкаКонтактноеЛицо");	
	КонецЕсли; 
	
	ТехПоддержкаОрганизация = ПолучитьНастройку(МобиС, "ТехПоддержкаОрганизация", "");  
	Если НЕ ЗначениеЗаполнено(ТехПоддержкаОрганизация) Тогда
		ОсновнаяОрганизация = ПолучитьНастройкуПользователя(ТекПользователь, ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация, Справочники.Организации.ПустаяСсылка());
		ТехПоддержкаОрганизация = "" + ОсновнаяОрганизация;
		ЗаписатьВРегистрСохраненныеНастройки(МобиС, ТехПоддержкаОрганизация, "ТехПоддержкаОрганизация");	
	КонецЕсли; 
	
	ТехПоддержкаПочта					= ПолучитьНастройку(МобиС,"ТехПоддержкаПочта","");  
	ТехПоддержкаТелефон					= ПолучитьНастройку(МобиС,"ТехПоддержкаТелефон","");  
	ТехПоддержкаЛогинНаСайте			= ПолучитьНастройку(МобиС,"ТехПоддержкаЛогинНаСайте","");  
	ТехПоддержкаАвтоматическаяОтправка	= ПолучитьНастройку(МобиС,"ТехПоддержкаАвтоматическаяОтправка", Истина);  
	ТехПоддержкаДобавитьЛог				= ПолучитьНастройку(МобиС,"ТехПоддержкаДобавитьЛог", Истина);  
	ТехПоддержкаКонфигурацияИзменена	= ПолучитьНастройку(МобиС,"ТехПоддержкаКонфигурацияИзменена", Ложь);  
	ТехПоддержкаМодульИнтеграцииИзменен	= ПолучитьНастройку(МобиС,"ТехПоддержкаМодульИнтеграцииИзменен", Ложь);  
		
	//Координаты контрагентов
	Если Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Географическая широта").Пустая() Тогда
		НовЭлем = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовЭлем.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		НовЭлем.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты;
		НовЭлем.Наименование = "Географическая широта";
		НовЭлем.Записать();
	КонецЕсли;
	Если Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Географическая долгота").Пустая() Тогда
		НовЭлем = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовЭлем.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		НовЭлем.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты;
		НовЭлем.Наименование = "Географическая долгота";
		НовЭлем.Записать();
	КонецЕсли;
	ТаблТекущиеКоординаты = ПрочитатьКоординатыАгентов(Истина);
	
	//прочитаем адреса для торговых точек
	ТаблЗнач = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "АдресаДляТТ"); //это Табл значений
	Если ТипЗнч(ТаблЗнач) = Тип("ТаблицаЗначений") Тогда
		АдресаДляТТ.Загрузить(ТаблЗнач);
	КонецЕсли; 

КонецПроцедуры

// Обработчик обновления отображения формы
Процедура ОбновлениеОтображения()
	// Если нет агентов, то вкладку с агентам Запретить
	ЕстьАгент = (ТекущийАгент <> Неопределено) И ЗначениеЗаполнено(ТекущийАгент.ФизЛицо);
	
	ЭлементыФормы.НадписьКаталогЛогов.Заголовок 	= ПолучитьКаталог("Logs");
	ЭлементыФормы.НадписьКаталогОбновлений.Заголовок= ПолучитьКаталог("Updates");
	ЭлементыФормы.НадписьКаталогАгентов.Заголовок	= ПолучитьКаталог("Agents");
	ДанныеОСервере = "";
	Если Сервер <> Неопределено Тогда
		ДанныеОСервере="Дата сборки: "+Сервер.ПолучитьДатуСборки()+". Путь: "+Сервер.ПолучитьПутьМодуля();
	КонецЕсли;
	ЭлементыФормы.НадписьКаталогPocketServer.Заголовок = ДанныеОСервере;
КонецПроцедуры

// Обрабатывает нажатие на надпись "Каталог pocketserver"
Процедура НадписьКаталогPocketServerНажатие(Элемент)
	Путь = СтрЗаменить(Элемент.Заголовок, "Путь: ", РазделительСтрок);
	Если СтрЧислоСтрок(Путь) <> 2 Тогда Возврат; КонецЕсли;
	Путь = СтрПолучитьСтроку(Путь,2);
	Файл = Новый Файл(Путь);
	Путь = Файл.Путь;
	
	ОтветНаВопрос = Вопрос("Если вы будете обновлять " + СервернаяКомпонента + ", то нужно закрыть 1С. Закрыть ее сейчас?", РежимДиалогаВопрос.ДаНет);
	ЗапуститьПриложение(Путь);
    Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы(Истина);
	КонецЕсли; 
КонецПроцедуры

// Отправляет по e-mail-у сообщение в техподдержку компании Моби-С
// Параметры:
// 		ТекстОшибки - Строка, содержит описание ошибки
// Возвращаемое значение:
// 		Истина всегда
Функция ОтправитьОшибкуВТехподдержку(Агент, ТекстОшибки)
	//в качестве темы используем е-mail или текущего пользователя
	СисИнфо = Новый СистемнаяИнформация;
	Тема= "1C" + Лев(СисИнфо.ВерсияПриложения, 3) + ": (" + ВерсияПротокола + ") " + ТехПоддержкаПочта;
	
	текДата = ТекущаяДата();
	ТехПоддержкаСообщение = ЗаголовокПисьма(Агент, текДата, Формат(текДата, "ДФ=HH:mm:ss"), ТекстОшибки);
	//сообщение отправляется в HTML, поэтому заменяем все переходы на новую строку на тег <br/>
	ТехПоддержкаСообщение = СтрЗаменить(ТехПоддержкаСообщение,РазделительСтрок,"<br/>");
	ТехПоддержкаСообщение = СтрЗаменить(ТехПоддержкаСообщение,Символы.ПС,"<br/>");
	
	//добавляем к сообщению лог файл
	Файлы = ЛогФайлыПоУмолчанию(Агент, текДата);
	
	СоздатьСообщениеВТехподдержку(Тема, ТехПоддержкаСообщение, Файлы);
	Письмо = КаталогЛогФайлов + "\email.xml";
	ФайлПисьмо = Новый Файл(Письмо);
	
	ПроверитьEmailer();
	
	Если ФайлПисьмо.Существует() Тогда
		Почтальон = КаталогЛогФайлов + "\Emailer.exe";
	    ФайлПочтальон = Новый Файл(Почтальон);
		файлЛогОтправки = ПолучитьИмяВременногоФайла();		
		Если ФайлПочтальон.Существует() =1  Тогда 	
			Рез = 0;
			Пер = """" + Почтальон + """ """ + Письмо + """ """ + файлЛогОтправки + """";
			Попытка
				ЗапуститьПриложение(Пер, , Истина);
				файлРезультат = новый ЧтениеТекста(файлЛогОтправки);
				результатОтправки = файлРезультат.Прочитать();
				файлРезультат.Закрыть();				
				УдалитьФайлы(файлЛогОтправки);
				УдалитьФайлы(Письмо);
				Если результатОтправки = "Сообщение отправлено." Тогда
					Сообщить(
					"Сообщение отправлено.");
				Иначе
					Если результатОтправки = "Couldn't connect to server" Тогда
						результатОтправки = "Невозможно соединиться с почтовым сервером"
					ИначеЕсли результатОтправки = "Failed sending data to the peer" Тогда
						результатОтправки = "Ошибка отправки данных на почтовый сервер"
					ИначеЕсли результатОтправки = "Couldn't resolve host name" Тогда
						результатОтправки = "Не найден почтовый сервер, возможно отсутствует доступ в Интернет"
					КонецЕсли;					
					Сообщить("Ошибка отправки:" + Символы.ПС + результатОтправки);
					ДобавитьВЛогФайл("Ошибка отправки сообщения в техподдержку:" + Символы.ПС + результатОтправки);						
				КонецЕсли;
			Исключение
				стр = ОписаниеОшибки();
				Сообщить(стр);
				ДобавитьВЛогФайл(стр);
			КонецПопытки;                            			
		КонецЕсли;		
	КонецЕсли;	
	Возврат Истина;
КонецФункции	

// Вызывается при нажатии на панели "1" кнопки "Открыть справку"
Процедура КоманднаяПанель1ОткрытьСправку(Кнопка)
	ОткрытьСправкуМобиС("MI8_HOME"); 
КонецПроцедуры

// Отправляет на КПК настройки колонок документов в соответствии с протоколом обмена
// Параметры:
// 		Адрес - Строка, адрес КПК
// Возвращаемое значение:
// 		Истина - успех
// 		Ложь - ошибка
Функция ВыгрузитьНастройкиКолонокДокументов(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"DocColumns","Выгружаются настройки колонок документов...") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ответ = "";
	Табл=ПолучитьНастройкиКолонокДокументов();
	Для Каждого Стр Из Табл Цикл
		Ответ=Ответ
			+ ЦелоеВСтроку(Стр.Документ)+Таб
			+ ЦелоеВСтроку(Стр.Ячейка)+Таб
			+ УбратьСпецСимволы(Стр.Заголовок)+Таб
			+ УбратьСпецСимволы(Стр.Значение)+Таб
			+ ЦелоеВСтроку(Стр.Цвет)+РазделительСтрок;
	КонецЦикла;
		
	Возврат ПорцияОбмена(
		Адрес,
		Ответ,
		"Настройки колонок документов выгружены "+Табл.Количество()+" записей",
		"Ошибка выгрузки настроек колонок документов");
КонецФункции

Функция ПолучитьНумератор1(Агент, ВидДокумента1С, ВидДокументаМобиС)
	Нумератор = 
		"SELECT '" 
			+ Прав("0000"+СокрЛП(Агент.ФизЛицо.Код),4) + "'" 
			+ "||strftime('%m',date('now','localtime'))"
			+ "||strftime('%d',date('now','localtime'))"
			+ "||SUBSTR('00000000000'||"+ВидДокументаМобиС+".ID,-3)";
	Нумератор = Нумератор 
		+ " FROM " + ВидДокументаМобиС + " WHERE ID=?";	
	Возврат Нумератор;
КонецФункции

Функция ПолучитьНумератор2(Агент, ВидДокумента1С, ВидДокументаМобиС)
	Нумератор="SELECT CASE Firms.Prefix ";
	ВыборкаОрг=Справочники.Организации.Выбрать();
	Пока ВыборкаОрг.Следующий() Цикл
		ДлинаПрефиксаФирмы=СтрДлина(СокрЛП(ВыборкаОрг.Префикс));
		ДлинаНачалаКода=0; ДлинаНомера=0; ДлинаКодаАгента=0;
		Если ДлинаПрефиксаФирмы=3 Тогда
			ДлинаНачалаКода=7;
			ДлинаКодаАгента=3;
			ДлинаНомера=4;
		ИначеЕсли ДлинаПрефиксаФирмы=2 Тогда
			ДлинаНачалаКода=7;
			ДлинаКодаАгента=4;
			ДлинаНомера=4;
		ИначеЕсли ДлинаПрефиксаФирмы=1 Тогда
			ДлинаНачалаКода=6;
			ДлинаКодаАгента=4;
			ДлинаНомера=5;
		ИначеЕсли ДлинаПрефиксаФирмы=0 Тогда
			ДлинаНачалаКода=6;
			ДлинаКодаАгента=5;
			ДлинаНомера=5;
		Иначе
			Сообщить("Префикс организации "+ВыборкаОрг.Наименование+" превышает 3 символа");
			Продолжить;
		КонецЕсли;
		
		НачалоКода=СокрЛП(ВыборкаОрг.Префикс)+"_"+Прав("00000000000"+СокрЛП(Агент.ФизЛицо.Код),ДлинаКодаАгента);
		Запрос=Новый Запрос;
		Запрос.Текст="
			|ВЫБРАТЬ МАКСИМУМ(Док.Номер) КАК МаксНомер
			|ИЗ Документ."+ВидДокумента1С+" КАК Док
			|ГДЕ ПОДСТРОКА(Док.Номер,1,"+ДлинаНачалаКода+")=&НачалоКода";
		Запрос.Параметры.Вставить("НачалоКода",НачалоКода);
		Выборка=Запрос.Выполнить().Выбрать();
		МаксНомер="00000000000";
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.МаксНомер) Тогда
				МаксНомер=Выборка.МаксНомер;
			КонецЕсли;
		КонецЕсли;
		МаксНомер=Число(Прав(МаксНомер,ДлинаНомера));
		
		Нумератор = Нумератор 
			+ " WHEN '"+СокрЛП(ВыборкаОрг.Префикс) 
			+ "' THEN '"
			+ НачалоКода+"'||SUBSTR('00000000000'||("+ВидДокументаМобиС+".ID+"+ЦелоеВСтроку(МаксНомер)+"),-"+Строка(ДлинаНомера)+")";
	КонецЦикла;
	Нумератор = Нумератор
		+ "END FROM " + ВидДокументаМобиС 
		+ " INNER JOIN Firms ON Firms.ID="+ВидДокументаМобиС+".Firm WHERE "+ВидДокументаМобиС+".ID=?";	
	Возврат Нумератор;
КонецФункции

Функция ПолучитьНачальныйНомер(Агент, ВидДокумента1С)
	ТекДата=НачалоДня(ТекущаяДата());
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ Свойства.Значение КАК УникКод ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка ИЗ Документ." + ВидДокумента1С + " ГДЕ Дата >= &ТекДата) КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Свойства ПО (Свойства.Объект = Док.Ссылка) ГДЕ
	|			Свойства.Свойство = &УникКодДокумента 
	|			И Док.Ссылка.Ответственный = &Агент";
	Запрос.Параметры.Вставить("УникКодДокумента", ПВХУникКодДокумента);
	Запрос.Параметры.Вставить("ТекДата",ТекДата);
	Запрос.Параметры.Вставить("Агент",Агент);
	Выборка=Запрос.Выполнить().Выбрать();
	НачНомер=1;
	
	СтрТекДата=Формат(ТекДата,"ДФ=dd.MM.yyyy");
	Пока Выборка.Следующий() Цикл
		Попытка
			УникКод=Выборка.УникКод;
			Если Не ЗначениеЗаполнено(УникКод) Тогда Продолжить; КонецЕсли;
			Если Найти(УникКод,СтрТекДата)=0 Тогда Продолжить; КонецЕсли;;
			Части=СтрЗаменить(УникКод,"_",РазделительСтрок);
			Если СтрЧислоСтрок(Части)<2 Тогда Продолжить; КонецЕсли;
			УникКод=СтрПолучитьСтроку(Части,2);
			Части=СтрЗаменить(УникКод," ",РазделительСтрок);
			Если СтрЧислоСтрок(Части)<2 Тогда Продолжить; КонецЕсли;
			ТекНомер=Число(СтрПолучитьСтроку(Части,1));
			Если ТекНомер<=0 Тогда Продолжить; КонецЕсли;
			НачНомер=Макс(НачНомер,ТекНомер+1);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат ЦелоеВСтроку(НачНомер);
КонецФункции

// Отправляет на КПК настройки агента в соответствии с протоколом обмена
// Параметры:
// 		Адрес - Строка, адрес КПК
// Возвращаемое значение:
// 		Истина - успех
// 		Ложь - ошибка
Функция ВыгрузитьНастройкиАгента(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"Settings","Выгружаются настройки агента...") Тогда
		Возврат Ложь;
	КонецЕсли;
	Ответ = "";
	
	ДатаВремяGPS = ПолучитьНастройку(ПараметрыАгента.Агент,"ДатаВремяGPS",3);

	Ответ = "ИспользоватьДокументПродажа" + Таб 
			+ ?(ПараметрыАгента.РазрешитьПродажу, "1", "0")+РазделительСтрок
		+ "ЗапретитьРаботуБезGPS" + Таб 
			+ ?(ПараметрыАгента.ЗапретитьРаботуБезGPS, "1", "0") + РазделительСтрок
		+ "ИспользоватьДокументЗаявка" + Таб 
			+ ?(ПараметрыАгента.РазрешитьЗаявку,"1","0") + РазделительСтрок
		+ "ИспользоватьДокументПКО" + Таб 
			+ ?(ПараметрыАгента.РазрешитьПКО, "1", "0") + РазделительСтрок
		+ "ИспользоватьДокументПокупка" + Таб 
			+ ?(ПараметрыАгента.РазрешитьПокупку, "1", "0") + РазделительСтрок
		+ "ИспользоватьДокументИнвентаризация" + Таб 
			+ ?(ПараметрыАгента.РазрешитьИнвентаризацию, "1", "0") + РазделительСтрок
		+ "РазрешитьСниматьКоординатыКлиентов" + Таб 
			+ ?(ПараметрыАгента.РазрешитьСниматьКоординатыКлиентов, "1", "0") + РазделительСтрок
		+ "РазрешитьДобавлениеКлиентов" + Таб 
			+ ?(ПараметрыАгента.РазрешитьДобавлениеКлиентов, "1", "0") + РазделительСтрок
		+ "ИспользоватьСправочникТовары" + Таб 
			+ ?(ПараметрыАгента.ИспользоватьСправочникТовары, "1", "0") + РазделительСтрок
		+ "ИспользоватьМерчендайзинг" + Таб 
			+ ?(ПараметрыАгента.СоздаватьЗадания, "1", "0") + РазделительСтрок
		+ "РазрешитьДокументыДляНовыхКлиентов" + Таб 
			+ ?(ПараметрыАгента.РазрешитьДокументыДляНовыхКлиентов, "1", "0") + РазделительСтрок
    	+ "КонтролироватьСборОстатков" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСборОстатков, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеДокументаПродажа" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеДокументаПродажа, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеДокументаЗаказ" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеДокументаПродажа, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеДокументаПокупка" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеДокументаПокупка, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеДокументаПКО" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеДокументаПКО, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеДокументаАнкета" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеДокументаАнкета, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеДокументаИнвентаризация" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеДокументаИнвентаризация, "1", "0") + РазделительСтрок
		+ "КонтролироватьСозданиеФотографий" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьСозданиеФотографий, "1", "0") + РазделительСтрок
		+ "КонтролироватьМестоВыполненияЗаданий" + Таб 
			+ ?(ПараметрыАгента.КонтролироватьМестоВыполненияЗаданий, "1", "0") + РазделительСтрок
		+ "РазрешитьРедактированиеДокументов" + Таб 
			+ ?(ПараметрыАгента.РазрешитьРедактированиеДокументов, "1", "0") + РазделительСтрок
		+ "ЗапретитьНарушатьПорядокВыполненияЗаданий" + Таб 
			+ ?(ПараметрыАгента.ЗапретитьНарушатьПорядокВыполненияЗаданий, "1", "0") + РазделительСтрок
		+ "ЗапретитьПечатьНеВыгруженныхДокументов" + Таб 
			+ ?(ПараметрыАгента.ЗапретитьПечатьНеВыгруженныхДокументов, "1", "0") + РазделительСтрок
		+ "ФормаПоУмолчанию" + Таб
			+ "" + РазделительСтрок
		+ "ОтображатьОстатокКакВ1С" + Таб 
			+ ?(ПараметрыАгента.СпособОтображенияОстатка, "1", "0") + РазделительСтрок
		+ "ТорговляСКолес" + Таб 
			+ ?(ПараметрыАгента.ТорговляСКолес, "1", "0") + РазделительСтрок
    	+ "ОбязательнаяПолнаяЗагрузка" + Таб 
			+ ?(ПараметрыАгента.ОбязательнаяПолнаяЗагрузка, "1", "0") + РазделительСтрок
    	+ "ПарольНастроек" + Таб 
			+ УбратьСпецСимволы(ПараметрыАгента.ПарольНастроек) + РазделительСтрок
		+ "ИгнорироватьДатуGPSПриемника" + Таб 
			+ ?(ДатаВремяGPS = 3 ИЛИ ДатаВремяGPS = 2, "0", "1") + РазделительСтрок
		+ "ИгнорироватьВремяGPSПриемника" + Таб 
			+ ?(ДатаВремяGPS = 3 ИЛИ ДатаВремяGPS = 1, "0", "1") + РазделительСтрок

		+ "НаименованиеДокументаПродажа" + Таб 
			+ УбратьСпецСимволы(ПараметрыАгента.НаименованиеДокументаПродажа) + РазделительСтрок
    	+ "НаименованиеДокументаЗаказ" + Таб 
			+ УбратьСпецСимволы(ПараметрыАгента.НаименованиеДокументаЗаказ) + РазделительСтрок
    	+ "НаименованиеДокументаПокупка" + Таб 
			+ УбратьСпецСимволы(ПараметрыАгента.НаименованиеДокументаПокупка) + РазделительСтрок
    	+ "НаименованиеДокументаИнвентаризация" + Таб 
			+ УбратьСпецСимволы(ПараметрыАгента.НаименованиеДокументаИнвентаризация) + РазделительСтрок
			
		+ "ВыгружатьФотоВместеСДокументами" + Таб 
			+ ?(ПараметрыАгента.ВыгружатьФотоВместеСДокументами, "1", "0") + РазделительСтрок
    	+ "ВыгружатьДокументыПередЗагрузкойДанных" + Таб 
			+ ?(ПараметрыАгента.ВыгружатьДокументыПередЗагрузкойДанных, "1", "0") + РазделительСтрок
    	+ "ЗапретитьВыбиратьКрасныхКлиентов" + Таб 
			+ ?(ПараметрыАгента.ЗапретитьВыбиратьКрасныхКлиентов, "1", "0") + РазделительСтрок;
	
	Счетчик = СтрЧислоСтрок(Ответ); 
	
	СпособНумерации = ПараметрыАгента.СпособНумерацииДокументов;
	Если (СпособНумерации = 0) Или (СпособНумерации = 1) Тогда
		Если ПараметрыАгента.РазрешитьПродажу Тогда
			ВидДок = "РеализацияТоваровУслуг";
			Если ПараметрыАгента.ТипСоздаваемогоДокумента = 1 Тогда
				ВидДок = "АктОбОказанииПроизводственныхУслуг";
			КонецЕсли;
			Ответ = Ответ
			+ "НачНомер_Invoice" + Таб
			+ ПолучитьНачальныйНомер(ПараметрыАгента.Агент, ВидДок) + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьЗаявку Тогда
			ВидДок = "СчетНаОплатуПокупателю";
			Ответ = Ответ
			+ "НачНомер_Request" + Таб
			+ ПолучитьНачальныйНомер(ПараметрыАгента.Агент, ВидДок) + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьПокупку Тогда
			ВидДок = "ВозвратТоваровОтПокупателя";
			Если ПараметрыАгента.ТипСоздаваемогоДокументаПокупка = 1 Тогда
				ВидДок = "ПоступлениеТоваровУслуг";
			КонецЕсли;
			Ответ = Ответ
			+ "НачНомер_ReceiptInvoice" + Таб
			+ ПолучитьНачальныйНомер(ПараметрыАгента.Агент, ВидДок) + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьПКО Тогда
			ВидДок = "ПриходныйКассовыйОрдер";
			Ответ = Ответ
			+ "НачНомер_PKO" + Таб
			+ ПолучитьНачальныйНомер(ПараметрыАгента.Агент, ВидДок) + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьИнвентаризацию Тогда
			ВидДок = "ИнвентаризацияТоваровНаСкладе";
			Если ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация = 1 Тогда
				ВидДок = "ПеремещениеТоваров";
			КонецЕсли;
			Ответ = Ответ
			+ "НачНомер_Inventory" + Таб
			+ ПолучитьНачальныйНомер(ПараметрыАгента.Агент, ВидДок) + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЕсли;
	Если СпособНумерации = 1 Тогда
		Если ПараметрыАгента.РазрешитьПродажу Тогда
			ВидДок = "РеализацияТоваровУслуг";
			Если ПараметрыАгента.ТипСоздаваемогоДокумента = 1 Тогда
				ВидДок = "АктОбОказанииПроизводственныхУслуг";
			КонецЕсли;
			Ответ = Ответ
			+ "Нумератор_Invoice" + Таб
			+ ПолучитьНумератор1(ПараметрыАгента.Агент, ВидДок, "Invoices") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьЗаявку Тогда
			ВидДок = "СчетНаОплатуПокупателю";
			Ответ = Ответ
			+ "Нумератор_Request" + Таб
			+ ПолучитьНумератор1(ПараметрыАгента.Агент, ВидДок, "Orders") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьПокупку Тогда
			ВидДок = "ВозвратТоваровОтПокупателя";
			Если ПараметрыАгента.ТипСоздаваемогоДокументаПокупка = 1 Тогда
				ВидДок = "ПоступлениеТоваровУслуг";
			КонецЕсли;
			Ответ = Ответ 
			+ "Нумератор_ReceiptInvoice" + Таб 
			+ ПолучитьНумератор1(ПараметрыАгента.Агент, ВидДок, "ReceiptInvoices") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьПКО Тогда
			ВидДок = "ПриходныйКассовыйОрдер";
			Ответ = Ответ
			+ "Нумератор_PKO" + Таб
			+ ПолучитьНумератор1(ПараметрыАгента.Агент, ВидДок, "PKOs") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьИнвентаризацию Тогда
			ВидДок = "ИнвентаризацияТоваровНаСкладе";
			Если ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация = 1 Тогда
				ВидДок = "ПеремещениеТоваров";
			КонецЕсли;
			Ответ = Ответ
			+ "Нумератор_Inventory" + Таб
			+ ПолучитьНумератор1(ПараметрыАгента.Агент, ВидДок, "Inventories") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
	ИначеЕсли СпособНумерации = 2 Тогда
		Если ПараметрыАгента.РазрешитьПродажу Тогда
			ВидДок = "РеализацияТоваровУслуг";
			Если ПараметрыАгента.ТипСоздаваемогоДокумента = 1 Тогда
				ВидДок = "АктОбОказанииПроизводственныхУслуг";
			КонецЕсли;
			Ответ = Ответ
			+ "Нумератор_Invoice" + Таб
			+ ПолучитьНумератор2(ПараметрыАгента.Агент, ВидДок, "Invoices") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьЗаявку Тогда
			ВидДок = "СчетНаОплатуПокупателю";
			Ответ = Ответ
			+ "Нумератор_Request" + Таб
			+ ПолучитьНумератор2(ПараметрыАгента.Агент, ВидДок, "Orders") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьПокупку Тогда
			ВидДок = "ВозвратТоваровОтПокупателя";
			Если ПараметрыАгента.ТипСоздаваемогоДокументаПокупка = 1 Тогда
				ВидДок = "ПоступлениеТоваровУслуг";
			КонецЕсли;
			Ответ = Ответ 
			+ "Нумератор_ReceiptInvoice" + Таб 
			+ ПолучитьНумератор2(ПараметрыАгента.Агент, ВидДок, "ReceiptInvoices") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьПКО Тогда
			ВидДок = "ПриходныйКассовыйОрдер";
			Ответ = Ответ
			+ "Нумератор_PKO" + Таб
			+ ПолучитьНумератор2(ПараметрыАгента.Агент, ВидДок, "PKOs") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
		Если ПараметрыАгента.РазрешитьИнвентаризацию Тогда
			ВидДок = "ИнвентаризацияТоваровНаСкладе";
			Если ПараметрыАгента.ТипСоздаваемогоДокументаИнвентаризация = 1 Тогда
				ВидДок = "ПеремещениеТоваров";
			КонецЕсли;
			Ответ = Ответ
			+ "Нумератор_Inventory" + Таб
			+ ПолучитьНумератор2(ПараметрыАгента.Агент, ВидДок, "Inventories") + РазделительСтрок;
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЕсли;
	
	НачалоРабочегоДня = ПолучитьНастройку(ПараметрыАгента.Агент,"НачалоРабочегоДня",'00010101090000');
	КонецРабочегоДня = ПолучитьНастройку(ПараметрыАгента.Агент,"КонецРабочегоДня",'00010101180000');
    Ответ = Ответ+"НачалоРабочегоДня"+Таб+Формат(НачалоРабочегоДня,"ДФ=ЧЧ:мм")+РазделительСтрок;
	Счетчик = Счетчик + 1;
    Ответ = Ответ+"КонецРабочегоДня"+Таб+Формат(КонецРабочегоДня,"ДФ=ЧЧ:мм")+РазделительСтрок;
	Счетчик = Счетчик + 1;

	Если ПараметрыАгента.РазрешитьПродажу Тогда
		Ответ = Ответ + "СкладВТабличнойЧастиРеализации" + Таб + "0" + РазделительСтрок;
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ПараметрыАгента.РазрешитьЗаявку Тогда
		Ответ = Ответ + "СкладВТабличнойЧастиЗаказа" + Таб + "0" + РазделительСтрок;
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ПараметрыАгента.РазрешитьПокупку Тогда
		Ответ = Ответ + "СкладВТабличнойЧастиПокупки" + Таб + "0" + РазделительСтрок;
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Настройки агента выгружены "+Счетчик+" записей","Ошибка выгрузки настроек агента");
КонецФункции

// Загружает нового клиента, данные о котором введены в КПК
// Параметры:
// 		Адрес - Строка, адрес КПК
// 		ТеклоЗапроса - Строка, запрос, поступивший с КПК
// Возвращаемое значение:
// 		Истина - успех
// 		Ложь - ошибка
Функция ЗагрузитьНовыхКлиентов(Адрес, ТелоЗапроса)
	ДобавитьВЛогФайл("Загружаются новые клиенты...", ПараметрыАгента.Агент, 1);
	СерверПослатьОтвет(Адрес,"OK" + РазделительСтрок, 0);
	ТаблПользователей = ПрочитатьПользователейДляОповещения(ПараметрыАгента.Агент); //это Табл значений	
	
	ТаблШапок = Новый ТаблицаЗначений;
	ТаблШапок.Колонки.Добавить("Дата",				Новый ОписаниеТипов("Дата"));
	ТаблШапок.Колонки.Добавить("ИдДок",				Новый ОписаниеТипов("Число"));
    ТаблШапок.Колонки.Добавить("Наименование",		Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Грузополучатель",	Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ИНН",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("КПП",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ОКПО",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Вид",	    		Новый ОписаниеТипов("Число"));
	ТаблШапок.Колонки.Добавить("Покупатель",		Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Поставщик",			Новый ОписаниеТипов("Строка"));
    ТаблШапок.Колонки.Добавить("ФактическийАдрес",	Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ЮридическийАдрес",	Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ФИО",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Телефон",			Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Почта",				Новый ОписаниеТипов("Строка"));	
	ТаблШапок.Колонки.Добавить("Широта",			Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Долгота",			Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Форма",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Комментарий",		Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДатаСоздания",		Новый ОписаниеТипов("Дата")); //Дата и время создания документа
	ТаблШапок.Колонки.Добавить("ВремяРаботы",		Новый ОписаниеТипов("Число"));//время работы с документом в минутах
	ТаблШапок.Колонки.Добавить("РСчет",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("КорСчет",			Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("БИК",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Банк",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ГородБанка",		Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Время",				Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("ДопРеквизиты",		Новый ОписаниеТипов("Строка"));
	ТаблШапок.Колонки.Добавить("Фото",				Новый ОписаниеТипов("Строка"));
	
	ТаблКодов = Новый ТаблицаЗначений;
    ТаблКодов.Колонки.Добавить("КодВКПК",			Новый ОписаниеТипов("Строка"));
    ТаблКодов.Колонки.Добавить("КодВ1С",			Новый ОписаниеТипов("Строка"));
    ТаблКодов.Колонки.Добавить("Сообщение",			Новый ОписаниеТипов("Строка"));
 	Н = 5;
	КолСтр = СтрЧислоСтрок(ТелоЗапроса);
	Пока Н <= КолСтр Цикл
		ТекСтр=СтрПолучитьСтроку(ТелоЗапроса,Н);
		НомПарам = 1;
		НовСтр	 = ТаблШапок.Добавить();
		ИДДок    = "";
		Пока ТекСтр <> "" Цикл
			Парам   = "";
			ПозРазд = Найти(ТекСтр,Таб);
			Если ПозРазд<>0 Тогда
				Парам  = Лев(ТекСтр,ПозРазд-1);
				ТекСтр = Сред(ТекСтр,ПозРазд+1);
			Иначе
				Парам  = ТекСтр;
				ТекСтр = "";
			КонецЕсли;
	        Если НомПарам = 1 Тогда
				НовСтр.Время = Сред(Парам,12); 
				НовСтр.Дата  = ДатаИзСтрокиСКПК(Парам);
            ИначеЕсли НомПарам = 2 Тогда
				НовСтр.ИдДок = Парам;
	        ИначеЕсли НомПарам = 3 Тогда
				НовСтр.Наименование = Парам;
			ИначеЕсли НомПарам = 4 Тогда
				НовСтр.Грузополучатель = Парам;
			ИначеЕсли НомПарам = 5 Тогда
				НовСтр.ИНН = Парам; 
	        ИначеЕсли НомПарам = 6 Тогда
				НовСтр.КПП = Парам; 
	        ИначеЕсли НомПарам = 7 Тогда
				НовСтр.ОКПО = Парам; 
			ИначеЕсли НомПарам = 8 Тогда
				НовСтр.Вид = Парам; 
	        ИначеЕсли НомПарам = 9 Тогда
				НовСтр.Покупатель = Парам; 
	        ИначеЕсли НомПарам = 10 Тогда
				НовСтр.Поставщик = Парам; 
 			ИначеЕсли НомПарам = 11 Тогда
				НовСтр.ФактическийАдрес = Парам; 
	        ИначеЕсли НомПарам = 12 Тогда
				НовСтр.ЮридическийАдрес = Парам; 
	        ИначеЕсли НомПарам = 13 Тогда
				НовСтр.ФИО = Парам;
 			ИначеЕсли НомПарам = 14 Тогда
				НовСтр.Телефон = Парам; 
	        ИначеЕсли НомПарам = 15 Тогда
				НовСтр.Почта = Парам; 
	        ИначеЕсли НомПарам = 16 Тогда
				НовСтр.Широта = Парам; 
	        ИначеЕсли НомПарам = 17 Тогда
				НовСтр.Долгота = Парам;
 			ИначеЕсли НомПарам = 18 Тогда
				НовСтр.Форма = Парам; 
	        ИначеЕсли НомПарам = 19 Тогда
				НовСтр.Комментарий = Парам; 
	        ИначеЕсли НомПарам = 20 Тогда
				НовСтр.ДатаСоздания = ДатаИзСтрокиСКПК(Парам);
			ИначеЕсли НомПарам = 21 Тогда
				Попытка
					НовСтр.ВремяРаботы = Окр(Число(Парам) / 60, 0, РежимОкругления.Окр15как20);
				Исключение
				КонецПопытки;
			ИначеЕсли НомПарам = 22 Тогда
				НовСтр.РСчет = Парам
			ИначеЕсли НомПарам = 23 Тогда
				НовСтр.БИК = Парам
			ИначеЕсли НомПарам = 24 Тогда
				НовСтр.КорСчет = Парам
			ИначеЕсли НомПарам = 25 Тогда
				НовСтр.Банк = Парам
			ИначеЕсли НомПарам = 26 Тогда
				НовСтр.ГородБанка = Парам
			ИначеЕсли НомПарам = 27 Тогда
				НовСтр.ДопРеквизиты = Парам				
			ИначеЕсли НомПарам = 28 Тогда
				НовСтр.Фото = СтрЗаменить(Парам,Символ(31),РазделительСтрок);
			Иначе
				ДобавитьОшибку("Загрузка нового клиента "+ИдДок+".Неверный набор параметров.");
				Возврат Ложь;
			КонецЕсли;
			НомПарам = НомПарам + 1;
	    КонецЦикла;	
		Н = Н + 1;
	КонецЦикла;
    ДобавитьВЛогФайл("Формируются новые клиенты...", ПараметрыАгента.Агент, 1);
	глПоследняяОшибкаПроведения = "";	
	
    Для Каждого СтрШапки Из ТаблШапок Цикл
		//защита от повторной загрузки документа
		УникДок = СформироватьУникальныйКодДокумента("НовыйКлиент", СтрШапки);
		СсылкаДок = ЕстьДокумент(УникДок);
		Если СсылкаДок <> Неопределено Тогда
			НовСтр = ТаблКодов.Добавить();
			НовСтр.КодВКПК = СтрШапки.ИдДок;
			НовСтр.КодВ1С = СокрЛП(СсылкаДок.Код);
			НовСтр.Сообщение = "";
			//НовСтр.Сообщение = "Документ " + УникДок + " уже загружен ранее.";
			Продолжить;
		КонецЕсли;

		Если ТранзакцияАктивна() Тогда
			НовСтр = ТаблКодов.Добавить();
			НовСтр.КодВКПК =  СтрШапки.ИдДок;
			НовСтр.КодВ1С =  "";
			НовСтр.Сообщение = ОшибкаВыгрузкаСАктивнойТранзакцией;
		Иначе				
			Попытка
				НачатьТранзакцию();
				НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				НовыйКонтрагент.Наименование = СтрШапки.Наименование;
				НовыйКонтрагент.НаименованиеПолное = СтрШапки.Грузополучатель;
				НовыйКонтрагент.КодПоОКПО = СтрШапки.ОКПО;
				Если СтрШапки.Вид = 1 тогда
					НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
				Иначе
					НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
				КонецЕсли;
				Если Конфигурация = "БухКазахстан" Тогда		
					НовыйКонтрагент.ИдентификационныйКодЛичности = СтрШапки.ИНН;
					НовыйКонтрагент.РНН = СтрШапки.КПП;
					Почта = Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя;
				Иначе				
					НовыйКонтрагент.ИНН = СтрШапки.ИНН;
					НовыйКонтрагент.КПП = СтрШапки.КПП;
					Почта = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента;
				КонецЕсли;
				
				Покупатель = ?(СтрШапки.Покупатель = "1", Истина, Ложь);
	   			Поставщик = ?(СтрШапки.Поставщик = "1", Истина, Ложь);
				// Если Агенты забыли поставить флажки - новый контрагент будет покупателем
				Если (Не Покупатель) И (Не Поставщик) Тогда
					Покупатель = Истина;
				КонецЕсли;
				
	            НовыйКонтрагент.Комментарий = СтрШапки.Комментарий;
	            НовыйКонтрагент.Родитель = ПараметрыАгента.ГруппаДляНовыхКонтрагентов;
				
				НовыйКонтрагент.УстановитьНовыйКод();
				НовыйКонтрагент.Записать();
				//Фактический адрес
				НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей(); 
				НаборЗаписей.Прочитать(); 
				РегСведКонтактнаяИнформация = НаборЗаписей.Добавить();                     
				РегСведКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи(); 
				РегСведКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				РегСведКонтактнаяИнформация.Объект = НовыйКонтрагент.Ссылка;
				РегСведКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	            РегСведКонтактнаяИнформация.Поле2 = СтрШапки.ФактическийАдрес;
	            РегСведКонтактнаяИнформация.Представление = СтрШапки.ФактическийАдрес;
				РегСведКонтактнаяИнформация.Записать();
				//юридический адрес
				РегСведКонтактнаяИнформация = НаборЗаписей.Добавить();                     
				РегСведКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи(); 
				РегСведКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				РегСведКонтактнаяИнформация.Объект = НовыйКонтрагент.Ссылка;
				РегСведКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	            РегСведКонтактнаяИнформация.Поле2 = СтрШапки.ЮридическийАдрес;
	            РегСведКонтактнаяИнформация.Представление = СтрШапки.ЮридическийАдрес;
				РегСведКонтактнаяИнформация.Записать();
				//телефон
				РегСведКонтактнаяИнформация = НаборЗаписей.Добавить();                     
				РегСведКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи(); 
				РегСведКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				РегСведКонтактнаяИнформация.Объект = НовыйКонтрагент.Ссылка;
				РегСведКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	            РегСведКонтактнаяИнформация.Представление = СтрШапки.Телефон;
				РегСведКонтактнаяИнформация.Записать();
				//email
				РегСведКонтактнаяИнформация = НаборЗаписей.Добавить();                     
				РегСведКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи(); 
				РегСведКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				РегСведКонтактнаяИнформация.Объект = НовыйКонтрагент.Ссылка;
				РегСведКонтактнаяИнформация.Вид = Почта;
	            РегСведКонтактнаяИнформация.Представление = СтрШапки.Почта;
				РегСведКонтактнаяИнформация.Записать();
				//контактное лицо
				контактноеЛицоКонтрагента = Справочники.КонтактныеЛица.СоздатьЭлемент();
				контактноеЛицоКонтрагента.ОбъектВладелец = НовыйКонтрагент.Ссылка;
				контактноеЛицоКонтрагента.ВидКонтактногоЛица = ПеречислениЯ.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента;
				контактноеЛицоКонтрагента.Наименование = СтрШапки.ФИО;
				контактноеЛицоКонтрагента.Записать();	
				
				//оформляем новому клиенту расчетный счет
				Если  СтрШапки.БИК <> "" Тогда
					//Ищем банк в справочнике Банки по БИК
					СпрБанки = Справочники.Банки;
					БанкКлиента = СпрБанки.НайтиПоКоду(СтрШапки.БИК);
					Если БанкКлиента = СпрБанки.ПустаяСсылка() Тогда
						//создаем новый банк
						БанкКлиента = СпрБанки.СоздатьЭлемент();
						БанкКлиента.Код = СтрШапки.БИК;
						БанкКлиента.Наименование = СтрШапки.Банк;
						БанкКлиента.Город = СтрШапки.ГородБанка;
						БанкКлиента.КоррСчет = СтрШапки.КорСчет;
						БанкКлиента.Записать();
						ДобавитьВЛогФайл("Создан новый банк с БИК - " + СтрШапки.БИК + ".", ПараметрыАгента.Агент, 0);
					КонецЕсли;
					//ищем счет клиента
					Попытка
						БанковскиеСчета = Справочники.БанковскиеСчета;
						БанковскийСчет = БанковскиеСчета.СоздатьЭлемент();
						БанковскийСчет.Наименование = "Р/С";
						БанковскийСчет.НомерСчета = СтрШапки.РСчет;
						БанковскийСчет.Банк = БанкКлиента.Ссылка;
						БанковскийСчет.Владелец = НовыйКонтрагент.ссылка;
						БанковскийСчет.ВалютаДенежныхСредств = мВалютаРегламентированногоУчета;
						БанковскийСчет.ВидСчета = "Расчетный";
						БанковскийСчет.Записать();
					Исключение
						глПоследняяОшибкаПроведения = "Указанный счет некорректен";
						ВызватьИсключение;
					КонецПопытки				
				КонецЕсли;
				// Договор
				Договор              = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			    Договор.Наименование = "Основной договор";
				//Договор.ВалютаВзаиморасчетов = ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
				Договор.ВалютаВзаиморасчетов = ПолучитьЗначениеПоУмолчаниюПользователя(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
				Если НЕ ЗначениеЗаполнено(Договор.ВалютаВзаиморасчетов) Тогда
					Договор.ВалютаВзаиморасчетов = мВалютаРегламентированногоУчета;
				КонецЕсли;
				//Договор.Организация = ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	            Договор.Организация = ПолучитьЗначениеПоУмолчаниюПользователя(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
				Если (НЕ ЗначениеЗаполнено(Договор.Организация)) И (ПараметрыАгента.Организации.Количество() > 0) Тогда
					Договор.Организация = ПараметрыАгента.Организации[0].Организация;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Договор.Организация) Тогда
					Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.Организации");
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Договор.Организация = Выборка.Ссылка;
					Иначе
						ДобавитьВЛогФайл("Не удалось записать основной договор контрагента (не найдена организация).", ПараметрыАгента.Агент, 0);
					КонецЕсли;
				КонецЕсли;
				Договор.Владелец = НовыйКонтрагент.Ссылка;
				
				Если Покупатель Тогда
					Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
					Договор.ТипЦен = ПолучитьЗначениеПоУмолчаниюПользователя(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойТипЦенПродажи");
				ИначеЕсли Поставщик Тогда
					Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
					Договор.ТипЦен = ПолучитьЗначениеПоУмолчаниюПользователя(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойТипЦенПокупки");
				Иначе
					Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
				КонецЕсли;
				
				Попытка
					Договор.Записать();
					НовыйКонтрагент.ОсновнойДоговорКонтрагента = Договор.Ссылка;
					НовыйКонтрагент.Записать();
	    		Исключение
		        	ДобавитьВЛогФайл(ОписаниеОшибки(), ПараметрыАгента.Агент, 0);
				КонецПопытки;
				
				//По заказу Амида Щахвердиева чтобы создавался документ назначение контрагентов для экспедитора
				
				НовДок = Документы.УстановкаСвязиЭкспедиторовСКонтрагентами.СоздатьДокумент();
				НовДок.Дата = ТекущаяДата();
				НовДок.Экспедитор = ПараметрыАгента.Экспедитор;
				НовДок.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НовДок.Организация = Справочники.Организации.НайтиПоКоду("000000026");
				нс = НовДок.КонтрагентыЭкспедитора.Добавить();
				нс.Контрагент = НовыйКонтрагент.Ссылка;
				НовДок.Записать(РежимЗаписиДокумента.Проведение);
				
				
				//GPS координаты контрагентов
				Широта	= СтрЗаменить(СтрШапки.Широта, ",", ".");
				Долгота	= СтрЗаменить(СтрШапки.Долгота, ",", ".");
				Если ЗначениеЗаполнено(Широта) И ЗначениеЗаполнено(Долгота) Тогда
					УстановитьКоординатыКонтрагента(НовыйКонтрагент.Ссылка,Широта,Долгота);
				КонецЕсли; 

				НовСтр = ТаблКодов.Добавить();
				НовСтр.КодВКПК = СтрШапки.ИдДок;
				НовСтр.КодВ1С = НовыйКонтрагент.Код;
				ЗаписатьФотоДокумента(НовыйКонтрагент.Ссылка, СтрШапки.Фото, 29);
				ЗафиксироватьТранзакцию();
				ЗаписатьУникКодДокумента(НовыйКонтрагент, УникДок);
				
			Исключение
				Если глПоследняяОшибкаПроведения = "" Тогда
					глПоследняяОшибкаПроведения = ОписаниеОшибки();
				КонецЕсли;
				ОтменитьТранзакцию();
				НовСтр = ТаблКодов.Добавить();
				НовСтр.КодВКПК = СтрШапки.ИдДок;
				НовСтр.КодВ1С = "";
				НовСтр.Сообщение = УбратьСпецСимволы(глПоследняяОшибкаПроведения);
			КонецПопытки
		КонецЕсли;	
	КонецЦикла;
	//отправить новые коды клиентов
	Для Каждого СтрКодов Из ТаблКодов Цикл
		глПоследняяОшибкаПроведения = ОписаниеОшибки();
		Ответ = Строка(СтрКодов.КодВКПК) + Таб + СокрЛП(СтрКодов.КодВ1С) + Таб + СтрКодов.Сообщение + РазделительСтрок;
		СерверПослатьОтвет(Адрес, Ответ, 0);
	КонецЦикла;
	СерверПослатьОтвет(Адрес, РазделительСтрок, 1);
	Возврат Истина;
КонецФункции	

// Вызывается при нажатии на панели "1" кнопки "Ключи"
Процедура КоманднаяПанель1Ключи(Кнопка)
	ПолучитьФорму("Ключи").ОткрытьМодально();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "О программе"
Процедура КоманднаяПанель1ОПрограмме(Кнопка)
	ПолучитьФорму("ОПрограмме").ОткрытьМодально();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Тех поддержка"
Процедура КоманднаяПанель1ТехПоддержка(Кнопка)
	ПолучитьФорму("ТехПоддержка").ОткрытьМодально();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Агенты"
Процедура КоманднаяПанель1Агенты(Кнопка)
	ПолучитьФорму("Агенты",ЭтаФорма).Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Каналы сбыта"
Процедура КоманднаяПанель1КаналыСбыта(Кнопка)
	ПолучитьФорму("НастройкаКаналовСбыта",ЭтаФорма).Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Параметры"
Процедура КоманднаяПанель1Параметры(Кнопка)
	ПолучитьФорму("Параметры",ЭтаФорма).Открыть();
	ОбновлениеОтображения();	
КонецПроцедуры

// Обрабатывает нажатие на надпись "Папка"
Процедура НадписьПапкаНажатие(Элемент)
	ЗапуститьПриложение(Элемент.Заголовок);
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Остатки у контрагента"
Процедура КоманднаяПанель1ОстаткиУКонтрагента(Кнопка)
	ПолучитьФорму("ОтчетОстаткиУКонтрагента",ЭтаФорма).Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Треки движения агентов"
Процедура КоманднаяПанель1ТрекиДвиженияАгентов(Кнопка)
	Если ПроверитьВозможностьРаботыКарт() Тогда
		ПолучитьФорму("ТрекиАгентов",ЭтаФорма).Открыть();
	КонецЕсли;
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Координаты контрагентов"
Процедура КоманднаяПанель1КоординатыКонтрагентов(Кнопка)
	Если ПроверитьВозможностьРаботыКарт() Тогда
		ПолучитьФорму("КоординатыКонтрагентов",ЭтаФорма).Открыть();
	КонецЕсли;
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Где агенты"
Процедура КоманднаяПанель1ГдеАгенты(Кнопка)
	Если ПроверитьВозможностьРаботыКарт() Тогда
		Форма=ПолучитьФорму("Карта",ЭтаФорма);
		Форма.ПоказатьАгентов=Истина;
		Форма.Обновление=Истина;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Маршруты"
Процедура КоманднаяПанель1Маршруты(Кнопка)
	Если ЗаданияВозможны Тогда
		ПолучитьФорму("НастройкаМаршрутов",ЭтаФорма,ТекущаяДата()).Открыть();
	Иначе
		Предупреждение("В стандартной Бухгалтерии 2.0 нет возможности использовать задания."
		+ Символы.ПС + "В конфигурацию необходимо добавить Документ ""Событие""!", 10);
		ЗапуститьПриложение("http://mobi-c.ru/help/mobi_subsystem_bu2z.htm");
	КонецЕсли;
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Сообщения"
Процедура КоманднаяПанель1Сообщения(Кнопка)
	ПолучитьФорму("ЖурналСообщений",ЭтаФорма).Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Групповая обработка агентов"
Процедура КоманднаяПанель1ГрупповаяОбработкаАгентов(Кнопка)
	ПолучитьФорму("ГрупповаяОбработкаАгентов",ЭтаФорма).Открыть();
КонецПроцедуры

//открывает журнал документов инвентаризация
Процедура КоманднаяПанель1Инвентаризации(Кнопка)
	Документы.ИнвентаризацияТоваровНаСкладе.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Контроль фото"
Процедура КоманднаяПанель1КонтрольФото(Кнопка)
	ПолучитьФорму("КонтрольФото",ЭтаФорма).Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Координаты по адресу"
Процедура КоманднаяПанель1КоординатыПоАдресу(Кнопка)
	ПолучитьФорму("КоординатыПоАдресу",ЭтаФорма).Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Координаты по карте"
Процедура КоманднаяПанель1ОпределениеКоординатПоКарте(Кнопка)
	Если ПроверитьВозможностьРаботыКарт() Тогда
		ПолучитьФорму("КоординатыПоКарте",ЭтаФорма).Открыть();
	КонецЕсли;
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Контроль выполнения заданий"
Процедура КоманднаяПанель1КонтрольВыполненияЗаданий(Кнопка)
	Форма=ПолучитьФорму("КонтрольВыполненияЗаданий",ЭтаФорма, "КонтрольВыполненияЗаданий");
	Форма.Заголовок = "Контроль выполнения заданий";
	Форма.ИдМакета="КонтрольВыполненияЗаданий_СКД";
	Форма.Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Контроль посещений"
Процедура КоманднаяПанель1КонтрольПосещений(Кнопка)
	Форма=ПолучитьФорму("КонтрольВыполненияЗаданий",ЭтаФорма, "КонтрольПосещений");
	Форма.Заголовок = "Контроль посещений";
	Форма.ИдМакета="КонтрольПосещений_СКД";
	Форма.Открыть();
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Лог агента"
Процедура КоманднаяПанель1ЛогАгента(Кнопка)
	ПолучитьФорму("ПросмотрЛогов",ЭтаФорма).Открыть();
КонецПроцедуры

// Формирует таблицу печатных форм для КПК
// Возвращаемое значение:
// 		ТаблицаЗначений, колонки:
// 			Наименование - Строка, название формы для пользователя КПК
// 			КодВладельца - Число, код объекта, которому принадлежит форма
// 			ФайлФормы - Строка, путь к файлу формы
Функция ПрочитатьПечатныеФормы() Экспорт
	ТаблПечФорм=Новый ТаблицаЗначений;
	ТаблПечФорм.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
	ТаблПечФорм.Колонки.Добавить("КодВладельца",Новый ОписаниеТипов("Число"));
	ТаблПечФорм.Колонки.Добавить("ФайлФормы",Новый ОписаниеТипов("Строка"));
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ТОРГ-12";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="torg12.xml";
	
	Если Конфигурация = "БухКазахстан" Тогда
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Счёт-фактура";
		НовСтр.КодВладельца=12;
		НовСтр.ФайлФормы="sf_kz.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Счёт-фактура";
		НовСтр.КодВладельца=16;
		НовСтр.ФайлФормы="sf_kz.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Форма 2-3";
		НовСтр.КодВладельца=12;
		НовСтр.ФайлФормы="form2_3kz.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Форма 2-3";
		НовСтр.КодВладельца=14;
		НовСтр.ФайлФормы="form2_3kz.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Форма 2-3";
		НовСтр.КодВладельца=16;
		НовСтр.ФайлФормы="form2_3kz.xml";
		
	Иначе
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Счёт-фактура";
		НовСтр.КодВладельца=12;
		НовСтр.ФайлФормы="sf.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Счёт-фактура(УПД)";
		НовСтр.КодВладельца=12;
		НовСтр.ФайлФормы="sf_upd.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Счёт-фактура";
		НовСтр.КодВладельца=16;
		НовСтр.ФайлФормы="sf.xml";
		
		НовСтр=ТаблПечФорм.Добавить();
		НовСтр.Наименование="Счёт-фактура(УПД)";
		НовСтр.КодВладельца=16;
		НовСтр.ФайлФормы="sf_upd.xml";
	КонецЕсли;
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Простая форма";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="simplern.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Товарный чек";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="tovcheck.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="1-Т Товарный раздел";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="ttn_1t_tov.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="1-Т Транспортный раздел";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="ttn_1t_tr.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ТН лицевая";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="ttn_2t.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ТН оборотная";
	НовСтр.КодВладельца=12;
	НовСтр.ФайлФормы="ttn_2t_revers.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Счёт на оплату";
	НовСтр.КодВладельца=14;
	НовСтр.ФайлФормы="order.xml";
		
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="1-Т Товарный раздел";
	НовСтр.КодВладельца=14;
	НовСтр.ФайлФормы="ttn_1t_tov.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="1-Т Транспортный раздел";
	НовСтр.КодВладельца=14;
	НовСтр.ФайлФормы="ttn_1t_tr.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ТН лицевая";
	НовСтр.КодВладельца=14;
	НовСтр.ФайлФормы="ttn_2t.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ТН оборотная";
	НовСтр.КодВладельца=14;
	НовСтр.ФайлФормы="ttn_2t_revers.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Простая форма";
	НовСтр.КодВладельца=14;
	НовСтр.ФайлФормы="simplern.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ТОРГ-12";
	НовСтр.КодВладельца=16;
	НовСтр.ФайлФормы="torg12.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Простая форма";
	НовСтр.КодВладельца=16;
	НовСтр.ФайлФормы="simplern.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="ПКО";
	НовСтр.КодВладельца=18;
	НовСтр.ФайлФормы="pko.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Инвентаризация";
	НовСтр.КодВладельца=37;
	НовСтр.ФайлФормы="inventory.xml";
	
	НовСтр=ТаблПечФорм.Добавить();
	НовСтр.Наименование="Список товаров";
	НовСтр.КодВладельца=4;
	НовСтр.ФайлФормы="goods.xml";
	
	Возврат ТаблПечФорм;
КонецФункции

//Выгружает формы, с которыми будет работать агент
// Параметры
// Адрес - идентификатор сессии обмена
// Возвращаемое значение Булево: ИСТИНА - если выгрузка прошла удачно, ЛОЖЬ- если были ошибки
Функция ВыгрузитьПечатныеФормы(Адрес)
	Если НЕ ПорцияОбмена(Адрес,"PrnForms","Выгружаются печатные формы...") Тогда
		Возврат Ложь;
	КонецЕсли;
	ТаблПечФорм = Новый ТаблицаЗначений;
	Табл = ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "ПечатныеФормы");
	Если ТипЗнч(Табл) = Тип("ТаблицаЗначений") Тогда
		ТаблПечФорм = Табл.Скопировать(Новый Структура("Исп", Истина), "Наименование, ФайлФормы, КодВладельца");
	Иначе
		ТаблПечФорм = ПрочитатьПечатныеФормы();
	КонецЕсли;
	Счетчик=0;
	Ответ="";
	НомСтр=1;
	ТекстДок = Новый ТекстовыйДокумент;
	
	Для Каждого СтрПечФормы Из ТаблПечФорм Цикл
		Если НЕ ЗначениеЗаполнено(СтрПечФормы.ФайлФормы) Тогда Продолжить; КонецЕсли;
		
		ПолныйПуть = ПолучитьКаталог("Forms")+"\"+СокрЛП(СтрПечФормы.ФайлФормы);
		Файл=Новый Файл(ПолныйПуть);
		Если Файл.Существует() Тогда
			ТекстДок.Прочитать(ПолныйПуть,КодировкаТекста.UTF8);
			ТекстФормы=ТекстДок.ПолучитьТекст();
			Ответ=Ответ
				+ УбратьСпецСимволы(Лев(СтрПечФормы.Наименование,30))+Таб
				+ ЦелоеВСтроку(СтрПечФормы.КодВладельца)+Таб
				+ УбратьСпецСимволы(ТекстФормы)+РазделительСтрок;
			
			НомСтр=НомСтр+1;
			Счетчик=Счетчик+1;
		Иначе
			ДобавитьОшибку("Не найдена печатная форма "+СтрПечФормы.ФайлФормы);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ПорцияОбмена(Адрес,Ответ,"Печатные формы выгружено "+Счетчик+" записей","Ошибка выгрузки Печатных форм");
КонецФункции

// Вызывается при нажатии на панели "1" кнопки "Видео первое знакомство"
Процедура КоманднаяПанель1ВидеоПервоеЗнакомство(Кнопка)
	ЗапуститьПриложение("https://mobi-c.ru/videos.html");
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Видео создание заявки"
Процедура КоманднаяПанель1ВидеоСозданиеЗаявки(Кнопка)
	ЗапуститьПриложение("https://mobi-c.ru/help/mobi_androidrequest.htm");
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Видео планирование посещений на карте"
Процедура КоманднаяПанель1ВидеоПланированиеПосещенийНаКарте(Кнопка)
	ЗапуститьПриложение("https://mobi-c.ru/help/mobimi8_journalroute.htm");
КонецПроцедуры

// Вызывается при нажатии на панели "1" кнопки "Сравнение маршрутов"
Процедура КоманднаяПанель1СравнениеМаршрутов(Кнопка)
	Форма = ПолучитьФорму("СравнениеМаршрутов", ЭтаФорма, "СравнениеМаршрутов");
	Форма.Открыть();	
КонецПроцедуры

// Вызывается при попытке сформировать отчет "Продажи через агентов"
Процедура КоманднаяПанель1ПродажиАгентов(Кнопка)
	Форма = ПолучитьФорму("ОтчетПродажиЧерезАгентов", ЭтаФорма, "ОтчетПродажиЧерезАгентов");
	Форма.ОткрытьМодально();
КонецПроцедуры

// открывает форму отчета Продажи через агентов
Процедура КоманднаяПанель1НастройкиВекторныеКарты(Кнопка)
	Форма=ПолучитьФорму("ПрокладкаМаршрутов",ЭтаФорма);
	Форма.ОткрытьМодально();
КонецПроцедуры

Процедура КоманднаяПанель1НастройкаКолонокДокументов(Кнопка)
	Форма=ПолучитьФорму("НастройкаКолонокДокументов",ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры

Процедура КоманднаяПанель1ЖурналФотографий(Кнопка)
	ПолучитьФорму("ЖурналФотографий",ЭтаФорма).Открыть();
КонецПроцедуры

Процедура КоманднаяПанель1ДополнительныеРеквизитыНаКПК(Кнопка)
	ПолучитьФорму("ДопРеквизиты",ЭтаФорма).Открыть();
КонецПроцедуры

Процедура КоманднаяПанель1СоставПечатныхФорм(Кнопка)
	ПолучитьФорму("ПечатныеФормы",ЭтаФорма).Открыть();
КонецПроцедуры

Процедура КоманднаяПанель1ОбновитьСтруктуруВнешнейБД(Кнопка)
	//в случае появления ошибок с MaxLocksPerFile необходимо сделать следующее
	//в зависимости от используемой версии Access и платформы открыть соответствующую ветку реестра
	//Access 2000, Access 2002, Access 2003 Windows 32 bit (x86) 
	//HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Jet\4.0\Engines\Jet 4.0

	//Access 2000, Access 2002, Access 2003 Windows 64 bit (x64)
	//HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\Microsoft\Jet\4.0\Engines\Jet 4.0

	//Access 2007 Windows 32 bit (x86) 
	//HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Office\12.0\Access Connectivity Engine\Engines\ACE

	//Access 2007 Windows 64 bit (x64) 
	//HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\Microsoft\Office\12.0\Access Connectivity Engine\Engines\ACE

	//Access 2010 Windows 32 bit (x86) 
	//HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Office\14.0\Access Connectivity Engine\Engines\ACE

	//Access 2010 Windows 64 bit (x64) 
	//HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\Microsoft\Office\14.0\Access Connectivity Engine\Engines\ACE	

    //затем увеличить (2-3-4 раза...) значение параметра MaxLocksPerFile
	//сохранить изменения и перезагрузить компьютер
	
	Если Вопрос(
			"Выбранное действие можно выполнять только когда обработка запущена в единственном экземпляре.
			|Выбранное действие может выполняться длительный промежуток времени.
			|Продолжить выполнение?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Внимание!") 
			= КодВозвратаДиалога.Да Тогда
		//ОбновитьСтруктуруВнешнейБД();
	КонецЕсли;
КонецПроцедуры

Процедура РежимОтладкиПриИзменении(Элемент)
	ЗаписатьВРегистрСохраненныеНастройки(МобиС, РежимОтладки, "РежимОтладки");	
	ЭлементыФормы.КоманднаяПанель1.Кнопки.Сервис.Кнопки.ОбновитьСтруктуруВнешнейБД.Доступность = РежимОтладки;
	
	//Если Ложь Тогда
	//	//оповещаем об изменении статуса режима отладки
	//	текстСообщения = "В" + ?(РежимОтладки, "", "ы") + "ключен режим отладки :";
	//	//пытаемся получить PID процесса 1С
	//	Попытка
	//		WSS=Новый COMОбъект("WScript.Shell");
	//		oExec=WSS.Exec("rundll32.exe kernel32,Sleep");
	//		чPID=ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\.\root\CIMV2:Win32_Process.Handle='"+Формат(oExec.ProcessID,"ЧГ=0")+"'").ParentProcessID;
	//		oExec.Terminate();		
	//		
	//		текстСообщения = текстСообщения + " PID - " + ЦелоеВСтроку(чPID) + "; ";		
	//	Исключение
	//	КонецПопытки;	
	//	Если НЕ АвтономныйРежим И НЕ РежимРабочееМесто Тогда		
	//		текстСообщения = текстСообщения + " порт - " + ЦелоеВСтроку(Порт) + ";";
	//	КонецЕсли;	
	//	ДобавитьВЛогФайл(РазделительСтрок + текстСообщения + " обработка - " + ПолучитьРасположениеОбработки());		
	//КонецЕсли;
			
КонецПроцедуры

Функция ПреобразоватьЦветВАбсолютный(ИсходныйЦвет)
	текТаблица = Новый ТабличныйДокумент;
	текТаблица.Область("R1C1").ЦветТекста = ИсходныйЦвет;
	ВремФайл=ПолучитьИмяВременногоФайла();
	текТаблица.Записать(ВремФайл, ТипФайлаТабличногоДокумента.MXL7); 
	текТаблица.Прочитать(ВремФайл);
	УдалитьФайлы(ВремФайл);
	Возврат текТаблица.Область("R1C1").ЦветТекста;
КонецФункции

Функция ВывестиСтатусОблачногоСервера(Статус = "")
	ЦветФона=ПреобразоватьЦветВАбсолютный(ЦветаСтиля.ЦветФонаФормы);
	ЦветФона=ЦветФона.Красный*256*256+ЦветФона.Зеленый*256+ЦветФона.Синий;
	Пока ЦветФона>0 Цикл
		Символ=ЦветФона%16;
		Если Символ>=10 Тогда
			Символ=Символ(55+Символ);
		Иначе
			Символ=Символ(48+Символ);
		КонецЕсли;
		Цвет16=Символ+Цвет16;
		
		ЦветФона=Цел(ЦветФона/16);
	КонецЦикла;
	Цвет16="#"+Прав("00000000"+Цвет16,6);
	
	ЦветФона=ПреобразоватьЦветВАбсолютный(ЦветаСтиля.ЦветФонаФормы);
	ЦветФона=ЦветФона.Красный*256*256+ЦветФона.Зеленый*256+ЦветФона.Синий;
	Пока ЦветФона>0 Цикл
		Символ=ЦветФона%16;
		Если Символ>=10 Тогда
			Символ=Символ(55+Символ);
		Иначе
			Символ=Символ(48+Символ);
		КонецЕсли;
		Цвет16=Символ+Цвет16;
		
		ЦветФона=Цел(ЦветФона/16);
	КонецЦикла;
	Цвет16="#"+Прав("00000000"+Цвет16,6);
	ЭлементыФормы.ПолеСтатус.Установитьтекст(
		"<html>"
		+ "<head>"
		+ "  <style>"
		+ "    html,body {"
		+ "		background-color:'"+Цвет16+"'; padding:0; margin:0; overflow:hidden; font-family:sans-serif; font-size:12px; }"
		+ "  </style>"
		+ "</head>"
		+ "<body>"
		+ Статус
		+ "</body>"
		+ "</html>");
КонецФункции

Процедура ОбновитьСтатусУчетнойСистемы()
	ВывестиСтатусОблачногоСервера();	
	КодУчетнойСистемы=ПрочитатьИзРегистраСохраненныеНастройки(МобиС, "КодУчетнойСистемы");
	Попытка
		СисИнфо=Новый СистемнаяИнформация;
		Версия=СтрЗаменить(СисИнфо.ВерсияПриложения,".",РазделительСтрок);
		
		Если Число(СтрПолучитьСтроку(Версия,2))<2 Тогда
			Соединение=Новый HTTPСоединение("mobi-c.ru");
		Иначе
			Соединение=Новый HTTPСоединение("mobi-c.ru",,,,,5);
		КонецЕсли;
		ИмяВремФайла=ПолучитьИмяВременногоФайла();
		Соединение.Получить("/components/com_licensing/info.php?cmd=accSystemStatus&id="+КодУчетнойСистемы,ИмяВремФайла);
		ЧтениеТекста=Новый ЧтениеТекста(ИмяВремФайла,КодировкаТекста.UTF8);
		Сообщение=ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
		УдалитьФайлы(ИмяВремФайла);
		ВывестиСтатусОблачногоСервера(Сообщение);
	Исключение
		//ВывестиСтатусОблачногоСервера(				
		//	"Потеряна связь с сервером Моби-С <br>
		//	|1. Проверьте соединение с интернет<br>
		//	|2. Перезапустите модуль интеграции");		
	КонецПопытки;
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "Параметры" Тогда	
		Если ИмяСобытия = "ТребуетсяПерезапуск" Тогда
			ЭлементыФормы.НадписьТребуетсяПерезапуск.Видимость = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура КнопкаОблачныйСерверНажатие(Элемент)
	ЗапуститьПриложение("http://mobi-c.ru/oblachnyj-server.html");
КонецПроцедуры

Функция ПроверитьДоступностьАдреса(адрес, врФайлПинг)
	стр = "";
	Если СуществуетФайл(врФайлПинг) Тогда
		тд = новый ТекстовыйДокумент();
		тд.Прочитать(врФайлПинг, КодировкаТекста.OEM);
		стр = тд.ПолучитьТекст();
		стр = СтрЗаменить(стр, символы.ПС, " ");
	//УдалитьФайлы(врФайлПинг);
	Иначе
		стр = " TTL";
	КонецЕсли;
	
	//не работает перенаправление вывода
	scr = новый COMОбъект("WScript.Shell");
	кодВозврата = scr.Run("cmd /a /c ""ping " + адрес + " -n 2 "" > " + врФайлПинг,0,0);
	Возврат Найти(стр, "TTL") > 0;
КонецФункции

Процедура ПроверитьСвязьССервером()
	Попытка                                   
		Если (ПроверитьДоступностьАдреса("8.8.4.4", врФайлПинг4) Или ПроверитьДоступностьАдреса("8.8.8.8", врФайлПинг8)) Тогда
		Иначе
			ТребуетсяПерезапускСервера = Истина;
			//адреса недоступны, надо перезапускать сервер			
			
			ЭлементыФормы.КнопкаОблачныйСерверПодключен.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверНеПодключен.Видимость=Истина;
			ЭлементыФормы.КнопкаОблачныйСерверПревышенЛимитПодключений.Видимость=Ложь;
			ЭлементыФормы.КнопкаОблачныйСерверОшибка.Видимость=Ложь;
			ДобавитьВЛогФайл("Нет соединения с интернет, переподключение к облачному серверу");
			ВывестиСтатусОблачногоСервера("Нет соединения с интернет, переподключение к облачному серверу");			
		КонецЕсли;
		
		Если ТребуетсяПерезапускСервера Тогда
			ПерезапускСервера();
		КонецЕсли;
		
	Исключение
		стр = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

Процедура КоманднаяПанель1АктивныеОбработки(Кнопка)
	ПолучитьФорму("АктивныеОбработки",ЭтаФорма).Открыть();
КонецПроцедуры

Процедура УдаленнаяПоддержка(Кнопка)
	Состояние("Поиск приложения TeamViewer для удаленной поддержки");
	Попытка
		обновитьТВ = Ложь;
		файлТВ = КаталогЛогФайлов + "\TeamViewerQS.exe";
        файлТим = новый Файл(файлТВ);
		Если файлТим.Существует() Тогда
		Иначе
		//если исполнительного файла TeamViewer нет, то надо его скачать
			обновитьТВ = Истина;
		КонецЕсли;
						
		Если обновитьТВ Тогда
			файлТВ = КаталогЛогФайлов + "\TeamViewerQS.exe";
			Попытка
				Состояние("Скачивание приложения TeamViewer для удаленной поддержки");
				КопироватьФайл("http://mobi-c.ru/arc/TeamViewerQS.exe", файлТВ);
			Исключение				
				оо = ОписаниеОшибки();
				ио = ИнформацияОбОшибке();
				Сообщить("Невозможно скачать http://mobi-c.ru/arc/TeamViewerQS.exe
				|в файл " + файлТВ);
				Попытка
					УдалитьФайлы(файлТВ);
				Исключение
				КонецПопытки;
			КонецПопытки;
		КонецЕсли;

		Состояние("Запуск приложения TeamViewer для удаленной поддержки");
		
		файл = новый Файл(файлТВ);
		Если Файл.Существует() Тогда
			ЗапуститьПриложение(файлТВ);
		КонецЕсли;
	Исключение
		стрОшибка = ОписаниеОшибки();
		Предупреждение(стрОшибка);
		ДобавитьВЛогФайл(стрОшибка);		
	КонецПопытки;
	Состояние("");
КонецПроцедуры
//Для SQlite
Процедура СконвертироватьТаблицу(БД, СтараяБД, ИмяТаблицы, МассивПолей)
	Сообщить("Преобразование таблицы "+ИмяТаблицы+"...");
	Состояние("Преобразование таблицы "+ИмяТаблицы+"...");

	НаборЗаписей=Неопределено;
	Попытка
		НаборЗаписей=СтараяБД.Execute("SELECT * FROM ["+ИмяТаблицы+"]");
	Исключение
		Возврат;
	КонецПопытки;
	
	ПереченьПолей=""; ПереченьПараметров="";
	Первый=Истина;
	Для Каждого ИмяПоля Из МассивПолей Цикл
		Если Первый Тогда
			Первый=Ложь;
		Иначе
			ПереченьПолей=ПереченьПолей+",";
			ПереченьПараметров=ПереченьПараметров+",";
		КонецЕсли;
		
		ПереченьПолей=ПереченьПолей+"["+ИмяПоля+"]";
		ПереченьПараметров=ПереченьПараметров+"?";
	КонецЦикла;
	
	БДЗапросБезРезультата(БД, "PRAGMA journal_mode=MEMORY");
	БДЗапросБезРезультата(БД, "PRAGMA synchronous=OFF");
	
	ТекстЗапроса="
		|INSERT OR REPLACE INTO ["+ИмяТаблицы+"] ("+ПереченьПолей+")
		|    VALUES("+ПереченьПараметров+")
		|";
		
	ПодгЗапрос=БДПодготовитьЗапрос(БД, ТекстЗапроса);
	БДЗапросБезРезультата(БД, "BEGIN TRANSACTION");
	Счетчик=0;
	КолвоПолей=МассивПолей.Количество();
	Пока НЕ НаборЗаписей.EOF Цикл
		Для Н=0 По КолвоПолей-1 Цикл
			ИмяПоля=МассивПолей[Н];
			ЗначПоля=NULL;
			Попытка
				ЗначПоля=НаборЗаписей.Fields(ИмяПоля).Value;
				
				Если ТипЗнч(ЗначПоля)=Тип("Дата") Тогда
					ЗначПоля=ДатаДляSQLite(ЗначПоля);
				ИначеЕсли ТипЗнч(ЗначПоля)=Тип("Строка") Тогда
					ЗначПоля=СокрЛП(ЗначПоля);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			БДУстановитьПараметр(ПодгЗапрос, Н+1, ЗначПоля);
		КонецЦикла;
		
		БДСледующаяЗапись(ПодгЗапрос);
		БДСбросПодготовленногоЗапроса(ПодгЗапрос);
		
		Если Счетчик%500=0 Тогда
			БДЗапросБезРезультата(БД, "COMMIT TRANSACTION");
			БДЗапросБезРезультата(БД, "BEGIN TRANSACTION");
			Состояние("Преобразование таблицы "+ИмяТаблицы+": "+Строка(Счетчик)+" записей выполнено");
		КонецЕсли;
		Счетчик=Счетчик+1;
		
		НаборЗаписей.MoveNext();
	КонецЦикла;
	НаборЗаписей.Close();
	
	БДЗакрытьПодготовленныйЗапрос(ПодгЗапрос);
	БДЗапросБезРезультата(БД, "COMMIT TRANSACTION");
	
	БДЗапросБезРезультата(БД, "PRAGMA journal_mode=DELETE");
	БДЗапросБезРезультата(БД, "PRAGMA synchronous=FULL");
	
	Сообщить("Преобразование таблицы "+ИмяТаблицы+": "+Строка(Счетчик)+" записей выполнено");
	Состояние();
КонецПроцедуры

Процедура ПроверитьВнешнююБД()
	
	ПутьКФайлуБлокировки=КаталогЛогФайлов + "\mobi_s.lck";
	Если ПроверитьФайлБлокировки(ПутьКФайлуБлокировки) Тогда
		ТекстВопроса="В данный момент выполняется преобразование данных из старого формата в новый.
			|Необходимо дождаться завершения процедуры преобразования.";
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОК, 10) = КодВозвратаДиалога.ОК Тогда
			ПроверитьВнешнююБД();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Результат = "";
	
	КонвертироватьСтаруюБД=Ложь;
	СтараяБД=Неопределено;
	ФайлБД=Новый Файл(КаталогЛогФайлов + "\mobi_s.sqlite3");
	Если НЕ ФайлБД.Существует() Тогда
		ФайлСтаройБД=Новый Файл(КаталогЛогФайлов + "\mobi_s.mdb");
		Если ФайлСтаройБД.Существует() Тогда
			Попытка
				СтараяБД = Новый COMОбъект("ADODB.Connection");
				СтараяБД.Mode = 3;
				СтараяБД.ConnectionTimeout = 30;
				СтараяБД.CommandTimeout = 300;
				СтараяБД.ConnectionString = "Provider=Microsoft.Jet.OLEDB.4.0; Data Source=" + ФайлСтаройБД.ПолноеИмя + ";";
				СтараяБД.Open();				
				КонвертироватьСтаруюБД=Истина;
				текст = "Для работы этой версии обработки Моби-С необходимо выполнить преобразование внешней базы данных Моби-С.
				|Преобразование может занять несколько минут";
				ДобавитьВЛогФайл("Преобразование базы mobi_s.mdb в SQLite формат");
				Предупреждение(текст, 20);				
				ОбработкаПрерыванияПользователя();
			Исключение
				текст = "";
				Если ЭтоСистема64 Тогда
					текст = "Для работы этой версии обработки Моби-С необходимо выполнить преобразование внешней базы данных 
					|Преобразование необходимо запустить на x86 (32 битной) версии платформы 1С
					|Без преобразования Вам будут недоступны данные Фотографии, Остатки, и старые сообщения агентам";
				Иначе
					текст = "Не удалось открыть старую базу mobi_s.mdb для преобразования в новый формат.
					|Без преобразования Вам будут недоступны данные Фотографии, Остатки, и старые сообщения агентам";
				КонецЕсли;
				ДобавитьВЛогФайл(текст);
				Предупреждение(текст);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Блокировщик = Неопределено;
	БД = ОткрытьВнешнююБД(Блокировщик, Истина);
	Если БД = Ложь Тогда
		Сообщить(ОшибкаНетДоступаКВнешнейБД, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;	
	
	ТекстЗапроса = "Create Table IF NOT EXISTS messages (
		|CODE decimal(7), 
		|DT char(20), 
		|AGENT text, 
		|OBJTYPE decimal(1), 
		|OBJKOD char(64), 
		|THEME char(250), 
		|BODY Text, 
		|STATUS decimal(1), 
		|DEL decimal(1),
		|TODO decimal(1), 
		|ACTUALLY date, 
		|ID char(40),
		|AUTHOR Text )";

		
	Если БДЗапросБезРезультата(БД, ТекстЗапроса) Тогда
		Если БДЗапросБезРезультата(БД, "SELECT AUTHOR FROM messages LIMIT 1") Тогда
		Иначе	
			БДЗапросБезРезультата(БД, "Alter Table messages add AUTHOR Text");
		КонецЕсли;		
		
		Если КонвертироватьСтаруюБД Тогда
			МассивПолей=Новый Массив();
			МассивПолей.Добавить("CODE");
			МассивПолей.Добавить("DT");
			МассивПолей.Добавить("AGENT");
			МассивПолей.Добавить("OBJTYPE");
			МассивПолей.Добавить("OBJKOD");
			МассивПолей.Добавить("THEME");
			МассивПолей.Добавить("BODY");
			МассивПолей.Добавить("STATUS");
			МассивПолей.Добавить("DEL");
			МассивПолей.Добавить("TODO");
			МассивПолей.Добавить("ACTUALLY");
			МассивПолей.Добавить("ID");
			МассивПолей.Добавить("AUTHOR");
			СконвертироватьТаблицу(БД, СтараяБД, "messages", МассивПолей);
		КонецЕсли;
	КонецЕсли;
		
	ТекстЗапроса = "Create Table IF NOT EXISTS OSTATKI (
		|NOMENKLATURA char(48), 
		|KONTRAGENT char(48), 
		|OSTATOK decimal(15,3), 
		|FACING decimal(15,3), 
		|AGENT text, 
		|DATA date)";	
	
	Если БДЗапросБезРезультата(БД, ТекстЗапроса) Тогда
		Если КонвертироватьСтаруюБД Тогда
			МассивПолей=Новый Массив();
			МассивПолей.Добавить("NOMENKLATURA");
			МассивПолей.Добавить("KONTRAGENT");
			МассивПолей.Добавить("OSTATOK");
			МассивПолей.Добавить("FACING");
			МассивПолей.Добавить("AGENT");
			МассивПолей.Добавить("DATA");
			СконвертироватьТаблицу(БД, СтараяБД, "OSTATKI", МассивПолей);
		КонецЕсли;
	КонецЕсли;;
	
	ТекстЗапроса = "CREATE TABLE IF NOT EXISTS Log (
		|[Agent] Text,
		|[DateTime] DateTime,
		|[Sequence] Integer4,
		|[Level] Integer4,
		|[Message] Text, 
		|Primary Key([Agent],[DateTime],[Sequence]))";
	
	Если БДЗапросБезРезультата(БД, ТекстЗапроса) Тогда
		Если Ложь И КонвертироватьСтаруюБД Тогда
			МассивПолей=Новый Массив();
			МассивПолей.Добавить("Agent");
			МассивПолей.Добавить("DateTime");
			МассивПолей.Добавить("Sequence");
			МассивПолей.Добавить("Level");
			МассивПолей.Добавить("Message");
			ДатаОчистки = ДобавитьМесяц(ТекущаяДатаСуточнаяКоррекция(), -2);
			ДатаAccess = "#"+Формат(Месяц(ДатаОчистки),"ЧЦ=2; ЧВН=") + "/"
						 + Формат(День(ДатаОчистки), "ЧЦ=2; ЧВН=") + "/"
			             + Формат(Год(ДатаОчистки), "ЧЦ=4; ЧВН=; ЧГ=") + " " 
						 + Формат(Час(ДатаОчистки), "ЧЦ=2; ЧН=; ЧВН=") + ":"
						 + Формат(Минута(ДатаОчистки), "ЧЦ=2; ЧН=; ЧВН=") + ":"
						 + Формат(Секунда(ДатаОчистки), "ЧЦ=2; ЧН=; ЧВН=") + "#";
			СтараяБД.Execute("DELETE FROM Log WHERE DateTime<"+ДатаAccess+"");
			СконвертироватьТаблицу(БД, СтараяБД, "Log", МассивПолей);
		КонецЕсли;		
	КонецЕсли;
	
	БДЗапросБезРезультата(БД, "CREATE INDEX IF NOT EXISTS IndexKONTRAGENT ON OSTATKI (KONTRAGENT)");
	
	БДЗапросБезРезультата(БД, "CREATE INDEX IF NOT EXISTS IndexKONTRAGENTDATA ON OSTATKI (KONTRAGENT,DATA)");
	
	ТекстЗапроса="Create Table IF NOT EXISTS IncomingPhotos (
		|    ObjectId char(50),
		|    MobiObjectType int,
		|    ObjectTypeName char(250),
		|    Filename Text,
		|    photoDate Date)
		|";

	Если БДЗапросБезРезультата(БД, ТекстЗапроса) Тогда
		Если КонвертироватьСтаруюБД Тогда
			МассивПолей=Новый Массив();
			МассивПолей.Добавить("ObjectId");
			МассивПолей.Добавить("MobiObjectType");
			МассивПолей.Добавить("ObjectTypeName");
			МассивПолей.Добавить("Filename");
			МассивПолей.Добавить("photoDate");
			СконвертироватьТаблицу(БД, СтараяБД, "IncomingPhotos", МассивПолей);
		КонецЕсли;
	КонецЕсли;
	
	БДЗапросБезРезультата(БД, "CREATE INDEX IF NOT EXISTS IndexObj ON IncomingPhotos (ObjectId)");
	
	ТекстЗапроса="CREATE TABLE IF NOT EXISTS PhotoMetadata ([FileName] Text,[Metadata] Text, Primary Key([FileName]))";
	Если БДЗапросБезРезультата(БД, ТекстЗапроса) Тогда
		Если КонвертироватьСтаруюБД Тогда
			МассивПолей=Новый Массив();
			МассивПолей.Добавить("FileName");
			МассивПолей.Добавить("Metadata");
			СконвертироватьТаблицу(БД, СтараяБД, "PhotoMetadata", МассивПолей);
		КонецЕсли;
	КонецЕсли;
	
	ДатаПоследнегоСжатияMDB = ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"ДатаПоследнегоСжатияMDB");
	Если Не ЗначениеЗаполнено(ДатаПоследнегоСжатияMDB) Тогда
		ДатаПоследнегоСжатияMDB = ДатаПустая();
	КонецЕсли;
	начДн = НачалоДня(ТекущаяДатаСуточнаяКоррекция());
	Если НачалоМесяца(ДатаПоследнегоСжатияMDB) <> НачалоМесяца(начДн) Тогда
		Состояние("Выполнение регламентых операций с базой данных.");
		ДатаПоследнегоСжатияMDB = начДн;
		ЗаписатьВРегистрСохраненныеНастройки(МобиС, ДатаПоследнегоСжатияMDB, "ДатаПоследнегоСжатияMDB");
		СжатьВнешнююБД(БД);
	КонецЕсли;	
	
	ЗакрытьВнешнююБД(БД, Блокировщик);
	
	Состояние("");	
КонецПроцедуры

Процедура КоманднаяПанель1ОбновитьМакетыОнлайнКарт(Кнопка)
	Если Вопрос("Заменить существующие макеты онлайн карт?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Попытка
			ВременныйФайлЗагрузчика = КаталогЛогФайлов + "\loader.txt"; // Для отладки
			ВременныйФайлЗагрузчика = ПолучитьИмяВременногоФайла();
			КопироватьФайл("http://mobi-c.ru/arc/loader.txt", ВременныйФайлЗагрузчика);
			чт = новый ЧтениеТекста(ВременныйФайлЗагрузчика,КодировкаТекста.UTF8);
			ОбщийТекст = чт.Прочитать();
			чт.Закрыть();
			УдалитьФайлы(ВременныйФайлЗагрузчика);
			
			// Загрузка макетов
			НачалоОбработки = Найти(ОбщийТекст, ":ut10");
			Если НачалоОбработки = 0 Тогда
				ВызватьИсключение "Ошибка доступа";
			КонецЕсли;
			ОбщийТекст = Сред(ОбщийТекст,  НачалоОбработки);
			СтрокаФайлы = СтрПолучитьСтроку(ОбщийТекст, 2);
			СтрокиФайлы = СтрЗаменить(СтрокаФайлы, ";", Символы.ПС);
			Для номерФайла =1 По СтрЧислоСтрок(СтрокиФайлы) Цикл
	    		именафайлов = СтрПолучитьСтроку(СтрокиФайлы, номерФайла);
				именафайлов = СтрЗаменить(именафайлов, "#", Символы.ПС);
				МакетНаСайте = СтрПолучитьСтроку(именафайлов, 1);
				МакетВОбработке = СтрПолучитьСтроку(именафайлов, 2);
				КопироватьФайл("http://mobi-c.ru/arc/" + МакетНаСайте + ".txt", КаталогЛогФайлов + "\Макет" + МакетВОбработке + ".html");
			КонецЦикла;
				
			// Загрузка текста загрузчика карт
		
			ТекстЗагрузчика = Сред(ОбщийТекст,  Найти(ОбщийТекст, "//НачалоБлокаЗагрузчика"));
			ТекстЗагрузчика = Сред(ТекстЗагрузчика, 1, Найти(ТекстЗагрузчика, "//КонецБлокаЗагрузчика") -1); 
			
			ЗаписьТекста=Новый ЗаписьТекста(КаталогЛогФайлов + "\ЗагрузчикМакетаНФ.txt",КодировкаТекста.UTF8);
			ЗаписьТекста.Записать(ТекстЗагрузчика);
			ЗаписьТекста.Закрыть();
			ИспользоватьВстроенныеМакетыКарт = Ложь;
			ЗаписатьВРегистрСохраненныеНастройки(МобиС, ИспользоватьВстроенныеМакетыКарт, "ИспользоватьВстроенныеМакетыКарт");
			Сообщить("Макеты карт успешно обновлены.");
			//
		Исключение
			ИспользоватьВстроенныеМакетыКарт = Истина;
			ЗаписатьВРегистрСохраненныеНастройки(МобиС, ИспользоватьВстроенныеМакетыКарт, "ИспользоватьВстроенныеМакетыКарт");
			Сообщить("Ошибка загрузки макетов карт. Будут использоваться встроенные макеты.");
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура КнопкаУведомленияСправкаНажатие(Элемент)
	ЗапуститьПриложение("http://mobi-c.ru/help/mi8_pushmsg.htm");
КонецПроцедуры

Процедура НадписьТехническаяПоддержкаНажатие(Элемент)
	ЗапуститьПриложение("http://mobi-c.ru/help/mobi_getsupport.htm");	
КонецПроцедуры

Функция ИнформацияОСистемеКратко()
	
	онлайнКлючей = КоличествоOnLineКлючей();

	СисИнфо = Новый СистемнаяИнформация;		
	ОС = СисИнфо.ВерсияОС;
	Платформа_ = СисИнфо.ВерсияПриложения + ?(ВерсияПлатформы = 81, ""," (" + СисИнфо.ТипПлатформы + ")");
	Конфигурация_ = Метаданные.Имя + " (" + Метаданные.Версия +  ")";
	ТипБазы = Лев(СтрокаСоединенияИнформационнойБазы(), 3);
	
	ЧислоКлючей = 0;
	Ключи=ПрочитатьИзРегистраСохраненныеНастройки(МобиС,"СписокКПК");
	Если Ключи <> Неопределено Тогда
	Иначе
		ЧислоКлючей = Ключи.Количество();
	КонецЕсли;
	
	датаБиблиотеки = "нет данных";
	Если Сервер <> Неопределено Тогда
		датаБиблиотеки = Сервер.ПолучитьДатуСборки();
	КонецЕсли;
		
	Возврат 
		"Обработка: " + ВерсияОбработки + ?(ЧислоКлючей + онлайнКлючей > 0, " " + Формат(ЧислоКлючей, "ЧДЦ=0; ЧН=0; ЧГ=0") + "/" + Формат(онлайнКлючей, "ЧДЦ=0; ЧН=0; ЧГ=0"), "") + "
		|Основной каталог: " + КаталогЛогФайлов + "
		|Конфигурация: " + Конфигурация_ + "
		|Платформа: " + Платформа_ + "
		|PocketServer: " + датаБиблиотеки + "
		|Версия ОС: " + ОС;
КонецФункции

Процедура КнопкаИнформацияСпособПредоставленияБонусовНажатие(Элемент)
	текст = ИнформацияОСистемеКратко();
		
	Попытка
	    htmlFile = Новый COMОбъект("htmlfile");
	    htmlFile.ParentWindow.ClipboardData.Setdata("Text", Текст);
		текст = "Скопировано в буфер обмена
		|" + текст;
	Исключение
	КонецПопытки;
	
	Сообщить(текст);	
КонецПроцедуры

///////////////////////////////////////////////
// ОСНОВНЫЕ ОПЕРАТОРЫ ПРОГРАММЫ
ДниНедели = Новый Массив;
ДниНедели.Добавить("ПН");
ДниНедели.Добавить("ВТ");
ДниНедели.Добавить("СР");
ДниНедели.Добавить("ЧТ");
ДниНедели.Добавить("ПТ");
ДниНедели.Добавить("СБ");
ДниНедели.Добавить("ВС");

ОшибкаВыгрузкаСАктивнойТранзакцией = "Невозможно выгрузить данные в 1С. Обратитесь к ответственному за Моби-С."